[{
    "id": 1,
    "src": "/background/yanmiaobackground.jpg",
    "alt": "Imagen 1",
    "title": "Yan Miao",
    "weapon": "Yan Miao",
    "weapon_effects": "When the weapon is fully charged, the next attack will apply an armor melt effect to enemies for 45 seconds, increasing the physical and flame damage they take by 10%, and in team play this value is additionally increased by 15% [armor melt replaces the grievous effect on the target and does not allow grievous to get applied again for the duration of armor melt). Every 15 seconds, a target affected by armor melt will be stunned for 2 seconds when taking physical damage and slowed by 50% for 5 seconds when taking flame damage.",
    "element_resonance": "Increase Physical ATK by 15% and Physical Resistance by 25%. Activate by equipping 2 or more Physical weapons. This set effect works in the off-hand slot. Cannot stack with other Physical Resonance effects, with Physical Resonance taking precedence.",
    "weapon_passive": "When landing any hit with Equilibrium, it deals damage to nearby targets equal to 2,250% of physical ATK plus 38% of the Wanderer's Max HP plus 1.350% of the sum of all the Wanderer's resistance types plus 4,500% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Flying Blade damage is counted as normal attack damage. If there is 1 frost/volt weapon of any kind equipped, Flying Blade damage is multiplied by 2.5 times. In addition, Flying Blade damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "The number of Flaming Daggers received from Empyrean Rotation is increased to 4, and the maximum Frequency of Flaming Dagger use is reduced to once every 1.8 seconds.",
        "3★": "Wanderer ignores 30% of the target's physical and flame resistances [the total value of ignoring resistance to a particular element cannot exceed 50%).",
        "5★": "When Flaming Dagger is triggered, wanderer gains a shield equal to 30% of Max HP for 20 seconds. The shields gained cannot exceed 30% of Max HP [shields that exceed this value will be converted into healing at the rate of 50% of the shield].",
        "6★": "Flaming Daggers damage is increased to 8,800% and the Final damage buff after a Flaming Dagger is triggered is further increased by 16%."
    },
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "16.00",
    "charge": "12.00"
},
{
    "id": 2,
    "src": "/background/nanyinbackground.jpg",
    "alt": "Imagen 2",
    "title": "Nan Yin",
    "weapon": "Nan Yin",
    "weapon_effects": "Influence: after switching the weapon to Black Bamboo, Black Bamboo's damage element type will be changed to the element type of the previous active weapon.Temporary Dwelling: any unlocked wanderer's weapon can be enhanced with Darkness in the settings of a specific weapon.Darkness-enhanced weapons deals 4% more damage.When not spreading to other weapons, Darkness resides in Black Bamboo, increasing all wanderer's damage dealt by 9% when Black Bamboo is the current active weapon.",
    "element_resonance": "Last Knock: Increase ATK by 30%. Activate by equipping 3 altered weapons. This set effect works in the off-hand slot.",
    "weapon_passive": "When landing any hit with Equilibrium, it deals damage to nearby targets equal to 2,250% of physical ATK plus 38% of the Wanderer's Max HP plus 1.350% of the sum of all the Wanderer's resistance types plus 4,500% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Flying Blade damage is counted as normal attack damage. If there is 1 frost/volt weapon of any kind equipped, Flying Blade damage is multiplied by 2.5 times. In addition, Flying Blade damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "The number of Flaming Daggers received from Empyrean Rotation is increased to 4, and the maximum Frequency of Flaming Dagger use is reduced to once every 1.8 seconds.",
        
        "3★": "Wanderer ignores 30% of the target's physical and flame resistances [the total value of ignoring resistance to a particular element cannot exceed 50%).",
       
        "5★": "When Flaming Dagger is triggered, wanderer gains a shield equal to 30% of Max HP for 20 seconds. The shields gained cannot exceed 30% of Max HP [shields that exceed this value will be converted into healing at the rate of 50% of the shield].",
        "6★": "Flaming Daggers damage is increased to 8,800% and the Final damage buff after a Flaming Dagger is triggered is further increased by 16%."
    },
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "12.00"
},
{
    "id": 3,
    "src": "/background/linghanbackground.jpg",
    "alt": "Imagen 3",
    "title": "Ling Han",
    "weapon": "Alabaster Tiger",
    "weapon_effects": "Extreme Cold: Unload: After using Sword Art: Shadowy Ice, every second, deal damage equal to 70% of frost ATK plus 10% of the Wanderer's Max HP plus 36% of the sum of all the Wanderer's resistance types plus 135% of crit for 30 seconds. Multiple Unload damage will not stack and Extreme Cold damage will be counted as skill damage. If there is 1 volt/flame/physical weapon of any kind equipped, Extreme Cold damage is multiplied by 1.3 times. In addition, Extreme Cold damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "element_resonance": "Frost Resonance: Increase Frost ATK by 15% and Frost Resistance by 25%. Activate by equipping 2 or more Frost weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "When landing any hit with Equilibrium, it deals damage to nearby targets equal to 2,250% of physical ATK plus 38% of the Wanderer's Max HP plus 1.350% of the sum of all the Wanderer's resistance types plus 4,500% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Flying Blade damage is counted as normal attack damage. If there is 1 frost/volt weapon of any kind equipped, Flying Blade damage is multiplied by 2.5 times. In addition, Flying Blade damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "After launching Frost Blades, the Wanderer's frost ATK is increased by 10% and nearby targets will be dealt damage equal to 80% of ATK every second for 30 seconds.",
        "3★": "The Wanderer can produce up to 4 Frost Blades and Temperature Reduction's damage's base multiplier is increased to 360%. If the target is the only one affected by Temperature Reduction within 6 seconds, additionally apply Vein Seal to the target, reducing their speed by 30% (unavailable in Apex League and against bosses). If the target receives Frost Blade damage again during Vein Seal's duration, trigger Icy Burst, dealing skill damage equal to 1,700% of ATK plus 2% of the target's HP lost at that point (Icy Burst damage will be no lower than 2,000% of the Wanderer's frost ATK and no higher than 2,200% of the Wanderer's frost ATK). Then, remove the Vein Seal and Temperature Reduction effects on the target.",
        "5★": "The damage dealt by Crystalline Crack and Cold Air is additionally increased by 50%. Light Steps' use attempts is increased to 10 and recovery rate is increased to 1 attempt every 3 seconds.",
        "6★": " The Temperature Reduction effect inflicted after firing Frost Blades is now applied to an area and also deals additional damage equal to 990% of ATK to nearby targets."
    },
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "16.00",
    "charge": "8.00"
}


]