[
  {
    "id": 1,
    "src": "/background/cocoritterbackground.jpg",
    "alt": "Imagen 1",
    "title": "Cocoritter",
    "weapon": "Absolute Zero",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect also works in the off-hand slot. Cannot stack with effects of the same type. Increase the entire team's frost ATK by 5% when Benediction resonance is active.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ After dodging, summon a healing bee that follows the user and heals the ally with the lowest percentage of HP within 15 meters. Heal for 25% of ATK and restore 50 weapon charge points each time and last for 25 seconds. Cooldown: 25 seconds.",
      "3★": "3★ Use Sanctuary or discharge skills to remove debuffs from targets, can be used while being affected by control effects. Increase shatter and damage dealt for all teammates within range by 20%, and grant them immunity to control effects and shatter.",
      "5★": "5★ Increase healing effect by 15%, plus an additional 20% when healing targets with less than 60% HP.",
      "6★": "6★ Whenever a healing bee is summoned or disappears from battle, heal all allies for 100% of the user's ATK. All allies within 10 meters of the healing bee also gain 15% all damage and healing boost (cannot stack)."
    },
    "matrice_src": "/matrices/cocorittermatrice.jpg",
    "matrice_2p": "Increase healing capability and healing received by 10%/12%/14%/16%.",
    "matrice_4p": "When you or your teammates are healed, increase ATK by 12.5%/15%/17.5%/20% for 6 seconds. Only the highest level's effect is applied when obtained repeatedly.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "4.00",
    "charge": "12.50"
  },
  {
    "id": 2,
    "src": "/background/crowbackground.jpg",
    "alt": "Imagen 2",
    "title": "Crow",
    "weapon": "Thunderblades",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Attacking targets from behind increases crit rate of all dual blades attacks by 40%. Backstabbing an electrified target increases crit rate by 100% and crit damage by 30%.",
      "3★": "3★ Increase damage by 30% to targets with less than 60% HP.",
      "5★": "5★ Triggering a Back Attack grants a 100% crit chance for the next 4 seconds and increases crit damage by 50%. Cooldown: 10 seconds.",
      "6★": "6★ After using a skill, increase volt damage dealt to the target by 20% for 20 seconds."
    },
    "matrice_src": "/matrices/crowmatrice.jpg",
    "matrice_2p": "Increase crit damage to targets with less than 60% HP by 24%/30%/36%/42%.",
    "matrice_4p": "Crits deal additional damage over time equal to 18%/22%/26%/30% of ATK every second for 5 seconds. Does not stack.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "6.00",
    "charge": "8.00"
  },
  {
    "id": 3,
    "src": "/background/humabackground.jpg",
    "alt": "Imagen 3",
    "title": "Huma",
    "weapon": "Molten Shield V2",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Gain a stack of Strong Shield upon casting Discharge: Seething Rage. Using a dodge skill or branch skill while in shield form grants a stack of Strong Shield, which grants 10% damage reduction for 15 seconds and stacks up to 3 times. Switching to axe form converts all Strong Shield stacks to Sharp Axe stacks, each of which increases damage dealt by 15% for 15 seconds. Switching to a different weapon cancels this effect.",
      "3★": "3★ While in shield form, branch/dodge attacks deal additional damage to targets equal to 4% of the user's current HP.",
      "5★": "5★ After switching to a shield axe, immediately grant 30% damage reduction that diminishes by 10% every 3 seconds, down to a minimum of 10%. Switching weapons cancels this effect. Cooldown: 30 seconds.",
      "6★": "6★ Enhance conversion skills. Shield Conversion Enhancement: Increase damage dealt by 60% and expand the radius of the flame zone by 30%. Axe Conversion Enhancement: Does not share cooldown with Shield Conversion. For the next 5 seconds after using this skill, turns all damage received into HP (up to a maximum of 15% of the user's Max HP)."
    },
    "matrice_src": "/matrices/humamatrice.jpg",
    "matrice_2p": "Hitting targets with dodge skills inflicts bleed, dealing damage equal to 15%/19%/22.5%/26% of ATK every second for 5 seconds.",
    "matrice_4p": "Reduce ATK of all targets within 8 meters that are taking damage over time by 10%/12%/13%/15%. Only the highest level's effect is applied when obtained repeatedly.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "10.00",
    "charge": "10.00"
  },
  {
    "id": 4,
    "src": "/background/kingbackground.jpg",
    "alt": "Imagen 4",
    "title": "King",
    "weapon": "Scythe of the Crow",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Increase shatter by 15%. After shattering the target's shield, deal burn damage equal to 120% of ATK to the target every second for 15 seconds.",
      "3★": "3★ Increase damage dealt by 10% for each enemy within 6 meters, up to a maximum of 30%.",
      "5★": "5★ Increase damage dealt against HP shields or shielded enemies by 100%.",
      "6★": "6★ Increase damage dealt by 10% for each enemy slain for 30 seconds. Stack up to 3 times."
    },
    "matrice_src": "/matrices/kingmatrice.jpg",
    "matrice_2p": "When a target is shattered, grant 8%/10%/12%/14% damage boost for 25 seconds. Only the highest level is applied when the effect is obtained repeatedly.",
    "matrice_4p": "When there are more than 2 enemies around, hits restore HP equal to 14%/18%/22%/26% of damage dealt upon attacking. The maximum HP restored every 0.5 seconds must not exceed 36%/42%/48%/54% of ATK.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "5.00"
  },
  {
    "id": 5,
    "src": "/background/merylbackground.jpg",
    "alt": "Imagen 5",
    "title": "Meryl",
    "weapon": "Rosy Edge",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Increase shatter by 15% and restore 10% of HP after shattering the target's shield.",
      "3★": "3★ Upon switching to the weapon, gain an Ice Shield equal to 10% of Max HP. Cooldown 20 seconds. The Ice Shield lasts up to 10 seconds.",
      "5★": "5★ Increase damage and shatter by 50% while the shield is active.",
      "6★": "6★ Upon switching to the weapon, gain an Ice Shield equal to 20% of Max HP and immmune to controls when shield is active. Cooldown: 20 seconds. The Ice Shield lasts up to 10 seconds."
    },
    "matrice_src": "/matrices/merylmatrice.jpg",
    "matrice_2p": "If HP is less than 30% after being attacked, gain a shield equal to 20%/26%/32%/40% of Max HP for 10 seconds. Cooldown: 90 seconds.",
    "matrice_4p": "Increase Whirlwind's damage by 36%/45%/54%/63% and restore HP equal to 30%/38%/44%/50% of the damage dealt while Whirlwind is active. The maximum HP restored every 0.5 seconds cannot exceed 60%/72%/81%/90% of ATK.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "4.00"
  },
  {
    "id": 6,
    "src": "/background/samirbackground.jpg",
    "alt": "Imagen 6",
    "title": "Samir",
    "weapon": "Dual EM Stars",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Trigger an electrical explosion on the target after landing a critical hit, dealing additional damage equal to 30% of ATK to the target and nearby enemies. Cooldown: 0.2 seconds.",
      "3★": "3★ Increase crit rate to electrified targets by 40%. Electrical explosions extend the duration of electrified effects by 0.5 seconds, up to a maximum of 5 seconds.",
      "5★": "5★ Double the duration of Electro Field and pull targets into the center of the attack.",
      "6★": "6★ Triggering an electrical explosion reduces skill cooldowns by 1 second."
    },
    "matrice_src": "/matrices/samirmatrice.jpg",
    "matrice_2p": "Increase damage progressively by 1% upon hitting a target. Stack up to 10/13/16/20 times. Lasts 1.5 seconds.",
    "matrice_4p": "Increase Dual EM Stars' electrical explosion damage by 16%/22%/30%/40% of ATK.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "6.00",
    "charge": "10.70"
  },
  {
    "id": 7,
    "src": "/background/shirobackground.jpg",
    "alt": "Imagen 7",
    "title": "Shiro",
    "weapon": "Chakram of the Seas",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Increase damage dealt to and all elemental shattering effects on targets within Full Bloom's range by 30%.",
      "3★": "3★ Increase shatter by 15% and reset all weapon skill cooldowns upon shattering the target's shield. Can only be triggered once every 30 seconds.",
      "5★": "5★ Attacking a grievous target extends the duration of grievous by an additional 7 seconds (only take effect once for the same effect).",
      "6★": "6★ After using Full Bloom, grant a 100% crit chance for the next 8 seconds"
    },
    "matrice_src": "/matrices/shiromatrice.jpg",
    "matrice_2p": "Increase both damage and shatter to targets with more than 50% HP by 15%/19%/22.5%/26%.",
    "matrice_4p": "Upon entering battle, gain a 20%/25%/30%/35% damage boost for 35 seconds. Reset 5 seconds after exiting battle.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "10.00",
    "charge": "6.00"
  },
  {
    "id": 8,
    "src": "/background/tsubasabackground.jpg",
    "alt": "Imagen 8",
    "title": "Tsubasa",
    "weapon": "Icewind Arrow",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Deal damage and produce a healing orb, which lasts for 20 seconds and restore HP of any teammate who picks it up equal to 60% of ATK. 2-second cooldown.",
      "3★": "3★ Reduce skill cooldown from 60 seconds to 30 seconds. Restore HP equal to 30% of ATK every second while the shield is active.",
      "5★": "5★ Damaging a target also produces a damage orb, which lasts for 20 seconds and increases all damage and healing of any teammate who picks it up by 2% for 30 seconds. Stack up to 10 times. Skill cooldown is 2.5 seconds.",
      "6★": "6★ Using a Skill grants allies healing orbs and damage orbs equal to the number of Omnium Cubes."
    },
    "matrice_src": "/matrices/tsubasamatrice.jpg",
    "matrice_2p": "Increase damage dealt by 14%/16%/18%/20% when there are no enemies within 4 meters.",
    "matrice_4p": "Upon a headshot or using Icewind Arrow: Piercing Shot, increase ATK by 15%/18%/21%/25% for 8 seconds.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "4.00",
    "charge": "11.50"
  },
  {
    "id": 9,
    "src": "/background/zerobackground.jpg",
    "alt": "Imagen 9",
    "title": "Zero",
    "weapon": "Negating Cube",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 20% and flame resistance by 40%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with other Flame Resonance or Flame Reaction effects, with Flame Resonance taking precedence.",
    "weapon_passive": "Increase the entire team's flame ATK by 5% when Benediction Resonance is activated.",
    "advancements": {
      "1★": "1★ Deal damage and produce a healing orb, which lasts for 20 seconds and restore HP of any teammate who picks it up equal to 60% of ATK. 2-second cooldown.",
      "3★": "3★ Reduce skill cooldown from 60 seconds to 30 seconds. Restore HP equal to 30% of ATK every second while the shield is active.",
      "5★": "5★ Damaging a target also produces a damage orb, which lasts for 20 seconds and increases all damage and healing of any teammate who picks it up by 2% for 30 seconds. Stack up to 10 times. Skill cooldown is 2.5 seconds.",
      "6★": "6★ Using a Skill grants allies healing orbs and damage orbs equal to the number of Omnium Cubes."
    },
    "matrice_src": "/matrices/zeromatrice.jpg",
    "matrice_2p": "Upon using a discharge skill to switch to the current weapon, gain a shield equal to 150%/200%/250%/300% of ATK for 6 seconds.",
    "matrice_4p": "While the shield is active, you and your teammates deal 16%/20%/24%/28% more damage.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "5.00",
    "charge": "13.00"
  },
  {
    "id": 10,
    "src": "/background/claudiabackground.jpg",
    "alt": "Imagen 10",
    "title": "Claudia",
    "weapon": "Guren Blade",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical-damage weapons. This set also works with weapons in the off-hand slot. This effect does not stack repeatedly.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ After hitting a target with a skill or discharge skill, grant 1 stack of the following buff: Increase damage dealt by 8% for 25 seconds, stacking up to 3 times for a maximum of 1 stack per skill use.",
      "3★": "3★ When hitting a target with a skill or discharge skill, apply 1 stack of War Wounds to the target: Increase incoming physical damage and shatter from physical weapons by 10% for 15 seconds. Stack up to 1 time.",
      "5★": "5★ Hitting targets with skills or discharge skills grants Skill Damage Boost, which increases all weapon skill damage by 20% for 25 seconds. This effect cannot be stacked.",
      "6★": "6★ Skills hitting the same target no longer have reduced damage. After using Guren Blade's skills or discharge skill, all targets with War Wounds within 8 meters gain another 1 stack of War Wounds."
    },
    "matrice_src": "/matrices/claudiamatrice.jpg",
    "matrice_2p": "Increase damage against debuffed targets by 14%/16%/18%/20%.",
    "matrice_4p": "Restore 1 dodge attempt every 3 dodges. Dodge skills inflict burn upon hit, dealing damage equal to 24%/30%/36%/42% of ATK every 0.5 seconds for 4 seconds.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "7.50",
    "charge": "12.00"
  },
  {
    "id": 11,
    "src": "/background/cobaltbbackground.jpg",
    "alt": "Imagen 11",
    "title": "Cobalt B",
    "weapon": "Flaming Revolver",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. This effect does not stack repeatedly.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Each round of Barrage deals additional damage equal to 2% of the target's current HP (cannot exceed 180% of ATK).",
      "3★": "3★ Heavy Bombardment branch skill and Close Quarters dodge attack inflict Ion Scorch on targets that are already burned, dealing flame damage equal to 40% of ATK every second for 10 seconds.",
      "5★": "5★ The damage from Ion Scorch increases to 60% of ATK. Successful attacks with any weapon's dodge skill will refresh the duration of Ion Scorch.",
      "6★": "6★ Barrage inflicts burn for 15 seconds. Successful attacks with any weapon's dodge skills reduce cooldown of Barrage by 4 seconds. This effect has a 1.5-second cooldown."
    },
    "matrice_src": "/matrices/cobaltbmatrice.jpg",
    "matrice_2p": "Increase damage against debuffed targets by 14%/16%/18%/20%.",
    "matrice_4p": "Restore 1 dodge attempt every 3 dodges. Dodge skills inflict burn upon hit, dealing damage equal to 24%/30%/36%/42% of ATK every 0.5 seconds for 4 seconds.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "10.00"
  },
  {
    "id": 12,
    "src": "/background/bayuekibackground.jpg",
    "alt": "Imagen 12",
    "title": "Bayuekui",
    "weapon": "Alaya",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "When entering combat, trigger War Intent, increasing your final damage by 15% but accelerating your cellular aging (lose 1% of your current HP every 5 seconds). The effect disappears when leaving battle or switching weapons. If your HP drops below 50%, cellular aging stops but the damage boost from War Intent remains (switching weapons causes the effect to disappear).",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Dodge attacks gain an additional hit dealing 80% of ATK + 2.5% of HP lost. The Weapon Skill explodes for an additional 160% of ATK + 5% of HP lost. The Discharge Skill deals an additional 160% of ATK + 5% of lost HP (does not apply to the DoT).",
      "3★": "3★ Increase shatter by 15%. Breaking a shield releases an instant burst of damage at the target's location, dealing 680% of ATK to targets within range, or 1500% of ATK if there is only one target within range.",
      "5★": "5★ When attacked, automatically trigger a 1 second block (immediately negates crowd control), blocking one hit up to 20% of your max HP. Performing a basic attack during the block period will initiate a counter attack, dealing 240% of ATK and launching the target airborne, cooldown 18 seconds.",
      "6★": "6★ While inside the area of the Discharge Skill or Phantasia, trigger War Intent for 7 seconds, increasing your final damage by 40% and halting cellular aging (switching weapons causes the effect to disappear)."
    },
    "matrice_src": "/matrices/bayuekimatrice.jpg",
    "matrice_2p": "If you have 200~999 charge when switching to this weapon, use 200 charge to gain a 15%/18%/21%/25% attack boost for 15 seconds, cooldown 5 seconds, does not stack.",
    "matrice_4p": "When you delay using a discharge skill, the next discharge skill will deal AoE damage to enemies within 5m. The AoE will increase by 106%/122%/140%/160% every 0.6 seconds, up to 530%/610%/700%/800%. The discharge will also increase Shatter by 7%/14%/21%/28% for 4 seconds. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "8.00"
  },
  {
    "id": 13,
    "src": "/background/marcbackground.jpg",
    "alt": "Imagen 13",
    "title": "Marc",
    "weapon": "Dawn",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "[GROUP PLAY] When using Re-entry, Form Switch, or Full Shot, take 40% damage for your lowest HP ally and recover 10% of it back after 10 seconds. Only activates while using Fortitude Resonance and the effect cannot be removed early or reactivated until it ends. [SOLO PLAY] Mecha Form gains 50% physical damage reduction. Mecha basic attack/Double Smash/Impact Slash will give 1 point of Mecha Energy. At 20 points, convert 20% of your current HP into a [Omni Shield] with 1.5x your max HP (cannot exceed 1.5x max HP and healing is reduced by 50% while active). The shield lasts for 15 seconds and cannot be gained if you are below 10% HP. After the duration, 66.7% of the remaining shield value is converted to HP, and hitting a weak target nets 2 points of energy. When triggering the effect, convert active HP shields into [Omni Shield]. Other HP shields cannot be obtained while active.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Activating Re-entry, Form Switch, or Full Shot will instantly grant [Omni Shield].",
      "3★": "3★ When [Omni Shield] breaks or refreshes, increase final damage by 35% for 20 seconds, does not stack.",
      "5★": "5★ When [Omni Shield] breaks or refreshes, inflict 160% of ATK + 5% of lost HP to nearby targets and gains 50 weapon charge points on hit.",
      "6★": "6★ While [Omni Shield] is active, Physical Resistance is doubled and provides Dominance effect. [Omni Shield] can be obtained when another Weapon Skill or Discharge Skill hits the target while the shield is active."
    },
    "matrice_src": "/matrices/marcmatrice.jpg",
    "matrice_2p": "Attacking an enemy adds a life shield to all teammates for 15% of your current HP, lasting 15 seconds and resetting after leaving combat for 10 seconds. This shield combines with other shields. When the shield is activated, damage received is reduced by 11%/13%/15%/17% for 15 seconds (not stackable). This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "matrice_4p": "When life shields are obtained from any source, increase your ATK by 6%/7.5%/9%/11.5% and teammates' ATK by 3%/3.5%/4.5%/5.75% for 15 seconds, up to 3 stacks. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "9.00",
    "charge": "12.00"
  },
  {
    "id": 14,
    "src": "/background/nemesisbackground.jpg",
    "alt": "Imagen 14",
    "title": "Nemesis",
    "weapon": "Venus",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set's effects do not work with others.",
    "weapon_passive": "Increase the entire team's volt ATK by 5% when Benediction Resonance is active.",
    "advancements": {
      "1★": "1★ After using Pulse Lock or Particle Beam Burst, creates 1 Electrode that immediately grants the user 5 stacks of healing chain enhance. In addition, unleash a healing chain that heals nearby allies by 135% of the Wanderer's ATK.",
      "3★": "3★ Every 6 seconds, the Electrode will unleash Ring Lightning, which deals damage equal to a maximum of 205% of ATK in a target area.",
      "5★": "5★ After using Pulse Lock, increase the Wanderer's ATK by (5 + (Number of Electrodes x 5)) % for 25 seconds.",
      "6★": "6★ Up to 2 Electrodes can be active at the same time. Summoning more Electrodes will replace the ones furthest from the user."
    },
    "matrice_src": "/matrices/nemesismatrice.jpg",
    "matrice_2p": "When a target is being healed, their volt ATK is increased by 8%/10%/12%/15% for 20 seconds. The effect does not stack, and only the highest level's effect is applied when obtained repeatedly.",
    "matrice_4p": "When healing yourself or your Electrode, the healed target gains a charge of Lightning. The next attack within 30 seconds will cast lightning upon the target, dealing volt damage equal to 240%/300%/360%/420% of volt ATK, and damage caused by electrodes is reduced by 50%. Cannot be triggered more than once in 10 seconds. Lightning charges do not stack. Only the highest level's effect is applied when obtained repeatedly.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "6.00",
    "charge": "8.00"
  },
  {
    "id": 15,
    "src": "/background/friggbackground.jpg",
    "alt": "Imagen 15",
    "title": "Frigg",
    "weapon": "Balmung",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set's effect also works with weapons in the off-hand slot. This effect does not stack.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Gain 1 frostiness point every time you deal 550% x Frost ATK of damage in the Frost Domain. Up to 10 points can be accumulated.When Frost Domain ends, frostiness points x Frost ATK x 95% of blast damage will be dealt to all enemies in the Frost Domain. After leaving the Frost Domain lose 1 frostiness point every 3 seconds.",
      "3★": "3★ The maximum frostiness is increased to 15 points. Unleashing discharge skills with frost weapons in the Frost Domain will deal 25% x Frost ATK of damage to all targets in the Frost Domain (Gain +5 frostiness points).",
      "5★": "5★ Shattering shields using frost weapons in the Frost Domain will freeze the target for 2 seconds and cause frostiness points x Frost ATK x 35% of additional damage (if the target cannot be frozen, double the additional damage dealt).",
      "6★": "6★ When frostiness reaches 15 points and you are in the Frost Domain, you will get an additional Domain of Frost II that increases Frost ATK by 25% when frost weapons are used."
    },
    "matrice_src": "/matrices/friggmatrice.jpg",
    "matrice_2p": "Increase frost ATK by 8%/10%/12%/15% for 10 seconds when switching between frost weapons. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "matrice_4p": "When unleashing a frost domain with the weapon Balmung, enemies within the frost domain receive frost damage equal to 55%/65%/75%/85% of frost ATK every second.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "8.00",
    "charge": "8.00"
  },
  {
    "id": 16,
    "src": "/background/rubybackground.jpg",
    "alt": "Imagen 16",
    "title": "Ruby",
    "weapon": "Spark",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Emblazen boosts the damage of Spark Attack to 80%. Skill cooldown drops to 24 seconds.",
      "3★": "3★ Emblazen increases flame boost by 8% and the burn multiplier to 75%",
      "5★": "5★ Restore an additional 75 points of weapon charge each time Spark Attack hits an enemy. Cooldown: 0.9 seconds. Shatter increases by 25% when Ultimate Heat is active.",
      "6★": "6★ Emblazen boosts the damage of Spark Attack to 160% and double Heat acquisition efficiency. Skill cooldown drops to 16 seconds."
    },
    "matrice_src": "/matrices/rubymatrice.jpg",
    "matrice_2p": "Increases flame ATK after casting weapon skill by 8%/10%/12%/15% for 25 seconds. If multiple star rating effects are triggered, the one triggered last prevails. This effect does not stack.",
    "matrice_4p": "Grant Mastery after casting weapon skill for 15 seconds, with a cooldown of 15 seconds (Mastery shares cooldowns across levels). Mastery is not stackable. Increases flame damage by 2%/2.5%/3%/3.5% every time the target is hit with a normal attack until the end of Mastery. Stacks up to 6 times, adding a maximum of 1 stack every 0.2 seconds. At 6 stacks, grants a shield that can block damage 1 time.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "11.50",
    "charge": "8.00"
  },
  {
    "id": 17,
    "src": "/background/sakifuwabackground.jpg",
    "alt": "Imagen 17",
    "title": "Saki Fuwa",
    "weapon": "Heartstream",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ When Frost Resonance is activated, all weapon skill cooldowns are cleared every 5 times weapon skills are used, and the damage of Flow and Counterattack is doubled for the next 25 seconds.",
      "3★": "3★ Excited Flow: Increase the damage of Sword Shadow: Surge to 350% of Frost ATK. Silent Flow: The cooldown of Sword Shadow: Surge becomes 5 seconds.",
      "5★": "5★ Freeze time and trigger Phantasia upon Surge hitting the target. Share cooldown with the Phantasia triggered by dodging.",
      "6★": "6★ Upon hitting a target with Surge, increase frost damage by 11% for 15 seconds. Upon triggering block with Sword Shadow, reduce the frost damage dealt by enemy targets by 25% for 12 seconds."
    },
    "matrice_src": "/matrices/sakifuwamatrice.jpg",
    "matrice_2p": "When Frost Resonance gets triggered: Every 3 seconds, deal frost damage equal to 65%/80%/95%/110% of frost ATK to enemies within a 10-meter radius and apply the Icefrost effect: Inflict 5% slow effect that lasts for 3.5 seconds, freeze targets for 3 seconds at 3 stacks (does not apply to bosses), and increase frost damage taken by the target by 5% for 18 seconds. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "matrice_4p": "Attack the target 10 times to inflict a 12-second Flashfreeze mark. Flashfreeze: Increase frost damage dealt to the marked target by 11%/13%/15%/17%. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "13.90",
    "charge": "8.00"
  },
  {
    "id": 18,
    "src": "/background/linbackground.jpg",
    "alt": "Imagen 18",
    "title": "Lin",
    "weapon": "Shadoweave",
    "weapon_effects": "When the weapon is fully charged, the next attack will mark the target, causing an explosion after 5 seconds. Additionally inflict 25% of all damage received by the target while the mark exists, up to a total of 560.00% of your ATK. Only 1 mark can be added on a target at a time.",
    "element_resonance": "When pairing Shadoweave with other weapons, the Weapons Master effect can be created. Epiphyllum will appear around the target randomly and explode within 1-3 seconds, dealing 25% area damage.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Normal attacks now deal area damage upon hit. When there is another epiphyllum within the epiphyllum explosion area, increase the damage of each of the subsequent epiphyllum explosions by 10%, up to a maximum of 50%. The epiphyllum generation interval from Moonlight Realm is now reduced to 0.5 seconds.",
      "3★": "3★ The epiphyllum generation interval from Moonlight Realm is now reduced to 0.3 seconds. Epiphyllums will attach to the enemy. The duration of Moonlight Realm is now increased to 20 seconds.",
      "5★": "5★ While under the effect of Moonlight Realm, gain 30 weapon charge every second and increase the damage of discharge skills by 15%.",
      "6★": "6★ Moonlight Realm can be activated up to 2 times. Gain 1 charge from skill cooldown. Gain 1 charge from using discharge skills 3 times (effective in the background). The ATK bonus while inside Moonlight Realm is increased to 23%."
    },
    "matrice_src": "/matrices/linmatrice.jpg",
    "matrice_2p": "Increase ATK by 2.1%/2.6%/3.1%/3.6% on hit for 18 seconds, stacking up to 5 times. Only the effect of the highest level is applied when obtained repeatedly.",
    "matrice_4p": "Every 5m traveled within Moonlight Realm grants 1 stack of Moonlight, increasing final damage by 4%/4.9%/5.8%/6.7% for 15 seconds, stacking up to 3 times. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "11.50",
    "charge": "11.50"
  },
  {
    "id": 19,
    "src": "/background/lyrabackground.jpg",
    "alt": "Imagen 19",
    "title": "Lyra",
    "weapon": "Vesper",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "Increase the entire team's physical ATK by 5% when Benediction Resonance is active.",
    "advancements": {
      "1★": "1★ When releasing any weapon skill or discharge, if your Guards are at the maximum, the Guard duration will be refreshed, dealing physical damage equal to 30% of physical ATK × number of Guards to the enemy. Up to 8 Guards when under the effect of Benediction, and up to 6 without it.",
      "3★": "3★ Increases all damage dealt by Guards by 20%, and increase the guarded target's final damage by 15% for 10 seconds when releasing any weapon skill or discharge under the effect of Benediction Resonance.",
      "5★": "5★ Forgiveness Guard: After releasing Resonance 5 times, receive 1 chance to negate fatal damage for the wielder and the guarded target. After a temmate negates fatal damage, they will consume Forgiveness Guard and recover 5% of Max HP. Unavailable in Apex League. Enlightenment Guard: After releasing Resonance 5 times and when having Enlightenment Guard, the wielder receives 2 chances to negate fatal damage. Stack up to 5 times. After the wielder negates fatal damage, they will consume 1 stack of Enlightenment Guard and recover 5% of Max HP. Unavailable in Apex League.",
      "6★": "6★ When unleashing any weapon skill or discharge, the increase of final damage and healing depends on the number of Guards. Each Guard increases final damage and healing by 1.6%, up to 8% for 25 seconds."
    },
    "matrice_src": "/matrices/lyramatrice.jpg",
    "matrice_2p": "Use this weapon to increase all attack types by 13%/17%/21%/25%. The lower the HP, the higher the healing received, which can be increased up to 100%.",
    "matrice_4p": "When dealing physical damage, increase physical damage by 2.7% with a cooldown of 0.1 seconds. Stack up to 5 times. Upon reaching the maximum stacks, increase physical damage by an additional 3.5%/7%/10.5%/14% for 5 seconds. Only the highest star rating's effect is applied when obtained repeatedly. Obtain 1 block for each dodge, blocking damage up to 60% of current HP, but not less than 20% of Max HP. Stack up to 3 blocks for 10 seconds.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "10.00"
  },
  {
    "id": 20,
    "src": "/background/tianlangbackground.jpg",
    "alt": "Imagen 20",
    "title": "Tian Lang",
    "weapon": "Thunderbreaker",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set effect also works with weapons in the off-hand slot. Effect does not stack with Volt Resonance.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Gain 1 stack of Superconductor per charge: Increase Max HP by 7.5% but increase damage received by 2% (except when the current HP is lower than 50 times volt ATK and no HP Shield is equipped), stacking up to 8 times. Lose 1 stack if no Superconductor gets refreshed within 6 seconds.",
      "3★": "3★ Release any volt weapon skill or discharge skill to get 2 charges. Gain hyperbody at 8 Superconductor stacks.",
      "5★": "5★ Each Superconductor stack increases final damage by 1%.",
      "6★": "6★ Boost Dubhe's Volt Sense: For every 1 other volt weapon sensed, gain 10% damage boost for 25 seconds."
    },
    "matrice_src": "/matrices/tianlangmatrice.jpg",
    "matrice_2p": "Every time volt damage is dealt, there is a 40% chance of triggering chain lightning, dealing damage equal to 50%/65%/90%/120% of volt ATK to up to 7 targets. Cooldown: 2 seconds. Every time chain lightning is triggered, increase volt damage by 6% for 6 seconds (chain lightning will not trigger attack effects). This effect cannot be stacked. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "matrice_4p": "Every time a volt weapon's skill or discharge skill is used, increase volt damage by 12%/14%/16%/18% for 15 seconds. This effect cannot be stacked. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "8.00"
  },
  {
    "id": 21,
    "src": "/background/anabellabackground.jpg",
    "alt": "Imagen 21",
    "title": "Anabella",
    "weapon": "Clover Cross",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Hitting a target 2 times with Cross Snipe creates an Optical Space for 12 seconds at the target location. After an enemy in the Optical Space triggers burn tally, burn tally will be triggered an additional 2 times. When an enemy leaves the Optical Space, their speed is reduced by 80% for 2.5 seconds. Cooldown: 12 seconds. Targets of Cross Snipe will be terrified (speed is slowed by 80%) for 1.5 seconds. Cooldown: 4 seconds.",
      "3★": "3★ After Cross Snipe lands a critical hit, recover HP equal to 50% of the damage deal (not exceeding 15% of own Max HP and not including damage from Gas Explosion), and 50 weapon charge. Each stack of Tranquil Heart increases final crit rate to 6%, up to 18%, and converts up to 9% of crit damage.",
      "5★": "5★ Ruthless Bomb Enhancement: While in the Burn Enhancement state, burn damage dealt to targets is increased to 30%. Deceitful Bomb Enhancement: Gas explosion damage ignores 30% of the target's flame resistance.",
      "6★": "6★ Increase damage dealt by Cross Snipe by an additional 12%."
    },
    "matrice_src": "/matrices/anabellamatrice.jpg",
    "matrice_2p": "After hitting a target with a flame weapon, increase final damage by 3%/3.4%/3.8%/4.2% and final crit rate by 2%/2%/2.4%/2.4% for 25 seconds, stacking up to 2 times. Only the effect with the highest star rating is applied when obtained repeatedly.",
    "matrice_4p": "When equipping 2 or more flame weapons, gain Flowing Fire, which increases final damage by 7%/8%/9%/10%, and increases crit damage by an additional 12%/14%/16%/18% for 25 seconds after landing a critical hit. For every 3 charged attacks that hit the target, restore 1 dodge attempt. Cooldown: 2 seconds. Only the effect with the highest star rating is applied when obtained repeatedly.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "9.00"
  },
  {
    "id": 22,
    "src": "/background/alyssbackground.jpg",
    "alt": "Imagen 22",
    "title": "Alyss",
    "weapon": "Unyielding Wing",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Receive Alyss's support when using any frost weapon skill in the Chilling Field, summoning Alyss to cast a discharge skill on the field, which is the equivalent of Wanderer casting a discharge skill. The skill that triggers the discharge skill will then be used again afterward. Alyss's supporting discharge skill damage is equal to 70% of her skill's original damage.",
      "3★": "3★ Receive Alyss's Support every time Starry Night is triggered and increase Starry Night and Hoarfrost Damage by 10% for 12 seconds. Stack up to 3 times.",
      "5★": "5★ Increase the damage of Unyielding Wing's normal attack and Spatial Slice by 35%. The Wanderer receives Alyss's Protection upon taking fatal damage, protecting the Wanderer from death 1 time and making the Wanderer immune to damage for a short time. Cooldown: 60 seconds.",
      "6★": "6★ Increase frost damage by 12% when Alyss's Support reaches 3 stacks."
    },
    "matrice_src": "/matrices/alyssmatrice.jpg",
    "matrice_2p": "Increase final damage by 4.5%/5.5%/6.5%/7.5% every time you switch to this weapon. Increase frost damage by an additional 3% for 18 seconds if it's a frost weapon. Only the set with the highest star rating will take effect.",
    "matrice_4p": "Increase final damage by 6%/7.5%/9%/10.5% for 18 seconds every time you use Unyielding Wing's discharge skill, stacking up to 2 times. Remove 1 stack when the duration ends. This set effect works in the off-hand slot and the same Matrix's effect cannot be stacked repeatedly. Latent State's endurance consumption is reduced by 50%.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "8.00",
    "charge": "12.00"
  },
  {
    "id": 23,
    "src": "/background/umibackground.jpg",
    "alt": "Imagen 23",
    "title": "Umi",
    "weapon": "Mobius",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ When switching to Mobius, immediately gain 30 warmup points. Cooldown: 17 seconds. Upon entering Magic Trick, deal area damage equal to 840% of ATK to nearby targets and reduce their physical resistance by 10% for 20 seconds.",
      "3★": "3★ When ending Magic Trick early, deal wide-area damage over 13 seconds. The current cooldown of Mobius' skill is reduced, and physical damage is increased by 25% for a period of time (this effect does not apply to Mobius). If Magic Trick has more than 13 seconds remaining, gain an additional 200 weapon charge. The more time remaining when Magic Trick ends, the higher the area damage, the greater the skill cooldown reduction, and the longer the physical damage boost lasts. The area damage dealt is capped at 200% of ATK (the maximum damage is dealt when the remaining time is more than 13 seconds). The maximum cooldown reduction is 13 seconds, and the physical damage boost can last up to 20 seconds.",
      "5★": "5★ Gain the Psychic Puppet effect upon entering Magic Trick, increasing Mobius's physical damage boost to 15%. During Magic Trick, recover 2% of Max HP and 10 weapon charge every second.",
      "6★": "6★ During Magic Trick, Mobius has an additional whip that is automatically swung whenever Mobius uses normal attacks or dodge attacks, dealing damage equal to 100% of Mobius's ATK (this damage is not counted as dealing normal attacks)."
    },
    "matrice_src": "/matrices/umimatrice.jpg",
    "matrice_2p": "When dealing physical damage, increase final damage by 4%/5%/6%/7% and physical damage by an additional 2%/2.5%/3%/3.5% for 3 seconds. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "matrice_4p": "When equipping 2 or more physical weapons, increase final damage by 15%/17%/19%/21%. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "9.00"
  },
  {
    "id": 24,
    "src": "/background/fenrirbackground.jpg",
    "alt": "Imagen 24",
    "title": "Fenrir",
    "weapon": "Gleipnir",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type. [ELEMENTAL BALANCING] Increase all ATK by 15%. Activate by equipping 3 weapons with different elements. This effect also works with weapons in the off-hand slot.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ When Su-Paw-Star summons a consciousness and is on cooldown, gain the Aural Fever skill. Rush to the target and attack multiple times, dealing damage up to 720% of ATK. Each hit landed slows the enemy for a brief period and restores HP equal to 100% of ATK. The last hit places 2 musical notes on the target. Aural Fever cooldown: 15 seconds. When 3 or more notes are detonated and the cooldown of Aural Fever is greater than 5 seconds, clear the cooldown of Aural Fever. This effect can only trigger 1 time every 15 seconds.",
      "3★": "3★ While Songworld is active: For every 45% of max HP lost or when using the skill Aural Fever, trigger a Songworld Quake which deals damage equal to 650% of ATK to targets in the Songworld. For every 99% of max HP lost, gain 1 escape death (block a lethal effect and become immune to damage for a short time) for 45 seconds, stacking up to 1 time.",
      "5★": "5★ Increase the damage multiplier of musical notes' detonation to 40%, and the DoT caused by intoxication to 1.5% of max HP every second. While Songworld is active, Songworld Quake is triggered automatically if it doesn't trigger for 12 seconds while in combat.",
      "6★": "6★ Increase crit rate by 18% while wielding Gleipnir. The crit rate increase lasts another 5 seconds after switching to other weapons."
    },
    "matrice_src": "/matrices/fenrirmatrice.jpg",
    "matrice_2p": "Increase crit damage by 14%/15%/16%/18%. This effect does not stack. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "matrice_4p": "When dealing volt damage, increase final damage by 2.8% for 10 seconds, stacking up to 5/6/7/8 times. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "13.50",
    "charge": "10.50"
  },
  {
    "id": 25,
    "src": "/background/lanbackground.jpg",
    "alt": "Imagen 25",
    "title": "Lan",
    "weapon": "Lingguang",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. Flame Resonance and Flame Reaction does not stack; Flame Resonance takes priority.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ Vermilion Strength: When equipping Vermilion Bird, the ammo costs of other weapons are multiplied by Polyfeather Parasol, and their damage, charge, and shatter effects are also multiplied by Polyfeather Parasol. Glowing Fire: When burn tally is triggered or when taking damage from Fiery Crash, 30% of the damage is transferred to the 3 units near the target (including the target itself) with the highest HP percentage.",
      "3★": "3★ When using any discharge attack or shatter, all the active parasols trigger a Fiery Crash, dealing 30% of their usual damage 1 time. Reduce the ATK of enemies near the parasols by 15%. When in combat, spawn 3 parasols near the target immediately after dealing damage for the first time.",
      "5★": "5★ Fiery Crash and the transferred damage ignore 60% of the target's flame resistance. Flame damage dealt by Corrosion is increased by 10%.",
      "6★": "6★ Increase the damage dealt by Dancing Flames and Soaring Strike by 50%. The multiplier for spinning parasols, Phoenix Sweep, and Fiery Crash is now Polyfeather Parasol plus 2."
    },
    "matrice_src": "/matrices/lanmatrice.jpg",
    "matrice_2p": "When equipped with at least 1 flame weapon, increase flame ATK by 6%/7%/8%/9% and flame damage by 3.2%/3.8%/4.4%/5%. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "matrice_4p": "Gain different effects based on the number of different elemental weapons equipped: Increase flame/frost/physical/volt damage by 4%/5%/6%/7% for every flame/frost/physical/volt weapon equipped. Increase final damage by 5%/6%/7%/8% for every altered weapon equipped. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "12.00"
  },
  {
    "id": 26,
    "src": "",
    "alt": "",
    "title": "Scylla",
    "weapon": "",
    "weapon_effects": "",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
      "1★": "",
      "3★": "",
      "5★": "",
      "6★": ""
    },
    "matrice_src": "/matrices/scyllamatrice.jpg",
    "matrice_2p": "Equipping this matrix on the current weapon increases crit damage by 13%/16%/19%/23% and shatter by 13%/16%/19%/23%.",
    "matrice_4p": "Equipping 2 or more elemental weapons or multiple class weapons increases all elemental damage by 9.5%/11.5%/13.5%/15.5%. The effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "",
    "charge": ""
  },
  {
    "id": 27,
    "src": "",
    "alt": "",
    "title": "Haboela",
    "weapon": "",
    "weapon_effects": "",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
      "1★": "",
      "3★": "",
      "5★": "",
      "6★": ""
    },
    "matrice_src": "/matrices/habramatrice.jpg",
    "matrice_2p": "Equipping this matrix on the current weapon increases final damage by 8.5%/10.5%/12.5%/14.5%.",
    "matrice_4p": "Increase final damage by 9%/11%/13%/15%. The effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "",
    "charge": ""
  },
  {
    "id": 28,
    "src": "/background/icarusbackground.jpg",
    "alt": "Imagen 28",
    "title": "Icarus",
    "weapon": "Precious One",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "Increase final damage by 1.5% for every 1 type of weapon element equipped. This set effect also works with the weapons in the off-hand slot.",
    "advancements": {
      "1★": "1★ When any weapon skill is used, Speedy Yo-yo can trigger harmony, dealing damage to nearby targets equal to 25% of the Wanderer's lost HP. The damage dealt shall be no less than 120% of the Wanderer's Max ATK, and no more than 800% of the Wanderer's Max ATK. The type of elemental damage dealt will be that of the current weapon. When any weapon discharge is used, Speedy Yo-yo can trigger tuning, dealing damage to nearby targets equal to 4% of the Wanderer's Max HP. The damage dealt shall be no more than 400% of the Wanderer's Max ATK. The type of elemental damage dealt will be that of the current weapon.",
      "3★": "3★ When using Desolate Day, Speedy Yo-yo can trigger 9 seconds of swiftness: Speedy Yo-yo's speed is increased by 80%, damage is increased by 160%, and damage caused by passing through the target is converted to small-area damage.",
      "5★": "5★ Increase damage of Speedy Yo-yo and Return to Loneliness by 50%.",
      "6★": "6★ Increase final damage by 6% while Speedy Yo-yo is active."
    },
    "matrice_src": "/matrices/icarusmatrice.jpg",
    "matrice_2p": "Equipping Precious One, 2 or more weapons of different elements, or 2 or more types of weapons increases all elemental damage by 8%/9%/10%/11%. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "matrice_4p": "When dealing frost damage, increase all elemental damage by 13%/16%/19%/22% for 25 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "9.50",
    "charge": "8.00"
  },
  {
    "id": 29,
    "src": "/background/fionabackground.jpg",
    "alt": "Imagen 29",
    "title": "Fiona",
    "weapon": "Moonstar Bracelet",
    "weapon_effects": "When the weapon is fully charged, the next attack will mark the target, causing an explosion after 5 seconds. Additionally inflict 25% of all damage received by the target while the mark exists, up to a total of 560.00% of your ATK. Only 1 mark can be added on a target at a time.",
    "element_resonance": "Increase ATK by 20% and altered resistance by 30%. Activate by equipping 2 or more altered weapons. This set effect works in the off-hand slot. Cannot stack with other Altered Resonance or Altered Reaction effects, with Altered Resonance taking precedence.",
    "weapon_passive": "Increase final damage by 12%. Activate by equipping 2 weapons of the same element, not including physical. This set effect works in the off-hand slot.",
    "advancements": {
      "1★": "1★ Using any weapon or discharge skill grants 1 elemental crystal, up to 5 crystals. Elemental crystals are lost at a rate of 1 crystal every 6 seconds. Elemental crystals provide a final damage boost equal to 4% of [(crystal count plus 1)/2] and an increased healing effect equal to 6% of [(crystal count plus 1)/2].",
      "3★": "3★ While Benediction Resonance is not active, when the target's HP is below (crystal count plus 2)%, using Moonstar Bracelet can instantly execute the target (doesn't work against Wanderers). While Benediction Resonance is active, when the target's HP is below (crystal count times 2 plus 2)%, using Moonstar Bracelet can instantly execute the target (doesn't work against Wanderers)",
      "5★": "5★ Obtain 1 elemental crystal every time Scatter Technique is used. Elemental crystals are lost at a rate of 1 crystal every 20 seconds. When receiving fatal damage, consume 3 elemental crystals to prevent death 1 time and gain damage immunity for a short time. Can be activated 1 time every 25 seconds.",
      "6★": "6★ Increase final damage by 7% of [(crystal count plus 3)/2]."
    },
    "matrice_src": "/matrices/fionamatrice.jpg",
    "matrice_2p": "After dealing damage, increase ATK by 16%/18%/20%/22% for 30 seconds. This effect does not stack. Only the effect with the highest star rating is applied when obtained repeatedly.",
    "matrice_4p": "While Benediction Resonance is not active, after using Scatter Technique, increase final damage by 17%/19%/21%/23% for 20 seconds. While Benediction Resonance is active, after using Scatter Technique, increase final damage for self and teammates by 8.5%/9.5%/10.5%/11.5% for 20 seconds. Final damage is additionally increased based on attack by (Base ATK/10000)%, up to 5%. This matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "11.50",
    "charge": "11.50"
  },
  {
    "id": 30,
    "src": "/background/gnonobackground.jpg",
    "alt": "Imagen 30",
    "title": "Gnonno",
    "weapon": "Mini Hurricane",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with other Physical Resonance or Physical Reaction effects, with Physical Resonance taking precedence.",
    "weapon_passive": "Increase final damage by 12%. Activate by equipping 2 weapons of the same element, not including physical. This set effect works in the off-hand slot.",
    "advancements": {
      "1★": "1★ Increase the shatter of Frantic Digging, Boiling Octopus Balls, and Go on, Pip! by 80%. Gain a 50% increase to Shield when these skills are used when the Wanderer's Shield is below 50%. Lasts 8 seconds. This effect can only be triggered 1 time every 5 seconds (unavailable in Apex League).",
      "3★": "3★ Pip Octowhip limit is increased to 45. Increase physical damage by 12% for 30 seconds after using Pip Ultimate.",
      "5★": "5★ Detonating Treasure Tracers refreshes the grievous status of targets. Increase physical damage by 10% when damage is dealt to targets with less than 80% HP. This set effect works in the off-hand slot.",
      "6★": "6★ Increase damage dealt by detonating Treasure Tracers by 90% of ATK."
    },
    "matrice_src": "/matrices/gnonomatrice.jpg",
    "matrice_2p": "Increase all elemental damage by 8%/9%/10%/11% when at least 1 physical weapon is equipped. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "matrice_4p": "After using any physical weapon skill or discharge skill, increase all elemental damage by 13%/16%/19%/22% for 25 seconds. Endurance consumed when using Mini Hurricane is reduced by 40%. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "14.00"
  },
  {
    "id": 31,
    "src": "/background/rubiliabackground.jpg",
    "alt": "Imagen 31",
    "title": "Rubilia",
    "weapon": "Lost Ark",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase Volt ATK by 15% and Volt Resistance by 25%. Activate by equipping 2 or more Volt weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
      "1★": "1★ After triggering Feedback, every Crystamax thorn will deal damage to nearby targets equal to 66.7% of ATK every 2 seconds, lasting 30 seconds.",
      "3★": "3★ Using any weapon skill or the discharge skill of any other weapon will generate 1 Crystamax thorn.",
      "5★": "5★ ncreases Feedback's Max HP recovery of Crystamax thorns by 50%.",
      "6★": "6★ After successfully using Harrah's Embrace, increase volt damage by an additional 12% for 30 seconds."
    },
    "matrice_src": "/matrices/rubiliamatrice.jpg",
    "matrice_2p": "Increase volt ATK by 14.5%/16.5%/18.5%/20.5%. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "matrice_4p": "Increase Crystamax thorn limit to 6. Increase all elemental damage by 13%/16%/19%/22% when a volt weapon lands an attack, lasting for 30 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "10.00",
    "charge": "12.00",
    "awaken": "Increase volt damage by 8% for every 1 volt weapon equipped. The amount of time that Grayspace Entities are controlled by Seal is increased to 120 seconds.",
    "awaken_title": "Awaken: Enlightenment",
    "release_date": "JUNE 02, 2023",
    "attacks": [
      {
        "name": "Normal: Wingspan",
        "description": "While on the ground, use normal attack to launch 5 consecutive attacks.\nFirst Attack: Deal damage equal to 98.9% of ATK plus 5 and knock the target back.\nSecond Attack: Deal damage equal to 72.9% of ATK plus 4 and knock the target back.\nThird Attack: Deal damage equal to 138.1% of ATK plus 7 and suspend the target.\nFourth Attack: Deal damage equal to 316.5% of ATK plus 17 and knock the target back.\nFifth Attack: Deal damage equal to 199.1% of ATK plus 10 and knock the target down."
      },
      {
        "name": "Arial: Suppress",
        "description": "While airborne, use normal attack to launch 5 consecutive attacks in mid-air and consume endurance.\nFirst Attack: Deal damage equal to 113.7% of ATK plus 6.\nSecond Attack: Deal damage equal to 89.6% of ATK plus 5.\nThird Attack: Deal damage equal to 175.1% of ATK plus 9.\nFourth Attack: Deal damage equal to 343.3% of ATK plus 18.\nFifth Attack: Deal damage equal to 170.6% of ATK plus 9."
      },
      {
        "name": "Advance",
        "description": "While on the ground, tap and hold normal attack to trigger Advance, dealing damage equal to 211.7% of ATK plus 11."
      },
      {
        "name": "Descent",
        "description": "Tap and hold normal attack while airborne (tap when a target is available), or use normal attack while climbing, jumping backward, or using the Jetpack to trigger Descent. Dive through the air, consuming Endurance and dealing damage equal to 241.9% of ATK plus 13 to nearby targets upon reaching the ground."
      }
    ],
    "dodges": [
      {
        "name": "Dodge",
        "description": "Dodge right before getting hit to trigger Phantasia, reducing the speed of targets within the area. Become immune to hitstun for 0.5 seconds while dodging."
      },
      {
        "name": "Pillage",
        "description": "Move in a direction while tapping normal attack during the short period after dodging forward to trigger Pillage, dealing damage equal to 55.9% of ATK plus 3 to nearby targets and suspending them. Using Pillage can trigger Feedback."
      },
      {
        "name": "Swarm",
        "description": "Tap normal attack during the short period after dodging to trigger Swarm, summoning two Abyssant illusions which deal damage equal to 88.2% of ATK plus 5 to targets ahead of the Wanderer. Using Swarm can trigger Feedback."
      },
      {
        "name": "Weave",
        "description": "When on the ground, long pressing any dodge can trigger Weave, dashing for a distance through the air (does not work in areas the Jetpack can't be used)."
      },
      {
        "name": "Seal",
        "description": "Tap and hold normal attack during the short period after dodging to trigger Seal, launching a hive consciousness forward which controls Grayspace Entities that it hits, turning them into allies (does not work on bosses), lasting for 60 seconds. The control state is removed when Seal is used again on a target or its duration ends, dealing 45% of all damage dealt during the control period. The hive consciousness can be blocked by non-Grayspace Entity targets, which are not affected by this control effect."
      }
    ],
    "skills": [
      {
        "name": "Field",
        "description": "Dash rapidly between two points 10 times, drawing in nearby targets and dealing damage equal to 371.7% of ATK plus 20 to nearby targets. \nUpon landing, deal damage equal to 198.3% of ATK plus 10 to nearby targets. Cooldown: 20 seconds. \nEach dash absorbs 10% of the Max HP of all Crystamax thorns (unavailable in Apex League), and deals additional damage equal to the number of Crystamax thorns times 40% of ATK, or the number of Crystamax thorns times 1% of the Wanderer's Max HP, whichever is greater, until the crystal thorns are exhausted.The HP loss ratio of the Crystamax thorns' Max HP is the same as the HP loss ratio of the Wanderer."
      }
    ],
    "discharges": [
      {
        "name": "Harrah's Embrace",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the wielderand summon Harrah to cast 12 Tempest Rounds, each of which deals damage equal to 68.8% of ATK plus 4 to nearby targets, during which the Wanderer has damage immunity for 2.6 seconds (unavailable in Apex League). Increase volt damage by 7% for 30 seconds after successfully using Harrah's Embrace. In addition, generate 3 Crystamax thorns (up to 5 can exist at one time). \nCrystamax thorns start with 100% Max HP, are unable to be attacked, can only be healed by Feedback, and last for 150 seconds. Gain 2 Feedbacks after Harrah's Embrace lands an attack (can stack up to 4 times). Lost Art consumes 1 Feedback every dodge attack, dealing damage to the target equal to the number of Crystamax thorns times 72% of ATK, recovering 25% of Max HP to the Crystamax thorns, and resetting Crystamax thorn location and duration. Harrah's Embrace restores 1 dodge attempt upon landing an attack, and does not consume dodge attempts."
      }
    ]
  },
  {
    "id": 32,
    "src": "/background/lihuobackground.jpg",
    "alt": "Imagen 32",
    "title": "Lihuo",
    "weapon": "Pine Comet",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. Effect does not stack with Flame Resonance.",
    "weapon_passive": "When landing any hit with Pine Comet, it deals damage to nearby targets equal to 105% of flame ATK plus 1.5% of the Wanderer's Max HP plus 55% of the sum of all the Wanderer's resistance types plus 200% of crit. This effect can be triggered once every 1.5 seconds. The Fiery Explosion damage is counted as normal attack damage. If there is 1 volt/frost/physical weapon of any kind equipped, Fiery Explosion damage is multiplied by 1.3 times. In addition, Fiery Explosion damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
      "1★": "1★ When a sparrowfeather hits a target, a diffusion effect is created, dealing damage equal to 85% of ATK on the initial target, and spreads the Ignited Sparrow effect to nearby targets while refreshing the duration of Ignited Sparrow. Cooldown: 5 seconds.",
      "3★": "3★ When your HP is under 50%, consume 1 sparrowfeather every 0.5 seconds and recover 2% of max HP until max HP is reached or all sparrowfeathers are used. While not in a team, increase this effect to 4%. This effect also works in the off-hand slot.",
      "5★": "5★ When you receive fatal damage, negate fatal damage once and gain immunity for a short period of time, and immediately get 60 sparrowfeathers and 1000 weapon charge. This effect can be triggered once every 60 seconds, and also works in the background.",
      "6★": "6★ When you are in the ultimate state, increase flame damage by an additional 20%"
    },
    "matrice_src": "/matrices/lihuomatrice.jpg",
    "matrice_2p": "Increase final damage by 9%/10%/11%/12%. The number of Sparrow Feathers obtained from dodging after using Pine Comet increases to 20. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 flame weapon, increase all elemental damage by 11%/14%/17%/20%. After using In All Directions, increase all elemental damage boost by an additional 7% and gradually reduce to 4% over 25 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "15.00",
    "awaken": "Increase final damage by 18%. When Pine Comet is in the off-hand slot, Sparrow Feather launch frequency increases to 1 per second. When Sparrow Feather hits and triggers the spreading effect, it additionally spreads Ion Scorch and Cross Burn. In team play, your damage taken from the aggroed target is reduced by 5%. When Fortitude Resonance is activated, the damage reduction increases to 8%.",
    "awaken_title": "Awaken: Growing Up",
    "release_date": "JUNE 27, 2023",
    "attacks": [
      {
        "name": "Flying Words",
        "description": "While on the ground, use normal attack to launch 7 consecutive attacks.\nFirst Attack: Deal damage equal to 179.8% of ATK plus 9.\nSecond Attack: Deal damage equal to 151% of ATK plus 8.\nThird Attack: Deal damage equal to 182.3% of ATK plus 10.\nFourth Attack: Deal damage equal to 179.8% of ATK plus 9.\nFifth Attack: Deal damage equal to 204.5% of ATK plus 11.\nSixth Attack: Deal damage equal to 466.8% of ATK plus 25.\nSeventh Attack: Deal damage equal to 779.6% of ATK plus 41."
      },
      {
        "name": "Arial: Freewriting",
        "description": "While airborne, use normal attack to launch 7 consecutive attacks in mid-air, consuming endurance.\nFirst Attack: Deal damage equal to 171.3% of ATK plus 9.\nSecond Attack: Deal damage equal to 171.3% of ATK plus 9.\nThird Attack: Deal damage equal to 140% of ATK plus 7.\nFourth Attack: Deal damage equal to 171.3% of ATK plus 9.\nFifth Attack: Deal damage equal to 200.7% of ATK plus 11.\nSixth Attack: Deal damage equal to 466.8% of ATK plus 25.\nSeventh Attack: Deal damage equal to 779.6% of ATK plus 41."
      },
      {
        "name": "Freewriting",
        "description": "While on the ground, tap and hold normal attack when using the second to the fourth attack to trigger Freewriting. Perform a spinning attack, dealing damage equal to 793.6% of ATK plus 42 to nearby targets and knocking them back After triggering Freewriting tap normal attack to trigger Elegant Strokes.\nPerform an arcing displacement. dealing damage equal to 93.4% of ATK plus 5 to nearby targets and suspending them.\nAfter triggering Elegant Strokes, tap normal attack to trigger Falling Paper.\nAfter triggering Falling Paper, tap and hold normal attack to trigger Elegant Strokes."
      },
      {
        "name": "Falling Paper",
        "description": "While on the ground, tap normal attack after triggering Elegant Strokes, or tap and hold normal attack when using the fifth to the seventh normal attack to trigger Falling Paper. Kick the target into the air, dealing damage equal to 186.7% of ATK plus 10 to nearby targets and suspending them. Proceed to unleash a flaming bird to attack nearby targets, dealing damage up to 233.4% of ATK plus 12. Fall from above, dealing damage equal to 513.5% of ATK plus 27 to nearby targets and suspending them.\nAfter triggering Falling Paper, tap and hold normal attack to trigger Elegant Strokes."
      },
      {
        "name": "Fragmented Texts",
        "description": "Tap and hold normal attack while airborne (tap when a target is available), or use normal attack while climbing, jumping backward, or using the Jetpack to trigger Fragmented Texts. Fall from above, dealing damage equal to 256.8% of ATK plus 14 to surrounding targets upon reaching the ground and suspending them."
      },
      {
        "name": "Finishing Touch",
        "description": "While airborne, tap and hold normal attack when using the second to sixth normal attacks to trigger Finishing Touch. Erupt flames, dealing damage equal to 490.2% of ATK plus 26 to targets ahead."
      },
      {
        "name": "Small Seal",
        "description": "When dealing damage to the locked-on target using normal attacks, there is a 50% chance to gather Small Seal.\nFlame: Gather flame power, dealing damage equal to 120% of ATK plus 6 to the target. Can be triggered 1 time every 12 seconds.\nBurst: Ignite flames, dealing damage equal to 30% of ATK plus 2 to nearby targets. Can be triggered 1 time every 7 seconds.\nAttract: Draw in nearby targets with intense flames, dealing damage equal to 120% of ATK plus 6 to the target. Can be triggered 1 time every 15 seconds."
      },
      {
        "name": "Sparrow Feather",
        "description": "When the wielder has a Sparrow Feather:\nAny attack using Pine Comet will launch a Sparrow Feather toward the locked-on target, dealing damage equal to 40.8% of ATK to nearby targets. Can be triggered 1 time every 1 second.\nWhen Pine Comet is in the off-hand slot, attacking with any other weapons can also launch 1 Sparrow Feather to the locked-on target, which can be triggered 1 time every 2 seconds.\nThe initial number of Sparrow Feathers is 30, and a maximum of 60 can be stored at a time."
      }
    ],
    "dodges": [
      {
        "name": "Dodge",
        "description": "Dodge right before getting hit to trigger Phantasia, reducing the speed of targets within the area. Become immune to hitstun while dodging.\nPassive: Gain 15 Sparrow Feathers."
      },
      {
        "name": "Inkstone Droplet",
        "description": "Use normal attack during the short period after dodging to trigger Inkstone Droplet.\nSplash ink, dealing damage equal to 392.1% of ATK plus 21 to nearby targets.\nPassive: Inflict a 65% delay for 2 seconds on nearby targets (ineffective against bosses in team play), and form a line of flame to inflict a 50% slow effect on nearby targets, dealing damage equal to 36% of ATK plus 2 per second (this effect cannot be stacked when multiple flame lines/rings overlap). Lasts for 7 seconds."
      },
      {
        "name": "Writing Artisan",
        "description": "When Inkstone Droplet is triggered, tap and hold normal attack to trigger Writing Artisan.\nSplash ink, dealing damage equal to 835.4% of ATK plus 44 to nearby targets.\nPassive: Inflict a 65% delay for 2 seconds on nearby targets (ineffective against bosses in team play), and form a ring of flame to inflict a 50% slow effect on nearby targets, dealing damage equal to 36% of ATK plus 2 per second (this effect cannot be stacked when multiple flame lines/rings overlap). Lasts for 7 seconds."
      }
    ],
    "skills": [
      {
        "name": "In All Directions",
        "description": "Transform into multiple ink doppelgangers and become invincible for a short duration, dealing damage equal to 254.18% of ATK plus 13 to nearby targets. The ink then converges, drawing in nearby targets and releasing an ink attack, dealing damage equal to 619.8% of ATK plus 33. Cooldown: 25 seconds.\nIn All Directions gathers Calligraphy Characters on the field and uses the flaming bird transformation, dealing damage equal to (the number of summons plus Calligraphy Characters on the field, up to 8) times 191.4% of ATK to nearby targets. Enter the Pinnacle state, ignoring 15% of the target's flame resistance for 30 seconds. The Pinnacle state provides different effects based on the type and quantity of the Calligraphy Characters gathered:\nGather 1 Discharge character “携” for a 8% discharge damage increase. Gather 2 Discharge characters “携” for a 20% shatter increase.\nGather 1 Skill character “技” for a 8% skill damage increase. Gather 2 Skill characters “技” to reduce the cooldown of In All Directions by 5 seconds.\nGather 1 Dodge character “闪” for a 10% dodge attack damage increase. Gather 2 Dodge characters “闪” to gain 3 dodge attempts.\nGather 1 Attack character “攻” for a 10% normal attack damage increase. Gather 2 Attack characters “攻” to gain a 5% damage reduction during normal attacks.\nEvery 1 Calligraphy Character gathered grants hyperbody for 2 seconds, up to a maximum of 16 seconds.\nPassive: Calligraphy Characters\nUsing any weapon discharge/skill/dodge/normal attack will drop corresponding Calligraphy Characters.\nDischarge: Drop 1 Discharge character “携” whenever using 1 discharge skill, up to a maximum of 2 Discharge characters “携” can exist on the field at a time.\nSkill: Drop 1 Skill character “技” whenever using 1 skill, up to a maximum of 2 Skill characters “技” can exist on the field at a time.\nDodge: Drop 1 Dodge character “闪” whenever dodging for 2 times, up to a maximum of 2 Dodge characters “闪” can exist on the field at a time.\nAttack: Drop 1 Attack character “攻” whenever using 4 normal attacks, up to a maximum of 2 Attack characters “攻” can exist on the field at a time."
      }
    ],
    "discharges": [
      {
        "name": "A Spark of Genius",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer and perform a forward sweep, dealing damage up to 1,021.4% of ATK plus 54 to nearby targets and knocking them back. During the period, damage immunity lasts for 1.5 seconds (unavailable in Apex League)\nPassive: Sparroburn\nWhen using any flame weapon's discharge skill, apply 1 stack of Sparroburn to the locked-on target, dealing damage equal to 30% of ATK per second for 15 seconds, stacking up to 2 times"
      }
    ]
  },
  {
    "id": 33,
    "src": "/background/yulanbackground.jpg",
    "alt": "Imagen 33",
    "title": "Yulan",
    "weapon": "Unity",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "When Unity is equipped, upon landing a hit with any weapon's discharge skill, deal initial damage to nearby targets equal to 30% of frost ATK plus 0.4% of the Wanderer's Max HP plus 15% of the sum of all the Wanderer's resistance types plus 55% of crit. While in combat state, after every 0.5 seconds, the next Swift Cut damage will be increased by an additional 1 time, up to a maximum of 30 times. When multiple Swift Cut damages exist, the highest initial value is used for calculation. Swift Cut damage is counted as discharge skill damage. If there is 1 volt/ physical/flame weapon of any kind equipped, Icecrush damage is increased 1.3 times. In addition, Icecrush damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
      "1★": "1★ While in the Martial Artist form, after consuming 3 or more Internal Strength, Unity restores 1 Internal Strength. Subsequently, the Wanderer's final damage is increased by 5%, and Unity's dodge attack/normal attack damage is increased by 50% for 30 seconds. While in the Sweeping Force form, after consuming 3 or more Fighting Spirit, Unity restores 1 Fighting Spirit. Subsequently, the Wanderer's final damage is increased by 5% for 15 seconds.",
      "3★": "3★ In the Martial Artist form, if Internal Strength is not obtained within 5 seconds, the next acquisition of Internal Strength will grant 2 counts. In any form, when Unity consumes 3 or more Internal Strength or Fighting Spirit, restore 10% of the Wanderer's Max HP. In solo play, the HP recovery is increased to 20%. This effect can only trigger 1 time every 8 seconds in Sweeping Force form. In Martial Artist form, there are no limitations.",
      "5★": "5★ After Unity consumes Internal Strength or Fighting Spirit, when receiving lethal damage, prevent lethal damage 1 time and recover 20% of the Wanderer's Max HP (Unavailable in Apex League). In solo play, the HP recovery is increased to 40%. Both effects can only trigger 1 time every 60 seconds.",
      "6★": "6★ While in the Martial Artist form, Unity's dodge attack/normal attack damage is further increased by 70%. After consuming Internal Strength, the Wanderer's final damage is increased by 10% for 30 seconds. While in the Sweeping Force form, after Unity consumes Fighting Spirit, the Wanderer's final damage is increased by 15% for 30 seconds."
    },
    "matrice_src": "/matrices/yulanmatrice.jpg",
    "matrice_2p": "When equipped with at least 1 frost weapon, while in the combat state, deal damage equal to 85% of ATK to nearby targets every second. After using any frost weapon skill or discharge skill, increase final damage by 7%/8%/9%/10% for 30 seconds. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "matrice_4p": "After Unity consumes Internal Strength or Fighting Spirit, increase final damage by 6% for 15 seconds. After dealing frost damage, increase all elemental damage by 12%/15%/19%/23% for 30 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "13.00",
    "charge": "11.00",
    "awaken": "Increase final damage by 18%. \nWhile in the Martial Artist form, additionally increase final damage by 7%. While in the Sweeping Force form, for every 1 frost weapon equipped, increase damage dealt via consuming Fighting Spirit by 9%. When 3 frost weapons are equipped, increase frost damage by 8%.",
    "awaken_title": "Awaken: Attention",
    "release_date": "JULY 18, 2023",
    "attacks": [
      {
        "name": "Normal: Battering Fist",
        "description": "While on the ground, use normal attack to launch 6 consecutive attacks. If the fifth attack of the Fighter delivers the final blow while the Yuanwu Totem is active, fixed targets receive 1 Snakebite.\nFirst Attack: Deal damage equal to 64.8% of ATK + 3 and knock the target back.\n**Second Attack:**Deal damage equal to 50.4% of ATK + 3 and knock the target back.\nThird Attack: Deal damage equal to 52.8% of ATK + 3 and knock the target back.\nFourth Attack: Deal damage equal to 143.9% of ATK + 8 and knock the target back.\nFifth Attack: Deal damage equal to 279.2% of ATK + 15 and continuously knock the target back.\nSixth Attack: Deal damage equal to 227.4% of ATK + 12 and knock the target into the air.\nBattering Fist can be used in either the Martial Artist or Sweeping Force form. After using any dodge attack while in the Martial Artist form, use normal attack to quickly trigger the Fourth Attack. After the Fifth Attack lands a hit while in the Martial Artist form, strongly freeze the target for 2 seconds (unavailable in Apex League and against bosses) and additionally inflict Chilblain, dealing damage equal to 280% of ATK plus 15 every second for 8 seconds. This effect can only be triggered on the same target 1 time every 8 seconds."
      },
      {
        "name": "Arial: Floating Fist",
        "description": "While airborne, use a regular attack to perform 5 consecutive attacks in the air, consuming stamina.\nFirst Attack: Deal damage equal to 68.4% of ATK + 4.\nSecond Attack: Deal damage equal to 59.9% of ATK + 3.\nThird Attack: Deal damage equal to 62.7% of ATK + 3.\nFourth Attack: Deal damage equal to 136.4% of ATK + 7.\nFifth Attack: Deal damage equal to 249% of ATK + 13.\nSixth Attack: Deal damage equal to 222.3% of ATK + 12."
      },
      {
        "name": "Forest-Piercing Swallow",
        "description": "While on the ground, tap and hold normal attack when using the first to third normal attacks to trigger Forest-Piercing Swallow.Deal damage equal to 62.8% of ATK plus 3 and draw in nearby targets. Then, deal damage equal to 146.6%` of ATK plus 8 to nearby targets and knock them back. Forest-Piercing Swallow can only be used while in the Martial Artist form. After using Cloud-Soaring Kite, using normal attack can also trigger Forest-Piercing Swallow."
      },
      {
        "name": "Sky-Dancing Snake",
        "description": "While on the ground, tap and hold normal attack when using the fourth to fifth normal attacks to trigger Sky-Dancing Snake. Deal damage equal to 75.4% of ATK plus 4 to nearby targets and suspend them. Sky-Dancing Snake can only be used while in the Martial Artist form. After using Forest-Piercing Swallow, tapping and holding normal attack can also trigger Sky-Dancing Snake."
      },
      {
        "name": "Cloud-Soaring Kite",
        "description": "While airborne, tap and hold normal attack when using the first to sixth normal attacks to trigger Frost High & Low. Toss your weapon in the air, dealing damage equal to 329% of ATK plus 17 to nearby targets. Frost High & Low can be used in either the Martial Artist or Sweeping Force form."
      },
      {
        "name": "Frost High & Low",
        "description": "Tap and hold normal attack while airborne (tap when a target is available), or use normal attack while climbing, jumping backward, or using the Jetpack to trigger Cloud-Soaring Kite. Fall from above, dealing damage equal to 148.6% of ATK plus 8 to nearby targets upon reaching the ground and knock them down. Cloud-Soaring Kite can be used in either the Martial Artist or Sweeping Force form."
      },
      {
        "name": "Total Rewind",
        "description": "When on the ground, tap and hold normal attack to trigger Total Rewind. Continuously draw in nearby targets while consuming endurance, during which the Wanderer gains hyperbody. Total Rewind can be used in either the Martial Artist or Sweeping Force form."
      }
    ],
    "dodges": [
      {
        "name": "Dodge",
        "description": "Dodge right before getting hit to trigger Phantasia, reducing the speed of targets within the area. Become immune to hitstun while dodging.\nPassive: Launch a lightning ball ahead."
      },
      {
        "name": "Impossible Feat",
        "description": "Use normal attack during the short period after dodging to trigger Impossible Feat dealing damage equal to 177.6% of ATK plus 9 to nearby targets. Impossible Feat can be used in either the Martial Artist or Sweeping Force form."
      },
      {
        "name": "Sweeping Clouds",
        "description": "Use normal attack during the short perfect dodge window (tap an arrow button before dodging) to trigger Sweeping Clouds, dealing damage equal to 167.6% of ATK plus 9 to nearby targets. Sweeping Clouds can be used in either the Martial Artist or Sweeping Force form."
      }
    ],
    "skills": [
      {
        "name": "Offense & Defense",
        "description": "Unity has 2 forms: Martial Artist and Sweeping Force. Activate up to 1 of them via the Skills Settings page. They cannot be switched while in the combat state. Martial Artist form: While in the combat state, Unity's dodge attack/normal attack multiplier is additionally increased by 40%. After using any weapon's dodge attack or normal attack 3 times, receive 1 Internal Strength (up to 10). Only 1 Internal Strength can be obtained every 2 seconds. While not in the combat state, all Internal Strength will be cleared. Sweeping Force form: After Observe & React lands a hit, enter the Anticipate state and receive 1 Fighting Spirit every 0.8 seconds (up to 15) for 60 seconds. While not in the combat state, all Fighting Spirit will be cleared.\nPassive: Chill When Unity is equipped, ignore 15% of targets' Frost Resistance. This effect also works in the off-hand slot."
      },
      {
        "name": "Fire in the Hole",
        "description": "Deal damage equal to 982.8% of ATK plus 52 to the target. Cooldown: 15 seconds. When using Fire in the Hole, Unity will consume up to 5 Internal Strength. When it consumes 1/2/3/4/5 Internal Strength, Fire in the Hole will deal 1.1/1.4/1.8/2.3/3 times of its original damage respectively. After using Fire in the Hole, increase frost damage by 12% for 30 seconds.\nAfter using Fire in the Hole, restore 2 dodge attempts. Fire in the Hole can only be used while in the Martial Artist form. When Internal Strength reaches 5, reset Fire in the Hole's cooldown."
      },
      {
        "name": "Clashing of Arms",
        "description": "Deal damage equal to 982.8% of ATK plus 52 to the target. Cooldown: 15 seconds. While in the Anticipate state, when using any weapon skill, Unity will consume up to 5 Fighting Spirit. When it consumes 1/2/3/4/5 Fighting Spirit, deal additional damage to nearby targets equal to 169%/368%/619%/938%/1,350% of ATK, and deal damage equal to 260% of ATK plus 14 every second for 5 seconds. After using any frost weapon skill, gain 2 seconds of hyperbody. Clashing of Arms can only be used while in the Sweeping Force form."
      }
    ],
    "discharges": [
      {
        "name": "Snow-Treading Tiger",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer, dealing damage up to 1,173.1% of ATK plus 62 to nearby targets and strongly launching them. During this period, gain damage immunity for 1.5 seconds (unavailable in Apex League). Snow-Treading Tiger can only be used while in the Martial Artist form."
      },
      {
        "name": "Observe & React",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer, dealing damage up to 1,173.1% of ATK plus 62 to nearby targets and strongly launching them. During this period, gain damage immunity for 1.5 seconds (unavailable in Apex League).After Observe & React lands a hit, increase frost damage by 12% for 30 seconds. After Observe & React lands a hit, enter the Anticipate state for 60 seconds. After using Unity to use a discharge skill, receive 1,000 weapon charge. This effect can only be triggered 1 time every 10 seconds. Observe & React can only be used while in the Sweeping Force form."
      }
    ]
  },
  {
    "id": 34,
    "src": "/background/zekebackground.jpg",
    "alt": "Imagen 34",
    "title": "Zeke",
    "weapon": "Onyx Tortoise",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage. Onyx Tortoise is a physical weapon and will always deal physical damage, but it can also take the place of a flame weapon to activate Flame Resonance.",
    "element_resonance": "Increase Physical ATK by 15% and Physical Resistance by 25%. Activate by equipping 2 or more Physical weapons. This set effect works in the off-hand slot. Cannot stack with other Physical Resonance effects, with Physical Resonance taking precedence. Increase Flame ATK by 15% and Physical Resistance by 25%. Activate by equipping 2 or more Flame weapons. This set effect works in the off-hand slot. Cannot stack with other Flame Resonance effects, with Flame Resonance taking precedence.",
    "weapon_passive": "After using Absolute Ravine, every second, deal damage equal to 70% of physical ATK plus 1% of the Wanderer's Max HP plus 36% of the sum of all the Wanderer's resistance types plus 135% of crit for 30 seconds to targets hit. Multiple Detachment damage will not stack and shield break damage will be counted as skill damage. If there is 1 volt/flame/frost weapon equipped, shield break damage is multiplied by 1.3. In addition, shield break damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
      "1★": "1★ Every time grievous is applied, deal devouring damage equal to 50% of ATK to the target. This effect can only be triggered 1 time every 0.5 seconds. Every time the weapon's ignite trait is applied to a non-grievous target, the target becomes grievous for 7 seconds.",
      "3★": "3★ After triggering Mighty Wind, turn targets hit into members of the Serpent Chain.",
      "5★": "5★ After using Absolute Ravine, reduce the Wanderer's damage taken by 10% (20% in solo play) for 30 seconds.",
      "6★": "6★ When there is 1 Serpent Chain member, increase conduction damage's conduction rate by 50%."
    },
    "matrice_src": "/matrices/zekematrice.jpg",
    "matrice_2p": "Increase Serpent Chain member limit to 5. When at least 1 physical or flame weapon is equipped, increase physical ATK and flame ATK by 14%/16%/18%/20%. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "matrice_4p": "After applying the snake bite effect, increase physical ATK and flame ATK by 9% for 30 seconds. While in the combat state, increase final damage by 14%/17%/20%/23%. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "12.00",
    "awaken": "Increase Final damage by 18%. The Wanderer's base physical ATK is increased to the highest value out of their physical/flame/frost/volt base ATK. When the main slot weapon is Onyx Tortoise, normal attack damage is increased by 50%.",
    "awaken_title": "Awaken: Selfless",
    "release_date": "AUGUST 08, 2023",
    "src_video": "https://www.youtube.com/embed/W533BQNlUb4?si=81jWnWZlj5EhlS8f",
    "attacks": [
      {
        "name": "Resistor",
        "description": "While on the ground, use a normal attack to perform 5 consecutive attacks.\nWhile the Xuanwu Totem is active, after Resistor's Fifth attack lands its final hit, add 1 snake bite to the locked-on target.\nFirst Attack: Deal damage equal to 131.6% of ATK and knocks back the target.\nSecond Attack: Deal damage equal to 186.8% of ATK and knocks back the target.\nThird Attack: Deal damage equal to 201.6% of ATK and knocks back the target.\nFourth Attack: Deal damage equal to 238% of ATK and suspends the target.\nFifth Attack: Deal damage equal to 338% of ATK and launches the target into the air."
      },
      {
        "name": "Flying Stone",
        "description": "While airborne, use a regular attack to perform 5 consecutive attacks in the air, consuming stamina.\nFirst Attack: Deals damage equal to 112.8% of ATK.\nSecond Attack: Deals damage equal to 168% of ATK.\nThird Attack: Deals damage equal to 164.2% of ATK.\nFourth Attack: Deals damage equal to 140.2% of ATK.\nFifth Attack: Deals damage equal to 228% of ATK."
      },
      {
        "name": "Othershore Soul",
        "description": "While on the ground, press and hold the regular attack button from the first to the fourth attack to trigger Othershore Soul. Throw your weapon forward, dealing damage equal to 212.4% of ATK to the nearest targets."
      },
      {
        "name": "Collapsing Mountain",
        "description": "While on the ground, press and hold the regular attack button to trigger Collapsing Mountain. Continuously move forward, attacking and consuming stamina, and deal damage equal to 240% of ATK to the nearest targets."
      },
      {
        "name": "In Continuity",
        "description": "Press and hold the regular attack button while airborne (press when the target is available) or use the regular attack while descending, jumping backward, or using a jetpack to trigger In Continuity. Dive to the ground and deal damage equal to 204% of ATK to the nearest targets."
      }
    ],
    "dodges": [
      {
        "name": "Dodge",
        "description": "Dodge right before getting hit to trigger Phantasia, reducing the speed of targets within the area. Become immune to hitstun while dodging.\nPassive: Launch a lightning ball ahead."
      },
      {
        "name": "Cutting Sand",
        "description": "Use normal attack during the short period after dodging to trigger Cutting Sand, unleashing a sword aura, dealing damage equal to 125% of ATK plus 7 to targets ahead. While the Xuanwu Totem is active, after Cutting Sand lands a hit, add 1 snake bite to the locked-on target."
      },
      {
        "name": "Open Clouds",
        "description": "Use normal attack during the short perfect dodge window (tap an arrow button before dodging) to trigger Open Clouds, dealing damage equal to 60% of ATK plus 3 to nearby targets. While the Xuanwu Totem is active, after Open Clouds lands a hit, add 1 snake bite to the locked-on target."
      },
      {
        "description": "Tap and hold normal attack right after dodging to trigger Lookout (unavailable in Apex League). After the Xuanwu Totem summoned by Absolute Ravine is completed, use Lookout to enter Selfless Realm for 25 seconds and gain 3 Dark Slashes.\nAfter the first successful normal or dodge attack from Onyx Tortoise lands a hit, trigger Dark Slash. If the target is an ordinary or elite enemy and their current HP doesn't exceed the Wanderer's Max ATK by more than 20,000 times, the target will be immediately executed. Otherwise, deal damage equal to 1,500% of ATK.\nSelfless Realm ends when its duration is over, the Dark Slash count is exhausted, or upon switching weapons. Selfless Realm can only be triggered 1 time every 200 seconds."
      }
    ],
    "skills": [
      {
        "name": "Absolute Ravine",
        "description": "Split a crack in the ground ahead, and gain temporary invincibility (unavailable in Apex League), and draw in nearby targets, dealing damage equal to 806% of ATK plus 42. Cooldown: 20 seconds. Increase the Wanderer's physical and flame damage by 26% for 30 seconds, and then summon the Xuanwu Totem. The Xuanwu Totem is removed while in the non-combat state.\n The Xuanwu Totem summons dark souls from the four formation cores every 0.6 seconds, each time dealing damage equal to 30% of ATK to targets along the way. When Absolute Ravine is in cooldown, gain the new skill Mirror Reflection: Strike back the nearby dark souls and activate their corresponding formation cores. After any formation core is activated, the Xuanwu Totem will be complete, and the Selfless Realm can be entered.\n While the Xuanwu Totem is active, use Onyx Tortoise to gain hyperbody, and snake bites can be applied in the following ways: \n After Absolute Ravine lands a hit, apply 1 snake bite to the target with the highest HP.\n After Resistor's fifth attack lands its final hit, apply 1 snake bite to the locked-on target.\n After Open Clouds lands a hit, apply 1 snake bite to the locked-on target.\n After Cutting Sand lands a hit, add 1 snake bite to the locked-on target.\n Snake bite deals devouring damage equal to 150% of ATK to the target, restores 12% of the Wanderer's Max HP, and makes the target a Serpent Chain member.\n Serpent Chain can transfer 30% of the actual damage dealt by the Wanderer's main slot weapon to the locked-on Serpent Chain member and cause grievous to be conducted to all Serpent Chain members (including the locked-on target themselves). There can be up to 4 Serpent Chain members. Conduction damage's element type follows the original damage and cannot be conducted again. The total conduction damage within 30 seconds should not exceed 2,400 times of the Wanderer's maximum ATK (unlimited in team play). Dark Slash damage cannot be conducted.\n After using Absolute Ravine, the Wanderer can also trigger Mighty Wind: Serpent Chain members deal devouring damage equal to the number of times devouring damage has been dealt multiplied by 25% of ATK to nearby targets (including the locked-on target themselves), then reset the devouring damage count."
      }
    ],
    "discharges": [
      {
        "name": "Way Home",
        "description": "Switch to this weapon when fully charged or when Phantasia is activated. When the weapon is fully charged or when Phantasia is activated, switching to this weapon removes all debuffs from the Wanderer and summons Yuanwu, dealing area damage equal to 681.2% of ATK to all nearby targets. During this time, you gain 1.5 seconds of damage immunity (unavailable in the Apex League)."
      }
    ]
  },
  {
    "id": 35,
    "src": "/background/mimibackground.jpg",
    "alt": "Imagen 35",
    "title": "Mimi",
    "weapon": "Meng Zhang",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase Volt ATK by 15% and Volt Resistance by 25%. Activate by equipping 2 or more Volt weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "When landing any hit with Azure Dragon, it deals damage to nearby targets equal to 131.3% of volt ATK plus 1.9% of the Wanderer's Max HP plus 68.8% of the sum of all the Wanderer's resistance types plus 250% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Thunder boom damage is counted as normal attack damage. If there is 1 flame/frost/physical weapon of any kind equipped, Thunder boom damage is multiplied by 1.3 times. Additionally, Thunder boom damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
      "1★": "1★ Each time after Thunder Burst charges, 2 Azuras will appear. Each Azura will restore 20% Max HP to other summons. Increase Thunder Burst's charged attack and shockwave damage by 30%.\nAfter using Azure Moon, immediately gain 3 stacks of Qinglong's Might. Using other volt weapons' skills will grant 1 stack of Qinglong's Might instead.",
      "3★": "3★ When Azure Dragon is equipped, reduce all volt weapon base skill cooldowns by 20%. This is not affected by other cooldown clearing, resetting, or changing effects.\nAdditionally, increase the Wanderer's volt damage by 15%. This effect works in the off-hand slot.",
      "5★": "5★ When the Wanderer receives lethal damage, prevent lethal damage 1 time and gain damage immunity for a short duration. This effect can only trigger 1 time every 60 seconds and works in the off-hand slot.\nAfter activating Fortitude Resonance: Using Soaring Dragon draws in nearby targets, ignoring hyperbody (ineffective against bosses). In team play, Thunder Burst will produce 1 volt timestamp every 6 seconds while charging, which will link up in the order they are produced to form a power grid. The power grid can block enemies' movements and their projectile damage. Each volt timestamp lasts for up to 20 seconds.",
      "6★": "6★ After using Azure Moon, increase the Wanderer's volt damage by 10% and final damage by 10% for 30 seconds."
    },
    "matrice_src": "/matrices/mimimatrice.jpg",
    "matrice_2p": "Increase final damage by 7%/8%/9%/10%. After Azura's shockwave lands a hit, increase skill damage by 15% for 30 seconds. This set effect works in the off- hand slot, and only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 volt weapon, increase all elemental damage by 14%/17%/20%/23%. After using Azure Moon / Soaring Dragon, increase crit damage by 6% for 30 seconds. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "15.00",
    "awaken": "Increase final damage by 18%. When equipped with 3 volt weapons, increase volt damage by 6%. Crit rate boost duration is additionally extended by 25 seconds",
    "awaken_title": "Awaken: Jade Luster",
    "release_date": "SEPTEMBER 05, 2023",
    "attacks": [
      {
        "name": "Pearls and Jade",
        "description": "While on the ground, use normal attack to launch 5 consecutive attacks. \nFirst Attack: Deal damage equal to 91.1% of ATK + 5. \nSecond Attack: Deal damage equal to 137.6% of ATK + 7. \nThird Attack: Deal damage equal to 400% of ATK + 21. \nFourth Attack: Deal damage equal to 331.7% of ATK + 17. \nFifth Attack: Deal damage equal to 165.3% of ATK + 9."
      },
      {
        "name": "Seeing Sights",
        "description": "While airborne, use normal attack to launch 5 consecutive attacks in mid-air, consuming endurance.\nFirst Attack: Deal damage equal to 92.6% of ATK + 5.\nSecond Attack: Deal damage equal to 150.5% of ATK + 8.\nThird Attack: Deal damage equal to 413.3% of ATK + 22.\nFourth Attack: Deal damage equal to 284.6% of ATK + 15.\nFifth Attack: Deal damage equal to 184.6% of ATK + 10."
      },
      {
        "name": "Azure Dragon Pierces the Sun",
        "description": "While on the ground, tap and hold normal attack when using the first to fourth normal attacks to trigger Azure Dragon Pierces the Sun and consume endurance.\nLaunch an attack ahead, dealing damage equal to 329.7% of ATK plus 1,874 to nearby targets and suspending them.\nAfter triggering Azure Dragon Pierces the Sun, tap and hold normal attack to trigger Thunder Burst."
      },
      {
        "name": "Azure Dragon Pierces the Sun",
        "description": "While on the ground, tap and hold normal attack to trigger Thunder Burst. Continuously fire lightning at the targets ahead, consuming endurance, during which the Wanderer gains hyperbody. Every attack that lands deals damage equal to 53.5% of ATK plus 304 to nearby targets. At the same time, summon 1 Azura every 1.5 seconds that fire shockwaves, dealing damage equal to 99% of ATK plus 563 to nearby targets.\nThe Wanderer gains a 10% HP shield every 1.5 seconds, up to 15%, for 15 seconds.\nAfter activating Fortitude Resonance: Whenever Thunder Burst or shockwave lands a hit, nearby targets are taunted for 2 seconds. Every time Thunder Burst produces a shield, nearby teammates will additionally receive a shield up to 10% of the Wanderer's Max HP."
      },
      {
        "name": "Roving Dragon",
        "description": "While airborne, tap and hold normal attack when executing the first to fourth normal attacks to trigger Dragon Tour, consuming endurance.\nLaunch an attack forward, dealing damage equal to 666% of ATK +35 to nearby targets, suspending them."
      },
      {
        "name": "Qinglong's Might",
        "description": "Every 3 normal attacks landed while using Azure Dragon grants 1 stack of Qinglong's Might, stacking up to 8 times, for 30 seconds.\nAfter activating Fortitude Resonance: Each stack of Qinglong's Might reduces the Wanderer's damage taken by 1.5%."
      },
      {
        "name": "Lotus Aspara",
        "description": "When on the ground or while airborne, tap and hold normal attack to trigger Lotus Aspara. Soar ahead continuously in the air while consuming endurance. Use the directional controls to adjust the direction during Lotus Aspara."
      }
    ],
    "dodges": [
      {
        "name": "Dodge",
        "description": "Dodge right before getting hit to trigger Phantasia, reducing the speed of targets within the area. Become immune to hitstun while dodging.\nPassive: Launch a lightning ball ahead."
      },
      {
        "name": "Lightning Flash",
        "description": "Use normal attack during the short period after dodging to trigger Lightning Flash.\nInstantly appear at lightning ball's location, dealing damage equal to 106.4% of ATK plus 605 to nearby targets and produce a lightning pool, then return to the Wanderer's original location. The lightning pool will deal a total DoT equal to 149.5% of ATK plus 850 and continuously draw in nearby targets.\nPassive: During Lightning Flash, the Wanderer receives hyperbody. After Lightning Flash lands a hit, receive 1 stack of Qinglong's Might.\nAfter triggering Lightning Flash, tap and hold normal attack to trigger Thunder Burst."
      }
    ],
    "skills": [
      {
        "name": "Azure Moon",
        "description": "An azure dragon soars through the sky. During this time, grant hyperbody to the Wanderer and deal damage equal to 1,777.5% of ATK plus 10,102 to nearby targets. The azure dragon will circle for 8 seconds. During this time, continuously consume Qinglong's Might and summon up to 8 lightning strikes. Every lightning strike deals damage equal to 649.9% of ATK plus 3,693 to nearby targets, and when the azure dragon disappears, deal damage again equal to 1,485% of ATK plus 8,439 to nearby targets. Cooldown: 30 seconds and this cooldown cannot be lowered below 20 seconds. Azure Moon can accumulate up to 2 stacks of skill uses.\nPassive: When 3 volt weapons are equipped, after Azure Moon lands a hit, deal skill damage equal to 250% of ATK to the target every 2 seconds for 30 seconds."
      },
      {
        "name": "Soaring Dragon",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer and gather chi. Then smash the ground, causing an explosion, dealing damage equal to 1,514.7% of ATK plus 8,608 to nearby targets and suspending them. During the period, gain damage immunity for 1.5 seconds (unavailable in Apex League).\nPassive: When Phantasia is triggered, if Azure Dragon is currently equipped or if switching to Azure Dragon from another weapon, deal damage equal to 5,000% of ATK to nearby targets. This damage is not affected by any damage boost effects except from titan equipment's rare stats. This can only be triggered up to 1 time per Phantasia trigger."
      }
    ],
    "discharges": [
      {
        "name": "Unparalleled Jade Poo",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer, dealing damage equal to 1,090% of ATK. During this period, gain damage immunity For 1.5 seconds [unavailable in Apex League]."
      }
    ]
  },
  {
    "id": 36,
    "src": "/background/feisebackground.jpg",
    "alt": "Imagen 36",
    "title": "Feise",
    "weapon": "Endless Bloom",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. Effect does not stack with Flame Resonance.",
    "weapon_passive": "When Endless Bloom is equipped, upon landing a hit with any weapon's discharge skill, deal initial damage equal to 37.5% of flame ATK plus 0.5% of the Wanderer's Max HP plus 18.75% of the sum of all the Wanderer's resistance types plus 68.75% of crit to nearby targets. While in combat, after every 0.5 seconds, the next Swift Cut damage will be increased by an additional 1 time, up to a maximum of 30 times. When multiple Swift Cut damages exist, the highest initial value is used for calculation. FieryExplosion: Swift Cut damage is counted as discharge skill damage. If there is 1 frost/volt/ physical weapon of any kind equipped, Fiery Explosion damage is increased to 1.3 times. In addition, Fiery Explosion damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
      "1★": "1★ Blazing Heart's damage's base multiplier is increased to 60% of ATK. While in the combat state, if the Wanderer inflicts multiple burn effects, Blazing Heart's damage's base multiplier is additionally increased to that of the highest multiplier effect.",
      "3★": "3★ The maximum number of Feist's Phantasia is increased to 2. After Whirling lands a hit, additionally create 1 FeiSe's Phantasia.",
      "5★": "5★ For every 1 FeiSe's Phantasia or Lotus Petal in the Mirage, Blazing Heart's damage is additionally increased by 12%. Lotus Asparagus endurance consumption is reduced by 75%.",
      "6★": "6★ Soulwear damage's base multiplier is increased to 270% of ATK, shatter is doubled, and after landing a hit, there is a 15% chance to inflict a 65% delay for 2 seconds (ineffective against bosses in team play and unavailable in Apex League)."
    },
    "matrice_src": "/matrices/feisematrice.jpg",
    "matrice_2p": "After using any flame weapon skill or discharge, increase all attack by 14%/16%/18%/20% for 30 seconds. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 flame weapon, increase all elemental damage by 14%/17%/20%/23%. After creating FeiSe's Phantasia, increase Final damage by 9% for 25 seconds. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "12.00",
    "awaken": "After using Whirling, for every 1 Flame weapon equipped, increase Final Damage by 9% for 30 seconds.",
    "awaken_title": "Awaken: Darkshadow",
    "release_date": "SEPTEMBER 26, 2023",
    "src_video": "https://www.youtube.com/embed/JjUNvMwBdis?si=BORYwMZg21-P56X7",
    "attacks": [
      {
        "name": "Maneuver",
        "description": "While on the ground, use normal attack to launch 6 consecutive attacks. First Attack: Deal damage equal to 82% of ATK. Second Attack: Deal damage equal to 122% of ATK. Third Attack: Deal damage equal to 132% of ATK. Fourth Attack: Deal damage equal to 144% of ATK. Fifth Attack: Deal damage equal to 146% of ATK. Sixth Attack Deal damage equal to 115% of ATK"
      },
      {
        "name": "Shifting Clouds",
        "description": "While airborne, use normal attack to launch 6 consecutive attacks in mid-air, consuming endurance. First Attack: Deal damage equal to 72% of ATK. Second Attack: Deal damage equal to 98% of ATK. Third Attack: Deal damage equal to 142% of ATK. Fourth Attack: Deal damage equal to 142% of ATK. Fifth Attack: Deal damage equal to 173% of ATK. Sixth Attack Deal damage equal to 144% of ATK"
      },
      {
        "name": "Golden Autumn",
        "description": "While using on the ground, tap and hold normal attack when using the First to third normal attacks to trigger Golden Autumn. Draw in nearby targets, dealing damage equal to 259% of ATK and suspending them."
      },
      {
        "name": "Resounding Pendants",
        "description": "While using on the ground, tap and hold normal attack when using the fourth to sixth normal attacks to trigger Resounding Pendants. Deal damage equal to 74% of ATK and knock the targets back."
      },
      {
        "name": "Falling FLowers",
        "description": "During Shifting Clouds, tap and hold normal attack to trigger Falling Flowers. Descend from above. After landing, deal damage equal to 74% of ATK to nearby targets and launch them."
      },
      {
        "name": "Lotus Aspara",
        "description": "When on the ground or while airborne, tap and hold normal attack to trigger Lotus Aspara. Soar ahead continuously in the air while consuming endurance. Use the directional controls to adjust the direction during Lotus Aspara."
      }
    ],
    "dodges": [
      {
        "name": "Dodge",
        "description": "Dodge right before being hit to trigger Phantasia, reducing the speed of enemies within the area."
      },
      {
        "name": "Scatter",
        "description": "Use normal attack during the short perfect dodge window (use a directional button before dodging) to trigger Flower Scatter, dealing damage equal to 209% of ATK to nearby targets.During Mirage Fantasy created by Whirling, after the First dodge attack using any weapon lands a hit, trigger Flower Graft, creating a Fei Se's Phantasia and Lotus Petal. Fei Se's Phantasia: Upon creation, Fei Se's Phantasia copies 25% of the target's Max ATK and converts it to the Wanderer's base Flame ATK [not lower than 3,300 and not exceeding 3,450; this Flame ATK will not be reflected on the Wanderer's stats and is unavailable in Apex League] until Fei Se's Phantasia disappears. This is calculated independently for each Fei Se's Phantasia. There can be only 1 Fei Se's Phantasia at a time. Lotus Petal: Upon creation, the Lotus Petal count is equal to the number of summons created by the Wanderer's weapons other than Endless Bloom. After creation, the Lotus Petal count does not change with the number of summons. Lotus Petals are considered as summons."
      },
      {
        "name": "Flutter",
        "description": "Use normal attack during the short period after dodging to trigger Flutter, dealing damage equal to 120% of ATK to nearby targets."
      }
    ],
    "skills": [
      {
        "name": "Whirling",
        "description": "Tap the skill button to cast Deal damage equal to 1,008% of ATK to nearby targets and create a Mirage Fantasy, lasting up to 25 seconds.When Whirling is in cooldown, gain the new skill, Lissom. Lissom can be used after the Mirage has been active for 20 seconds. After the Mirage disappears, immediately refresh Whirling's cooldown. This is not affected by other cooldown clearing, resetting, or changing effects. During the Mirage: Every second, deal Soulwear damage equal to 135% of ATK. Soulwear damage counts as normal attack damage. Every 5 seconds, inflict Blazing Heart on targets within range, dealing burn damage equal to 20% of ATK for 5 seconds. For every 1 Fei Se's Phantasia or Lotus Petal created by the Wanderer in the Mirage, Blazing Heart's damage is additionally increased by 6%."
      },
      {
        "name": "Lissom",
        "description": "When Whirling is in cooldown, gain the new skill, Lissom. Lissom can be used after the Mirage has been active for 20 seconds. Clear all Fei Se's Phantasias and Lotus Petals in the Mirage created by the Wanderer. For every 1 Fei Se's Phantasia or Lotus Petal cleared, deal damage equal to 180% of ATK to nearby targets. Then, shatter the Mirage Fantasy, dealing damage equal to 450% of ATK to nearby targets."
      }
    ],
    "discharges": [
      {
        "name": "Unparalleled Jade Poo",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer, dealing damage equal to 1,090% of ATK. During this period, gain damage immunity For 1.5 seconds [unavailable in Apex League]."
      }
    ]
  },
  {
    "id": 37,
    "src": "/background/linghanbackground.jpg",
    "alt": "Imagen 37",
    "title": "Ling Han",
    "weapon": "Alabaster Tiger",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Frost Resonance: Increase Frost ATK by 15% and Frost Resistance by 25%. Activate by equipping 2 or more Frost weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "Extreme Cold: Unload: After using Sword Art: Shadowy Ice, every second, deal damage equal to 70% of frost ATK plus 10% of the Wanderer's Max HP plus 36% of the sum of all the Wanderer's resistance types plus 135% of crit for 30 seconds. Multiple Unload damage will not stack and Extreme Cold damage will be counted as skill damage. If there is 1 volt/flame/physical weapon of any kind equipped, Extreme Cold damage is multiplied by 1.3 times. In addition, Extreme Cold damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
      "1★": "1★ After launching Frost Blades, the Wanderer's frost ATK is increased by 10% and nearby targets will be dealt damage equal to 80% of ATK every second for 30 seconds.",
      "3★": "3★ The Wanderer can produce up to 4 Frost Blades and Temperature Reduction's damage's base multiplier is increased to 360%. If the target is the only one affected by Temperature Reduction within 6 seconds, additionally apply Vein Seal to the target, reducing their speed by 30% (unavailable in Apex League and against bosses). If the target receives Frost Blade damage again during Vein Seal's duration, trigger Icy Burst, dealing skill damage equal to 1,700% of ATK plus 2% of the target's HP lost at that point (Icy Burst damage will be no lower than 2,000% of the Wanderer's frost ATK and no higher than 2,200% of the Wanderer's frost ATK). Then, remove the Vein Seal and Temperature Reduction effects on the target.",
      "5★": "5★ The damage dealt by Crystalline Crack and Cold Air is additionally increased by 50%. Light Steps' use attempts is increased to 10 and recovery rate is increased to 1 attempt every 3 seconds.",
      "6★": "6★ The Temperature Reduction effect inflicted after firing Frost Blades is now applied to an area and also deals additional damage equal to 990% of ATK to nearby targets."
    },
    "matrice_src": "/matrices/linghanmatrice.jpg",
    "matrice_2p": "Increase all elemental damage by 7%/8%/9%/10%. When firing Frost Blades, deal additional damage to 416% of ATK to nearby targets. This set effect works in the off-hand slot, and only the set with highest star rating will take effect.",
    "matrice_4p": "After using any frost weapon's discharge skill, increase final damage by 12%/15%/19%/23% for 30 seconds. When Alabaster Tiger is equipped, increase all attack by 12%. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "16.00",
    "charge": "8.00",
    "awaken": "Increase final damage by 18%. When Alabaster Tiger is equipped, gain damage immunity for 4 seconds when using Sword Art: Icy Beckon (unavailable in Apex League). For every 1 frost weapon equipped, increase frost damage by 2.5%. When 3 frost weapons are equipped, gain an additional 350 weapon charge after the Wanderer uses any frost weapon skill. After using any frost weapon's skill or discharge other than Alabaster Tiger's, deal additional damage equal to 1,456% of ATK to nearby targets.",
    "awaken_title": "Awaken: Governing Blade",
    "release_date": "OCTOBER 24, 2023",
    "attacks": [
      {
        "name": "Sword Art: Mooncutter",
        "description": "While on the ground, use your normal attack to land 6 consecutive attacks. First Attack: Deal damage equal to 97.8% of ATK + 5 and knock the target back.Second Attack: Deal damage equal to 129.4% of ATK + 7 and knock the target back.Third Attack: Deal damage equal to 207.2% of ATK + 11 and knock the target back.Fourth Attack: Deal damage equal to 125% of ATK + 7 and knock the target back.Fifth Attack: Deal damage equal to 226% of ATK + 12 and draw in enemies to the front of the Wanderer. Sixth Attack: Deal damage equal to 253.6% of ATK + 13 and launch the target. After triggering Sword Art: Mooncutter, tap and hold normal attack to trigger Sword Art: Endless Snow. After any of Alabaster Tiger's normal attacks land a hit, apply 1 stack of Crystalline Crack to the target, dealing normal attack damage equal to 48% of ATK every second for 15 seconds. Only 1 stack of Crystalline Crack can be applied to the same target every 4 seconds, stacking up to 3 times. The stacks will disappear one by one after the effect duration is over."
      },
      {
        "name": "Sword Art: Plum Swordcry",
        "description": "While in the air, use your normal attack to land 6 consecutive attacks at the expense of stamina. First Attack: Deal damage equal to 95.9% of ATK + 5. Second Attack: Deal damage equal to 100.7% of ATK + 5. Third Attack: Deal damage equal to 218.6% of ATK + 12. Fourth Attack: Deal damage equal to 130% of ATK + 7. Fifth Attack: Deal damage equal to 213.7% of ATK + 11. Sixth Attack: Deal damage equal to 256.9% of ATK + 14."
      },
      {
        "name": "Sword Art: Endless Snow",
        "description": "While using normal attack on the ground, tap and hold normal attack to trigger Sword Art: Endless Snow. Use mind control to manipulate the sword while consuming endurance, during which the Wanderer gains hyperbody. Every attack that lands deals damage equal to 140.8% of ATK plus 7 to nearby targets. When Sword Art: Endless Snow ends, release a powerful sword aura, dealing damage equal to 422.4% of ATK plus 22 to nearby targets"
      },
      {
        "name": "Sword Art: Falling Frost",
        "description": "Tap and hold normal attack while airborne (tap when a target is available), or use normal attack while climbing, jumping backward, or using the Jetpack to trigger Sword Art: Falling Frost. While falling, deal damage equal to 75% of ATK plus 4 each time a target is hit. Upon landing, deal damage equal to 366.7% of ATK plus 19 to nearby targets."
      },
      {
        "name": "Light Steps",
        "description": "While the Wanderer is airborne after double jumping, tap jump to trigger Light Steps. Briefly dash upward before gliding down. While airborne, Light Steps can be used up to 2 times. While on the ground, Light Steps recovers 1 use attempt every 10 seconds (switching areas or unequipping Alabaster Tiger will reset the use attempts)."
      }
    ],
    "dodges": [
      {
        "name": "Dodge",
        "description": "Dodge right before being hit to trigger Phantasia, reducing the speed of enemies within the area."
      },
      {
        "name": "Sword Art: Cloud Shower",
        "description": "Use normal attack during the short perfect dodge window (use a directional button before dodging) to trigger Sword Art: Cloud Shower, dealing damage up to 305% of ATK plus 16 to targets hit."
      },
      {
        "name": "Sword Art: Mortal Soul",
        "description": "Use normal attack during the short period after dodging to trigger Sword Art: Mortal Soul. Release a White Tiger illusion to deal damage equal to 167.8% of ATK plus 9 to targets ahead."
      }
    ],
    "skills": [
      {
        "name": "Sword Art: Shadowy Ice",
        "description": "Deal damage equal to 370.2% of ATK plus 19 to nearby targets an draw them in. Then, form a Sword Array to summon a heavy rain of swords and strongly freeze targets [unavailable in Apex League and against bosses] for 4 seconds. Cooldown: 30 seconds. After successfully using Sword Art: Shadowy Ice, the Wanderer emits Cold Air, dealing damage equal to 68% of ATK to nearby targets every second and reducing the targets speed by 30% [unavailable in Apex League and against bosses]. At the same time, increase the Wanderer's frost damage by 8% for 35 seconds.After completely executing Sword Art: Shadowy Ice, the Wanderer creates a large amount of Frost Blades, firing 1 blade every 7.5 seconds at the currently locked-on target, dealing damage equal to 360% of ATK and inflicting Temperature Reduction on the target. There can be up to 3 Frost Blades created initially, and all blades will be removed while in the non-combat state.Temperature Reduction: Deal damage equal to 240% of ATK every 3 seconds to nearby targets for 12 seconds."
      }
    ],
    "discharges": [
      {
        "name": "Sword Art: Icy Beckon",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer and summon a Sword Array around the Wanderer, engulfing the area in cold and dealing damage up to 844.5% of ATK plus 44 to nearby targets. Soon after, summon a White Tiger to deal damage equal to 1,971% of ATK plus 104, during which damage immunity lasts for 1.5 seconds [unavailable in Apex League]. Passive: After Sword Art: Icy Beckon lands a hit, increase final damage by 8% for 30 seconds."
      }
    ]
  },
  {
    "id": 38,
    "src": "/background/nanyinbackground.jpg",
    "alt": "Imagen 38",
    "title": "Nan Yin",
    "weapon": "Nan Yin",
    "weapon_effects": "Influence: after switching the weapon to Black Bamboo, Black Bamboo's damage element type will be changed to the element type of the previous active weapon.Temporary Dwelling: any unlocked wanderer's weapon can be enhanced with Darkness in the settings of a specific weapon.Darkness-enhanced weapons deals 1% more damage.When not spreading to other weapons, Darkness resides in Black Bamboo, increasing all wanderer's damage dealt by 15% when Black Bamboo is the current active weapon.",
    "element_resonance": "Last Knock: Increase ATK by 30%. Activate by equipping 3 altered weapons. This set effect works in the off-hand slot.",
    "weapon_passive": "When landing any hit with Equilibrium, it deals damage to nearby targets equal to 2,250% of physical ATK plus 38% of the Wanderer's Max HP plus 1.350% of the sum of all the Wanderer's resistance types plus 4,500% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Flying Blade damage is counted as normal attack damage. If there is 1 frost/volt weapon of any kind equipped, Flying Blade damage is multiplied by 2.5 times. In addition, Flying Blade damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
      "1★": "1★ Darkness damage buff is further increased by 1% for every 1 advancement level of Darkness-enhanced weapon. Hyperspace damage's base multiplier is increased to 0.06% of total wanderer damage in Hyperspace (not including Shadow damage) plus 2,400% of ATK.",
      "3★": "3★ Shadow inherits an additional 50% of the wanderer's ATK. If the wanderer is not in Trance state, when the wanderer takes lethal damage, the Shadow disappears and the wanderer becomes invulnerable for a short period of time. This effect triggers once every 60 seconds, with other similar effects triggering first and works in the off-hand slot.",
      "5★": "5★ In Hyperspace, you ignore 20% of target's elemental resistance. The limit of created Abyss Flows is increased to 3",
      "6★": "6★ Hyperspace damage's base multiplier is increased to 0.6% of total wanderer damage in Hyperspace [not including Shadow damage] plus 2,400% of ATK."
    },
    "matrice_src": "/matrices/nanyinmatrice.jpg",
    "matrice_2p": "Increases all attack types by 19%/21%/23%/25%. Shadow inherits an additional 30% of the wanderer's ATK. The first time you deal damage in combat, 1,000 weapon charge is granted. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "After equipping Purple Bamboo, increase crit damage by 8% and final damage by 18%/20%/22%/24%. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "12.00",
    "awaken": "Increase final damage by 18%. When Black Bamboo is the current active weapon, all elemental damage is increased by 14% for each equipped non-altered weapon.",
    "awaken_title": "Awaken: Lingering Sound",
    "release_date": "NOVEMBER 21, 2023",
    "attacks": [
      {
        "name": "Tonal Resonance",
        "description": "First Attack: Deal damage equal to 120% of ATK. Second Attack: Deal damage equal to 168% of ATK. Third Attack: Deal damage equal to 172% of ATK. Fourth Attack: Deal damage equal to 286% of ATK. Fifth Attack: Deal damage equal to 1,640% of ATK."
      },
      {
        "name": "Global Resonance",
        "description": "Deal damage equal to 120% of ATK.Second Attack: Deal damage equal to 176% of ATK.Third Attack: Deal damage equal to 172% of ATK.Fourth Attack: Deal damage equal to 275% of ATK.Fifth Attack: Deal damage equal to 1,560% of ATK."
      },
      {
        "name": "Shadow Burst",
        "description": "Hold while on the ground to trigger Shadowburst, expending stamina.Attacks forward, dealing damage equal to 295%/590%/886% of ATK to nearby enemies.After using Shadowburst, press and hold a normal attack to perform Surf Fracture."
      },
      {
        "name": "Aerial Shadowburst",
        "description": "Hold while in the air to trigger Aerial Shadowburst, expending stamina. Attacks forward, dealing damage equal to 310%/620%/930% of ATK to nearby enemies.After using Aerial Shadowburst, press and hold a normal attack to perform Flow Fracture."
      },
      {
        "name": "Surf Fracture",
        "description": "Hold after using Shadowburst to perform Surf Fracture, expending stamina. Attacks forward, dealing damage equal to 1,611% of ATK to nearby targets."
      },
      {
        "name": "Flow Fracture",
        "description": "Hold after using Aerial Shadowburst to perform Flow Fracture, expending stamina.Attacks forward, dealing damage equal to 1,742% of ATK to nearby targets."
      },
      {
        "name": "Hollow Abyss Flow",
        "description": "Hold on the ground to create an Abyss Flow at the current location. Click on the created marker on the world map to teleport to that location or configure it. Up to 2 Abyss Flows can exist at a time."
      }
    ],
    "dodges": [
      {
        "name": "Dodge",
        "description": "Dodge right before being hit to trigger Phantasia, reducing the speed of enemies within the area."
      },
      {
        "name": "Vortex Field",
        "description": "Use normal attack during the short perfect dodge window [use a directional button before dodging] to trigger Vortex Field. Dark Matter is created at the chosen location, dealing damage equal to 360% of ATK. When enemies pass near the Dark Matter, a Vortex Field is formed that pulls them together. When passing through the Vortex Field, the wanderer gains Dimension Defense effect for 15 seconds, which allows blocking 1 attack from a target whose damage will not exceed 300% of the wanderer's Max HP. Up to 1 Dimension Defense effect can be received every 15 seconds."
      },
      {
        "name": "Sword Art: Mortal Soul",
        "description": "Use normal attack during the short period after dodging to trigger Sword Art: Mortal Soul. Release a White Tiger illusion to deal damage equal to 167.8% of ATK plus 9 to targets ahead."
      }
    ],
    "skills": [
      {
        "name": "Hyperspace",
        "description": "Wanderer gains temporary invulnerability, activates Hyperspace, and deals damage equal to 2,080% of ATK to nearby targets, also slowing them by 65% for 3 seconds (has no effect in team play and against bosses). At the same time, triggers Shadow's skill. Cooldown: 60 seconds. Wanderer soars into the air and forces nearby enemies to enter Hyperspace. Hyperspace lasts up to 60 seconds, during which the wanderer gains the Hyperbody effect, and Black Bamboo's damage ignores enemies shields.Hyperspace gains 2 plus the number of enemies in the area times 1 energy every second.When the amount of stored energy reaches 45, Hyperspace collapses, dealing damage equal to 0.06% of the total wanderer damage in Hyperspace (not including Shadow damage) plus 2,000% of ATK.Hyperspace disappears prematurely after 4 collapses."
      },
      {
        "name": "Butterfly Dance",
        "description": "In team play, after any successful Black Bamboo's dodge skill creates 1 butterfly that will follow the wanderer for 60 seconds. When Attack Resonance/Balance Resonance is active: The butterfly surrounds the wanderer's target. Its flight path forms a visual trail and deals damage equal to 300% of the target's ATK as it passes through the trail. When Fortitude Resonance is active: Targets passing through the butterfly's trail are slowed by 65% for 2 seconds. Allies (including yourself) passing through the butterfly's trail receive a shield equal to 10% of Max HP, stacking up to 20%, and lasts for 15 seconds. The shield can be received once per second. When Benediction Resonance is active: When an ally takes lethal damage and falls to the ground, the butterfly helps them up immediately and then disappears."
      }
    ],
    "discharges": [
      {
        "name": "Sword Art: Icy Beckon",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer, creates chains and shackles the target, slowing by 65% for 3 seconds (has no effect in team play and against bosses).Deals damage equal to 3,970% of ATK. During this period, gain damage immunity for 2.6 seconds (unavailable in Apex League).Passive: Shadow Harmony Fetters create a Shadow on the Field,which synergistically attacks the same target with the wanderer. Only 1 Shadow can exist at a time. The Shadow lasts for 20 seconds out of combat. For each equipped altered weapon or weapon of different element, Shadow's damage increases by 10%. Shadow's damage is not affected by any damage boost effects except from titan equipment's rare stats and won't trigger additional attack effects. Press and hold the dodge button to enter the Trance stance: you become bound to the Shadow and can control its movements, but Shadow loses his synergy attack which is replaced by Shadow Normal Attack and Shadow Skill.When you enter a Trance state,Shadow goes into a Rage state: its movement speed, damage reduction, shatter, and charge rates are increased by 50%. In addition, Shadow's normal attack and skill damage are increased by the percentage of HP lost. Shadow Synergy: periodically deals damage equal to 1,760% ~ 3,200% of Shadow's ATK to wanderer's target. Shadow Aura: every second deals damage equal to 800% of Shadow's ATK to nearby targets. Shadow Normal Attack: press the normal attack button to perform 4 consecutive attacks. Each attack deals damage equal to 4,800% ~ 7,700% of Shadow's ATK to nearby targets (counts as normal attack damage).Shadow Skill: spends 25% of Shadow's Max HP and deals damage equal to 14,300% ~ 15,600% of Shadow's ATK to nearby targets (counts as skill damage). Shadow Banishment: Shadow disappears when it takes lethal damage, when Wanderer removes or retrieves Black Bamboo, or when Wanderer presses and holds the dodge button while the Trance trance is active. Passive: AmbivalenceHarmony Fetters triggers an additional effect that depends on the element type of the previous weapon that was active before. Frost: summons Darkness: Baihu,deals damage equal to 1,000% of ATK and gains a shield equal to 60% of Max HP for 30 seconds. At the same time creates an ice storm for 60 seconds at the wanderer's target location, every second dealing damage equal to 700% of ATK (counts as normal attack damage). Flame: summons Dark Wretch: Black Crow,deals damage equal to 1,000% of ATK and inflicts burn for 10 seconds, every second dealing damage equal to 320% of ATK (counts as passive damage). Volt: summons Dark Wretch: Longxiang, deals damage equal to 1,000% of ATK. When wanderer is not in Trance state, every second consumes 5% of Shadow's Max HP to deal additional equivalent damage to nearby targets (counts as normal attack damage). Physical: summons Darkness: Hornmane, deals damage equal to 1 000% of ATK and grants a Sweeping effect For 30 seconds, dealing additional damage equal to 750% of ATK to nearby targets when a critical hit is landed(counts as normal attack damage). Additional damage can trigger once per 0.85 seconds. Altered: summons Darkness: Taote, deals damage equal to 1,050% of ATK. The Shadow additionally inherits 100% of the wanderer's ATK. When Shadow disappears, an explosion is created, dealing damage equal to 15,000% of Shadow's ATK (counts as skill damage)."
      }
    ],
    "recommended_pairing": [
      {
        "title": "Yan Miao",
        "src": "/src/assets/images/yanmiao.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/zekedual.jpg"
      },
      {
        "title": "Fiona",
        "src": "/src/assets/images/Fiona.jpg",
        "miniImage1": "/src/assets/mini-images/healer.jpg",
        "miniImage2": "/src/assets/mini-images/alteredelement.jpg"
      },
      {
        "title": "Mimi",
        "src": "/src/assets/images/mimi1.jpg",
        "miniImage1": "/src/assets/mini-images/tank.jpg",
        "miniImage2": "/src/assets/mini-images/voltelement.jpg"
      },
      {
        "title": "Feise",
        "src": "/src/assets/images/feise.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/fireelement.jpg"
      },
      {
        "title": "Ling Han",
        "src": "/src/assets/images/linghan.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/frostelement.jpg"
      }
      
    ],
    "recommended_matrice": [
      {
        "title": "Nan Yin",
        "src": "/public/matrices/nanyinmatrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Scylla",
        "src": "/public/matrices/scyllamatrice.jpg",
        "quantity": "X2"
      },
      {
        "title": "Lyra",
        "src": "/public/matrices/lyramatrice.jpg",
        "quantity": "X2"
      }

    ]
  },
  {
    "id": 39,
    "src": "/background/yanmiaobackground.jpg",
    "alt": "Imagen 39",
    "title": "Yan Miao",
    "weapon": "Yan Miao",
    "weapon_effects": "When the weapon is fully charged, the next attack will apply an armor melt effect to enemies for 45 seconds, increasing the physical and flame damage they take by 10%, and in team play this value is additionally increased by 15% [armor melt replaces the grievous effect on the target and does not allow grievous to get applied again for the duration of armor melt). Every 15 seconds, a target affected by armor melt will be stunned for 2 seconds when taking physical damage and slowed by 50% for 5 seconds when taking flame damage.",
    "element_resonance": "Increase Physical ATK by 15% and Physical Resistance by 25%. Activate by equipping 2 or more Physical weapons. This set effect works in the off-hand slot. Cannot stack with other Physical Resonance effects, with Physical Resonance taking precedence.",
    "weapon_passive": "When landing any hit with Equilibrium, it deals damage to nearby targets equal to 2,250% of physical ATK plus 38% of the Wanderer's Max HP plus 1.350% of the sum of all the Wanderer's resistance types plus 4,500% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Flying Blade damage is counted as normal attack damage. If there is 1 frost/volt weapon of any kind equipped, Flying Blade damage is multiplied by 2.5 times. In addition, Flying Blade damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
      "1★": "1★ The number of Flaming Daggers received from Empyrean Rotation is increased to 4, and the maximum Frequency of Flaming Dagger use is reduced to once every 1.8 seconds.",
      "3★": "3★ Wanderer ignores 30% of the target's physical and flame resistances [the total value of ignoring resistance to a particular element cannot exceed 50%).",
      "5★": "5★ When Flaming Dagger is triggered, wanderer gains a shield equal to 30% of Max HP for 20 seconds. The shields gained cannot exceed 30% of Max HP [shields that exceed this value will be converted into healing at the rate of 50% of the shield].",
      "6★": "6★ Flaming Daggers damage is increased to 8,800% and the Final damage buff after a Flaming Dagger is triggered is further increased by 16%."
    },
    "matrice_src": "/matrices/yanmiaomatrice.jpg",
    "matrice_2p": "Increases physical attack and flame attack by 20%/25%/30%/35%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 physical weapon, all elemental damage is increased by 28%/32%/36%/42%. When equipped with Equilibrium, all elemental damage is additionally increased by 21%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "16.00",
    "charge": "12.00",
    "awaken": "Final damage is increased by 18% When equipped with Equilibrium, physical damage dealt is increased by 16% against targets below 80% HP. Each equipped physical weapon increases Equilibrium's normal attacks damage by 30%, up to 60%.",
    "awaken_title": "Awaken: Laws And Scales",
    "release_date": "DECEMBER 19, 2023",
    "src_video": "https://www.youtube.com/embed/QK4J9EsoqWs?si=KR86K5mzfTqNfswj",
    "attacks": [
      {
        "name": "Ink Stain Glitter",
        "description": "While on the ground, use normal attack to launch 6 consecutive attacks. Each attack deals a different amount of damage: First Attack: Deal damage equal to 340% of ATK. Second Attack: Deal damage equal to 733% of ATK.Third Attack: Deal damage equal to 514% of ATK.Fourth Attack: Deal damage equal to 1,701% of ATK. Fifth Attack: Deal damage equal to 928% of ATK. Sixth Attack: Deal damage equal to 1,550% of ATK."
      },
      {
        "name": "Clouds Coloring The Sky",
        "description": "While airborne, use a regular attack to perform 6 consecutive attacks in mid-air, consuming endurance. Each attack deals a different amount of damage: First Attack: Deal damage equal to 340% of ATK. Second Attack: Deal damage equal to 733% of ATK. Third Attack: Deal damage equal to 514% of ATK. Fourth Attack: Deal damage equal to 1,701% of ATK. Fifth Attack: Deal damage equal to 884% of ATK. Sixth Attack: Deal damage equal to 1,590% of ATK."
      },
      {
        "name": "Peace Within The Universe",
        "description": "While on the ground, press and hold normal attack after using a second normal attack to trigger Peace Within The Universe. Throws Equilibrium into the ground, creating a double-sided spinning blade that spirals outward and deals damage equal to 1,976% of ATK to the target."
      },
      {
        "name": "Falling Leaves In The Moonlight",
        "description": "While in the air, press and hold normal attack to trigger Falling Leaves In The Moonlight. Upon landing, deals damage equal to 943% of ATK to targets near the released Equilibrium. When the released Equilibrium reassembles, it slightly pull nearby enemies and deals damage equal to 940% of ATK."
      }
    ],
    "dodges": [
      {
        "name": "Wind Plays With Shadows",
        "description": "Use normal attack during the short perfect dodge window [use a directional button before dodging] to trigger Wind Plays With Shadows. Throws Equilibrium forward and deals damage equal to 690% of ATK."
      },
      {
        "name": "Dance With Daggers",
        "description": "Use normal attack during the short perfect dodge window to trigger Dance With Daggers.Creates 8 flying daggers that randomly chase the target in front and strike them, dealing area damage equal to 1,032% of ATK."
      },
      {
        "name": "Bright Radiance",
        "description": "Press and hold normal attack during the short perfect dodge window to trigger Bright Radiance. Hold Continuously throws flying daggers that chase the target in front and strike them, dealing a total damage equal to 666% of ATK. Wanderer then jumps up and throws Equilibrium forward, dealing damage equal to 889% of ATK to nearby targets. Bright Radiance can be held for up to 3 seconds, after which it automatically ends."
      },
      {
        "name": "Through The Clouds",
        "description": "While on the ground or in the air, press and hold dodge button to trigger Through The Clouds. After a short period of skill charge, the wanderer turns into a beam of light and flies in the chosen direction, at the end of its path dealing damage equal to 1,080% of ATK to nearby targets. The distance of flight increases depending on the time of skill charge. The maximum charge is reached by holding the dodge button for 1.5 seconds."
      }
    ],
    "skills": [
      {
        "name": "Empyrean Rotation",
        "description": "Wanderer deals damage equal to 4,099% of ATK and gains a hyperbody for 20 seconds. At the end of Empyrean Rotation creates 3 Flaming Daggers for 20 seconds [the maximum number of Flaming Daggers can only be given once every 20seconds]. Cooldown: 20 seconds. Flaming Daggers: When hitting the target with a dodge attack of any flame or physical weapon, 1 Flaming Dagger will be used to inflict armor melt on the target and deal additional damage equal to 6,500% of ATK of the corresponding active weapon element type. Hitting the target with a Flaming Dagger restores 1 dodge attempt and increases final damage by 20% for 20 seconds. Flaming Dagger can be triggered once every 2.8 seconds, and its damage counts as normal attack damage."
      }
    ],
    "discharges": [
      {
        "name": "Cloud-Bursting Meteorite",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer and causes Equilibrium to spin at high speed, sending the wanderer forward and dealing damage equal to 3,990% of ATK to enemies in its path. During this period, gain damage immunity for 2.6 seconds [unavailable in Apex League]."
      }
    ],
    "recommended_pairing": [
      {
        "title": "Zeke",
        "src": "/src/assets/images/zeke.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/zekedual.jpg"
      },
      {
        "title": "Nan Yin",
        "src": "/src/assets/images/nanyin.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/alteredelement.jpg"
      }
      
    ],
    "recommended_matrice": [
      {
        "title": "Yan Miao",
        "src": "/public/matrices/yanmiaomatrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Samir",
        "src": "/public/matrices/samirmatrice.jpg",
        "quantity": "X2"
      },
      {
        "title": "Lyra",
        "src": "/public/matrices/lyramatrice.jpg",
        "quantity": "X2"
      }

    ]
  },
  {
    "id": 40,
    "src": "/background/brevey_background.png",
    "alt": "Imagen 40",
    "title": "Brevey",
    "weapon": "Brevey",
    "weapon_effects": "When the weapon is fully charged, the next attack applies Force Impact on the enemy for 45 seconds, increasing their frost and volt damage taken by 10% (and an additional 15% in team play). Force Impact replaces the target's grievous status, and targets with Force Impact cannot become grievous. Frost attacks will freeze targets with Force Impact for 2 seconds, and volt attacks will remove the buffs on targets with Force Impact. This effect can only trigger 1 time every 15 seconds on the same target.",
    "element_resonance": "Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "secondary_elemental_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "When equipped with Pactcrest ☆ Metz, weapon discharge skills deal initial damage equal to 46.87% of volt ATK plus 0.62% of the Wanderer's Max HP plus 23.43% of the sum of all the Wanderer's resistance types plus 85.93% of crit to nearby targets. While in the combat state, after every 0.5 seconds, the next Swift Cut damage will be increased by an additional 1 time, up to a maximum of 30 times. When multiple Swift Cut damages exist, the highest initial value is used for calculation. Swift Cut damage counts as discharge damage. If any flame or physical weapon is equipped, Thunderbolt damage is multiplied by 1.3. In addition, Thunderbolt damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "aditional_effect": "When challenging Bygone Phantasm and Sequential Phantasm with Pactcrest ☆ Metz equipped, gain an additional 15 seconds to the challenge duration. When challenging Origin of War, for every 1 Pactcrest ☆ Metz equipped by the team, the team gains an additional 25 seconds to the challenge duration, up to 50 seconds.",
    "advancements": {
      "1★": "1★ Each Pink Chain Frenzy or Metz off-hand coordinated attack hit recovers HP equal to 12% of ATK. In team play, each hit recovers HP by 18%. When a Bestie takes damage that reduces their HP below 25% of their max HP, also recover HP equal to 30% of their Max HP and grant them damage immunity for 3 seconds. If the damage is fatal, then additionally prevent the lethal effect 1 time. Can be triggered up to 1 time every 60 seconds.",
      "3★": "3★ When non-Benediction Resonances are active, gain 2 additional uses of Metz Energy Wave, and increase volt damage and frost damage to bosses by 10%. When Benediction Resonance is active, gain 1 additional use of Million-Metz Shockwave, and now recover HP equal to 15% of the Bestie's Max HP to Bestie.",
      "5★": "5★ Increase damage dealt by Metz off-hand coordinated attack and Metz Energy Wave by 30%.",
      "6★": "6★ While Pact Amplification is active, increase volt and frost damage boost effects by 10% and 4% respectively. Metz Halo increases nearby teammates' final damage by 20% and shatter by 25%. This effect does not stack."
    },
    "matrice_src": "/matrices/brevey_matrice.jpg",
    "matrice_2p": "Increases physical attack and flame attack by 20%/25%/30%/35%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 physical weapon, all elemental damage is increased by 28%/32%/36%/42%. When equipped with Equilibrium, all elemental damage is additionally increased by 21%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "10.00",
    "awaken": "Increase final damage by 18%. When Pactcrest ☆ Metz is equipped, increase final damage by an additional 6%. When Benediction Resonance is active, the additional increase in final damage affects nearby teammates as well. This effect does not stack.",
    "awaken_title": "Awaken: Laws And Scales",
    "release_date": "DECEMBER 19, 2023",
    "src_video": "https://www.youtube.com/embed/MKWtkqyJsYc?si=26EdNQJ1UgawwAT-",
    "attacks": [
      {
        "name": "Firefly Wave",
        "description": "While on the ground, use normal attack to launch 5 attacks in a row. First Attack: Deal damage equal to 112% of ATK plus 707 and knock the target back. Second Attack: Deal damage equal to 154% of ATK plus 973 and suspend the target. Third Attack: Deal damage equal to 220% of ATK plus 1389 and knock the target down. Fourth Attack: Deal damage up to 243% of ATK plus 1535 and suspend the target. Fifth Attack: Deal damage equal to 229% of ATK plus 1446 and knock the target down.After triggering Firefly Wave, tap and hold normal attack to trigger Phantasmic Rhythm. While in the combat state, when Pactcrest ☆ Metz is in the off-hand slot, Metz remains on the battlefield for coordinated attacks. Metz is considered a summon, and each attack deals damage equal to 20% of ATK to nearby targets. The type of elemental damage dealt will be that of the current weapon. When Benediction Resonance is active: When in the non-combat state, the first attack from Firefly Wave appoints 1 teammate as 'Bestie' and summons up to 1 Metz to follow the Bestie. Using Metz Halo recovers HP equal to 100% of the Wanderer's ATK to nearby teammates every second, and increases their final damage by 5%. This effect does not stack. Metz stops following the Bestie when the Wanderer is knocked down, or when Metz gets too far from the Wanderer."
      },
      {
        "name": "Flying Star Wave",
        "description": "While airborne, use normal attack to launch 5 attacks in a row in mid-air, consuming endurance. First Attack: Deal damage equal to 112% of ATK plus 707. Second Attack: Deal damage equal to 154% of ATK plus 973. Third Attack: Deal damage equal to 220% of ATK plus 1389. Fourth Attack: Deal damage up to 243% of ATK plus 1535. Fifth Attack: Deal damage equal to 229% of ATK plus 1446."
      },
      {
        "name": "Pink Chain Frenzy ",
        "description": "When on the ground, tap and hold normal attack to trigger Pink Chain Frenzy. Command Metz to attack a target, during which the Wanderer gains hyperbody and consumes endurance. Every attack that lands deals damage equal to 167% of ATK plus 1055 to nearby targets."
      },
      {
        "name": "Phantasmic Rhythm",
        "description": "While using normal attack on the ground, tap and hold normal attack when using the first to fourth normal attacks to trigger Phantasmic Rhythm. Transform into Metz and dash forward, dealing damage equal to 282% of ATK plus 1781 to the targets ahead, then pounce on a target, dealing damage equal to 282% of ATK plus 1781."
      },
      {
        "name": "Familiar Descent",
        "description": "Tap and hold normal attack while airborne (tap when a target is available), or use normal attack while climbing, jumping backward, or using the Jetpack to trigger Familiar Descent. While falling, deal damage equal to 173% of ATK plus 1093 each time the target is hit."
      }
    ],
    "dodges": [
      {
        "name": "Strolling Flash",
        "description": "Use normal attack during the short perfect dodge window (use a directional button before dodging) to trigger Strolling Flash, dealing damage up to 244% of ATK plus 1541 to targets hit."
      },
      {
        "name": "MetzZZz",
        "description": "Use normal attack during the short period after dodging to trigger MetzZZz. Metz crashes into the ground, dealing damage equal to 169% of ATK plus 1067 to targets ahead."
      }
      
    ],
    "skills": [
      {
        "name": "Million-Metz Shockwave",
        "description": "After using Million-Metz Shockwave, the Wanderer enters Pact Amplification for 30 seconds: When Pactcrest ☆ Metz is in the main slot, increase the Wanderer's volt damage by 25%. When Pactcrest ☆ Metz is in the off-hand slot, increase the Wanderer's frost damage by 10%. Cooldown: 30 seconds.When non-Benediction Resonances are active: Deal damage equal to 585% of ATK plus 3695 to nearby targets, and apply Force Impact on them. When Million-Metz Shockwave is on cooldown, dealing accumulated damage equal to 100 times of ATK during Pact Amplification grants 1 use of Metz Energy Wave each time. Metz Energy Wave: Deal damage equal to 1,800% of ATK to nearby targets. Gain up to 1 use every 10 seconds. Using Million-Metz Shockwave again during Pact Amplification resets the duration of Pact Amplification and accumulated damage. When Pact Amplification ends naturally, unused Metz Energy Waves are accumulated, and deal damage equal to unused charges times 1,200% of ATK. When Benediction Resonance is active: Using skills deals damage equal to 585% of ATK plus 3695 and applies Force Impact on targets hit. Recover HP equal to 400% of ATK to the Wanderer and nearby teammates, and recover an additional 10% of the Bestie's Max HP. Remove debuffs and control effects on the Wanderer and nearby teammates (including Graying Bite), and grant immunity to debuffs and control effects for 10 seconds. Cooldown: 15 seconds."
      }
    ],
    "discharges": [
      {
        "name": "Strange Symphonic Realm",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer and summon a Strange Symphonic Realm, dealing damage equal to 811% of ATK plus 5122 to nearby targets, during which damage immunity lasts for 1.5 seconds (unavailable in Apex League). When Benediction Resonance is active: Remove all debuffs and control effects from the Wanderer and nearby teammates (including Graying Bite), and grant them immunity to debuffs and control effects for 10 seconds. The Strange Symphonic Realm transforms nearby targets hit and non-teammate players into Metz (not effective against bosses, and unavailable in Apex League) for 4 seconds. Each target can be transformed up to 1 time every 30 seconds."
      }
    ],
    "recommended_pairing": [
      {
        "title": "Ayanami Rei",
        "src": "/src/assets/images/rei_ayanami.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/dual_volt_frost.jpg"
      },
      {
        "title": "Nora",
        "src": "/src/assets/images/nora.png",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/alteredelement.jpg"
      }
      
    ],
    "recommended_matrice": [
      {
        "title": "Brevey",
        "src": "/matrices/brevey_matrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Samir",
        "src": "/matrices/samirmatrice.jpg",
        "quantity": "X2"
      },
      {
        "title": "Scylla",
        "src": "/public/matrices/scyllamatrice.jpg",
        "quantity": "X2"
      }

    ]
  },
  {
    "id": 41,
    "src": "/background/plotti_background.png",
    "alt": "Imagen 41",
    "title": "Plotti",
    "weapon": "Plotti",
    "weapon_effects": "When the weapon is fully charged, the next attack inflicts Armor Dissolve on the target for 45 seconds, increasing their flame and physical damage taken by 10% (and an additional 15% in team play). This effect will replace the grievous status on the target, and targets with this effect cannot become grievous. Physical attacks will stun targets under the dissolve effect for 2 seconds, and flame attacks will decrease the targets' speed by 50% for 5 seconds. This effect can only trigger 1 time every 15 seconds on the same target.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect works in the off-hand slot. Cannot stack with other Flame Resonance or Flame reaction effects, with Flame Resonance taking precedence.",
    "secondary_elemental_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical weapons. This set effect works in the off-hand slot. Cannot stack with other Physical Resonance or Physical reaction effects, with Physical Resonance taking precedence.",
    "weapon_passive": "After using Mirror Image, deal damage equal to 87.5% of flame ATK plus 12.5% of the Wanderer's Max HP plus 45% of the sum of all the Wanderer's resistance types plus 168.8% of crit to the target every second for 30 seconds. Multiple Detachment damages will not stack. Poppa damage counts as skill damage. If there is 1 volt or frost weapon equipped, then Poppa's damage is multiplied by 1.3. In addition, Poppa's damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "aditional_effect": "",
    "advancements": {
      "1★": "1★ While Poppa is Here is active, Poppa will launch a Heavy Energy Round II for every 7 explosive shot fired, dealing damage equal to 590% of ATK to nearby targets and then splits into several high explosives, dealing damage equal to 660% of ATK to nearby targets.",
      "3★": "3★ After Poppa appears, increase final damage by 12% and physical damage by 6% for 25 seconds. After Poppa appears 5 times, the next use of Mirror Image will refresh Phantasia Cooldown and immediately trigger Phantasia.",
      "5★": "5★ Reduce Heavy Energy Round I's trigger interval to 6 seconds. When firing Heavy Energy Round I or Heavy Energy Round II, also fire a Healing Round that recovers 10% of the Wanderer's Max HP.",
      "6★": "6★ Mirror (Target)'s damage reflection effect can now also affect the target. Mirror (Self)'s damage reflection ratio is increased to 30% and the maximum reflected damage is increased to 800% of the Wanderer's Max HP. Additionally, while Mirror (Self) is in effect, every time the Wanderer takes damage, additionally block damage equal to 10% of Max HP (excess damage will be taken normally, unavailable in Apex League). This effect can be triggered up to 1 time every 3 seconds. During cooldown, when Poppa appears and admires herself in the mirror, reduce the effect's cooldown by 1 second."
    },
    "matrice_src": "/matrices/plotti_matrice.jpg",
    "matrice_2p": "Increases physical attack and flame attack by 20%/25%/30%/35%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 physical weapon, all elemental damage is increased by 28%/32%/36%/42%. When equipped with Equilibrium, all elemental damage is additionally increased by 21%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "12.00",
    "awaken": "Increase final damage by 18%. Increase EP-7000 Skyfire's flame damage by 30%.",
    "release_date": "DECEMBER 19, 2023",
    "src_video": "https://www.youtube.com/embed/ZzCjOLNdGBw?si=SvExh0n7ZUBaXHMr",
    "attacks": [
      {
        "name": "Standard Protocol",
        "description": "While on the ground, use normal attack to attack 5 times in a row. First Attack: Deal damage equal to 140% of ATK plus 3166. Second Attack: Deal damage equal to 884% of ATK plus 264. Third Attack: Deal damage equal to 1667% of ATK plus 186. Fourth Attack: Deal damage equal to 1175% of ATK plus 174. Fifth Attack: Deal damage equal to 1098% of ATK plus 501."
      },
      {
        "name": "Burst Fire Protocol",
        "description": "While airborne, use normal attack to launch 5 attacks in a row in mid-air, consuming endurance. First Attack: Deal damage equal to 140% of ATK plus 3166. Second Attack: Deal damage equal to 884% of ATK plus 264. Third Attack: Deal damage equal to 1667% of ATK plus 186. Fourth Attack: Deal damage equal to 1175% of ATK plus 174. Fifth Attack: Deal damage equal to 1098% of ATK plus 501."
      },
      {
        "name": "Rapid Fire Protocol",
        "description": "While on the ground, tap and hold normal attack when using the second to fourth normal attacks to trigger Rapid Fire Protocol and consume endurance. Launch an attack ahead, dealing damage equal to 90% of ATK plus 569 to nearby targets and suspending them."
      },
      {
        "name": "Energizing Protocol",
        "description": "While on the ground, tap and hold normal attack to trigger a charged attack. Fire a charged shot at the target, dealing damage equal to 90% of ATK plus 569 to nearby targets upon hit."
      },
      {
        "name": "Air Raid Protocol",
        "description": "While airborne, tap and hold normal attack when using the second to fourth normal attacks to trigger an aerial branch attack and consume endurance. Launch an attack ahead, dealing damage equal to 90% of ATK plus 569 to nearby targets and suspending them."
      },
      {
        "name": "Diving Protocol",
        "description": "Hold dodge while in mid-air to trigger Diving Protocol, dealing damage equal to 289% of ATK plus 1828 upon landing."
      },
      {
        "name": "Brilliant Colors",
        "description": "When in the overworld, on the ground, and in the non-combat state, hold dodge to place fireworks of a random style that explode after a short delay."
      }
    ],
    "dodges": [
      {
        "name": "Assault Protocol",
        "description": "Use normal attack during the short perfect dodge window (use a directional button before dodging) to trigger Assault Protocol. Summon a missile from space and deal damage equal to 203% of ATK plus 1284 to nearby targets. While Poppa is Here is active, after triggering Assault Protocol, tap and hold normal attack to continuously fire explosive shots."
      },
      {
        "name": "Propulsion Protocol",
        "description": "Use normal attack during the short period after dodging to trigger Propulsion Protocol. Fire a laser beam and deal damage equal to 154% of ATK plus 975 to nearby targets. While Poppa is Here is active, after triggering Assault Protocol, tap and hold normal attack to continuously fire explosive shots."
      },
      {
        "name": "Airborne Protocol",
        "description": "Dodge attacks can be used while the Wanderer is airborne. For every 2 dodge attacks using EP-7000 Skyfire, Poppa appears and uses a dodge attack as well, dealing damage equal to 50% to 100% of the Wanderer's damage dealt based on Poppa's mood. After every 2 dodge attacks using EP-7000 Skyfire or 1 dodge attack using EP-7000 Skyfire while Poppa is Here is in effect, reduce Mirror Image's cooldown by 10 seconds. Can only be triggered 1 time for each Mirror Image's cooldown."
      }
      
    ],
    "skills": [
      {
        "name": "Mirror Image",
        "description": "Roam between the mind and reality, creating 8 Heart Mirror Walls around the Wanderer (these count as summons) and deal damage equal to 807% of ATK plus 5094 to nearby targets. After using the skill, activate Poppa is Here for 15 seconds, gaining the ability to fly as well as improved movement speed and jumping capabilities. Normal attack now fires explosive shots that deal damage equal to 180% of ATK plus 1139 to nearby targets upon hit and consumes endurance. After an explosive shot hits the ground, it will be transmitted to a Heart Mirror Wall and fired toward the locked-on target. Cooldown: 30 seconds. After Poppa is Here naturally ends, immediately gain 300 weapon charge. During Poppa is Here, increase final damage according to the distance in height between the Wanderer and the target hit, by up to 1%. While in the combat state and Poppa is Here not active, Poppa will appear every 8 seconds and fire a Heavy Energy Round I dealing damage equal to 590% of ATK to nearby targets."
      }
    ],
    "discharges": [
      {
        "name": "Extermination Protocol",
        "description": "When weapon charge is full or Phantasia is triggered, remove debuffs from the Wanderer and activate the Satellite Ionic Beam upon switching to this weapon, summoning an ionic beam from the space station and dealing damage equal to 974% of ATK plus 6151 to nearby targets. At the same time, gain damage immunity for 1.5 seconds (unavailable in Apex League) and inflict Armor Dissolve on targets hit. After Extermination Protocol lands a hit, place up to 1 Mirror on both the locked-on target and the Wanderer for 45 seconds. Mirror (Target): The damage dealt by the Wanderer will be reflected by Mirrors to other targets nearby for an additional 15% damage. Mirror (Self): Ignore 15% of the target's Flame Resistance (each element's total resistance ignored cannot exceed 50%). Whenever damage is taken, bounce back 20% of the damage received (no more than 500% of the Wanderer's Max HP). This effect can be triggered up to 1 time every 3 seconds. During cooldown, after Poppa appears, she will admire her reflection in the mirror, reducing this effect's cooldown by 1 second."
      }
    ],
    "recommended_pairing": [
      {
        "title": "Ji Yu",
        "src": "/src/assets/images/jiyu.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/dual_flame_physical.jpg"
      },
      {
        "title": "Nora",
        "src": "/src/assets/images/nora.png",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/alteredelement.jpg"
      }
      
    ],
    "recommended_matrice": [
      {
        "title": "Plotti",
        "src": "/matrices/plotti_matrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Samir",
        "src": "/matrices/samirmatrice.jpg",
        "quantity": "X2"
      },
      {
        "title": "Scylla",
        "src": "/public/matrices/scyllamatrice.jpg",
        "quantity": "X2"
      }

    ]
  },
  {
    "id": 42,
    "src": "/background/yanuo_background.png",
    "alt": "Imagen 42",
    "title": "Yanuo",
    "weapon": "Yanuo",
    "weapon_effects": "When the weapon is fully charged, the next attack applies Force Impact on the enemy for 45 seconds, increasing their frost and volt damage taken by 10% (and an additional 15% in team play). Force Impact replaces the target's grievous status, and targets with Force Impact cannot become grievous. Frost attacks will freeze targets with Force Impact for 2 seconds, and volt attacks will remove the buffs on targets with Force Impact. This effect can only trigger 1 time every 15 seconds on the same target.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot. Cannot stack with other Frost Resonance or Frost Reaction effects, with Frost Resonance taking precedence",
    "secondary_elemental_resonance": "Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set effect works in the off-hand slot. Cannot stack with other Volt Resonance or Volt Reaction effects, with Volt Resonance taking precedence.",
    "weapon_passive": "When hitting any target with Wicked, deal damage equal to 205% of frost ATK plus 2.9% of Max HP plus 106% of the sum of all the Wanderer's resistance types plus 3.9% of crit to nearby targets. Can be triggered up to 1 time every 1.5 seconds. Chilling Strike damage counts as normal attack damage. If any 1 physical or flame weapon is equipped, Chilling Strike damage is multiplied by 1.3. In addition, Chilling Strike damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "aditional_effect": "",
    "advancements": {
      "1★": "1★ When dealing damage to targets below 80% HP, increase final damage by 12%. This effect works in the off-hand slot. Being attacked when in Concealment state will not break Concealment and the maximum number of attacks that can be blocked is increased to 3 times. After breaking Concealment by launching an attack, additionally gain a shield equal to Concealment duration multiplied by 5% of the Wanderer's Max HP (does not exceed 120% of the Wanderer's Max HP). Lasts for 30 seconds.",
      "3★": "3★ Increase Wicked's shatter by 20%. When Fevered Hunt is triggered, draw in nearby ice cores to the Wanderer's surroundings and detonate them, then enter Permeation for 5 seconds, during which Arctic Bite replaces the weapon-switching button (but this Arctic Bite does not trigger the additional skill effects) and each time it is used reduces Arctic Bite's cooldown by 20 seconds. Use normal attack to immediately exit Permeation.",
      "5★": "5★ Increase Ice Core Detonation damage by 150%. After Fixate tosses the weapon and hits a target, place Snow Trace on the target for 5 seconds (this effect's trigger is prioritized before the charged attack damage from Fixate). When Snow Trace fades, target takes damage equal to 30% of the total damage taken during Snow Trace (does not exceed Wanderer's ATK multiplied by 650 in solo mode, and Wanderer's ATK multiplied by 6500 while on a team). Damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects. Snow Trace can be triggered up to once every 30 seconds.",
      "6★": "6★ The frost-volt damage increase from Arctic Bite can be stacked up to 3 times."
    },
    "matrice_src": "/matrices/yanuo_matrice.jpg",
    "matrice_2p": "Increases physical attack and flame attack by 20%/25%/30%/35%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 physical weapon, all elemental damage is increased by 28%/32%/36%/42%. When equipped with Equilibrium, all elemental damage is additionally increased by 21%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "16.00",
    "charge": "12.00",
    "awaken": "Increase final damage by 18%. When equipped with Wicked, increase final damage by an additional 6%.",
    "release_date": "DECEMBER 19, 2023",
    "src_video": "https://www.youtube.com/embed/n6YZ4-oifZE?si=DL1UbMn7kPTtdOzW",
    "attacks": [
      {
        "name": "Pillage",
        "description": "While on the ground, use normal attack to launch 6 consecutive attacks (up to 45 ice cores may exist on the field at any given time). First Attack: Deal damage equal to 36% of ATK plus 227, and create 1 ice core. Second Attack: Deal damage equal to 46% of ATK plus 291, and create 2 ice cores. Third Attack: Deal damage equal to 280% of ATK plus 1768. Fourth Attack: Deal damage equal to 244% of ATK plus 1541, and create 1 ice core. Fifth Attack: Deal damage equal to 380% of ATK plus 2400, and create 3 ice cores. Sixth Attack: Deal damage equal to 315% of ATK plus 1989. Attack x6"
      },
      {
        "name": "Hunt",
        "description": "While airborne, use normal attack to launch 6 consecutive attacks in mid-air, consuming endurance. First Attack: Deal damage equal to 75% of ATK plus 474. Second Attack: Deal damage equal to 145% of ATK plus 916. Third Attack: Deal damage equal to 175% of ATK plus 1105. Fourth Attack: Deal damage equal to 153% of ATK plus 966. Fifth Attack: Deal damage equal to 238% of ATK plus 1503. Sixth Attack: Deal damage equal to 440% of ATK plus 2779."
      },
      {
        "name": "Frozen Spike ",
        "description": "While on the ground, tap and hold normal attack when using the second, fourth, and fifth normal attacks to trigger Frozen Spike, leaping backward to charge while in the air, up to 3 charges. Phase 1 charged hit: Deal damage equal to 182% of ATK plus 1149. Phase 2 charged hit: Deal damage equal to 320% of ATK plus 2021. Phase 3 charged hit: Deal damage equal to 455% of ATK plus 2874."
      },
      {
        "name": "Death From Above",
        "description": "While airborne, tap and hold normal attack to trigger Death From Above. Stab the ground with the lance upon landing, dealing damage equal to 120% of ATK plus 758 to nearby targets."
      },
      {
        "name": "Fixate",
        "description": "While on the ground, hold normal attack to trigger Fixate to charge. Within 6 seconds, damage increases depending on the charge duration, during which the Wanderer gains hyperbody, then the weapon is tossed in the target's direction. After the weapon lands a hit, deal damage up to 4480% of ATK plus 28295 to nearby targets. Aim assist is activated after aiming at a target within range for 2.5 seconds during Fixate's charging. The tossed weapon automatically hits the target in the head (losing the target with aim assist does not affect charging). After Fixate tosses the weapon, a new skill button for Shadow Execution becomes available."
      },
      {
        "name": "Boneshaver",
        "description": "While on the ground, tap and hold normal attack when aiming at the sky to trigger Boneshaver, during which the Wanderer gains hyperbody. Tosses the lance in the target direction, dealing damage equal to 160% of ATK plus 1011 to nearby targets and placing Force Impact on targets hit. Boneshaver does not trigger Shadow Execution after tossing the weapon."
      }
    ],
    "dodges": [
      {
        "name": "Concealment",
        "description": "While on the ground, tap and hold dodge to trigger Concealment for 60 seconds and become concealed (in solo mode, create an ice sculpture that attracts enemy attention for up to 15 seconds), increasing movement speed by 30%. While concealed, the Wanderer blocks damage equal to 50% of Max HP up to 1 time (this effect can only be triggered up to 1 time every 10 seconds). Concealment breaks when launching an attack and dealing damage with Wicked, being attacked, or swapping weapons. Hunting: When concealment breaks from launching an attack with Wicked and landing a hit, trigger Fevered Hunt. This resets Arctic Bite's cooldown and increases the Wanderer's final damage exponentially by 2.4% to 36% based on the Concealment duration. Receive maximum damage boost after 10 seconds of Concealment. Damage dealt using Fixate to trigger Hunting also benefits from the damage boost."
      },
      {
        "name": "Impending Chill",
        "description": "Use normal attack during the short perfect dodge window (use a directional button before dodging) to trigger Impending Chill, dealing damage equal to 30% of ATK plus 189 to targets ahead and creating 2 ice cores (up to 45 ice cores may exist on the field at any given time)."
      },
      {
        "name": "Death Aflutter",
        "description": "Use normal attack right after dodging backward to trigger Death Aflutter, leaping forward and dealing equal to 70% of ATK plus 442 to nearby targets upon landing. This also creates 1 ice core (up to 45 ice cores may exist on the field at any given time)."
      },
      {
        "name": "Unforeseen Doom",
        "description": "Tap normal attack at the moment the Wanderer enters concealment from holding dodge to quickly trigger Fixate, dealing damage equal to 160% of ATK plus 1011. After tossing the weapon, a new skill button for Shadow Execution becomes available."
      }
      
    ],
    "skills": [
      {
        "name": "Arctic Bite",
        "description": "Swing the lance to tear through space, during which the Wanderer gains hyperbody and a 2-second 80% damage reduction, dealing damage equal to 420% of ATK plus 2653 to nearby targets, and creating a tear to draw in nearby targets that lasts for 30 seconds. This also creates 6 ice cores (up to 45 ice cores may exist on the field at any given time). Cooldown: 60 seconds. After successfully using Arctic Bite, increase the Wanderer's frost and volt damage by 9%, and the Wanderer ignores 15% of the target's frost and volt resistance, lasting for 60 seconds (each element's total resistance ignored cannot exceed 50%)."
      },
      {
        "name": "Frigid Blast",
        "description": "When Fixate tosses the weapon through the tear, the cold air explodes, dealing damage equal to 330% of ATK plus 2084 to enemies near the tear, strongly freezing them for 5 seconds (triggers up to once every 30 seconds, does not work on bosses). Additionally, it draws in and detonates all the nearby ice cores, and places Force Impact on the targets. Ice Core Detonation: Each ice core deals damage equal to 80% of ATK to nearby targets, and the shatter from each ice core is calculated independently."
      },
      {
        "name": "Shadow Execution",
        "description": "Move to the weapon's location and strike swiftly (if the thrown weapon has previously hit a target, then move in front of that target), dealing damage equal to 99% of ATK plus 625 to nearby targets (does not trigger the skill's additional effect). When Shadow Execution hits a target, triggers Phantasia if it's not on cooldown."
      }
    ],
    "discharges": [
      {
        "name": "Deadly Euphoria",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer. Yanuo stabs the lance into the ground, dealing damage equal to 368% of ATK plus 2324 to the targets in the area ahead and creating 6 ice cores (up to 45 ice cores may exist in battle at any given time). During this period, gain damage immunity for 1.5 seconds (unavailable in Apex League)."
      }
    ],
    "recommended_pairing": [
      {
        "title": "Nan Yin",
        "src": "/src/assets/images/nanyin.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/alteredelement.jpg"
      },
      {
        "title": "Loslyn",
        "src": "/src/assets/images/loslyn.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/dual_frost_volt.jpg"
      }
      
    ],
    "recommended_matrice": [
      {
        "title": "Yanuo",
        "src": "/matrices/yanuo_matrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Haboela",
        "src": "/matrices/habramatrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Scylla",
        "src": "/public/matrices/scyllamatrice.jpg",
        "quantity": "X4"
      }

    ]
  },
  {
    "id": 43,
    "src": "/background/asuka_background.png",
    "alt": "Imagen 43",
    "title": "Asuka",
    "weapon": "Asuka",
    "weapon_effects": "When the weapon is fully charged, the next attack inflicts Armor Dissolve on the target for 45 seconds, increasing their flame and physical damage taken by 10% (and an additional 15% in team play). This effect will replace the grievous status on the target, and targets with this effect cannot become grievous. Physical attacks will stun targets under the dissolve effect for 2 seconds, and flame attacks will decrease the targets' speed by 50% for 5 seconds. This effect can only trigger 1 time every 15 seconds on the same target.",
    "element_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical weapons. This set effect works in the off-hand slot. Cannot stack with other Physical Resonance or Physical Reaction effects, with Physical Resonance taking precedence.",
    "secondary_elemental_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect works in the off-hand slot. Cannot stack with other Flame Resonance or Flame Reaction effects, with Flame Resonance taking precedence.",
    "weapon_passive": "When Spear of Longinus is equipped, any weapon's discharge skill will deal damage equal to 58.58% of physical ATK plus 0.78% of Max HP plus 29.29% of the sum of all the Wanderer's resistance types plus 107.4% of crit to nearby targets. While in combat, after every 0.5 seconds, the next Swift Cut damage will be increased by an additional 1 time, up to a maximum of 30 times. When multiple Swift Cut damages exist, the highest initial value is used for calculation. Swift Cut damage is counted as discharge skill damage. If there is 1 frost/volt weapon of any kind equipped, Reverent Spear damage is increased to 1.3 times. In addition, Reverent Spear damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "aditional_effect": "",
    "advancements": {
      "1★": "1★ Increase maximum Vengeance stacks from 10 to 15. After all stacks are consumed, additionally trigger an enormous Spear of Longinus. If the current weapon's element is physical or flame, deal the weapon's elemental damage equal to 2000% of ATK to nearby targets.",
      "3★": "3★ While the Wanderer has an A.T. Field active, attacks can ignore a certain percentage of the damage reduction from a target's shield. This percentage is equal to 30% of the current A.T. Field's durability percentage plus 20%. When Fortitude Resonance is active, increase the Wanderer's shatter at a rate equal to 100% of the A.T. Field's durability percentage.",
      "5★": "5★ For every 1 stack of Vengeance consumed, regenerate 6% of A.T. Field's maximum durability.",
      "6★": "6★ Increase the physical damage boost granted while A.T. Field is active to 36% and the flame damage boost to 24%. When Fortitude Resonance is activated, while A.T. Field is active, nearby teammates ignore15% of their targets' shield's damage reduction. Also, reduce nearby targets' all resistance by 1200%. This effect cannot be stacked."
    },
    "matrice_src": "/matrices/asuka_matrice.jpg",
    "matrice_2p": "Increases physical attack and flame attack by 20%/25%/30%/35%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 physical weapon, all elemental damage is increased by 28%/32%/36%/42%. When equipped with Equilibrium, all elemental damage is additionally increased by 21%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "10.00",
    "awaken": "Increase final damage by 18%. When Fortitude Resonance is activated, the A.T. Field durability is set to at least 30% of its maximum value.",
    "release_date": "DECEMBER 19, 2023",
    "src_video": "https://www.youtube.com/embed/n6YZ4-oifZE?si=DL1UbMn7kPTtdOzW",
    "attacks": [
      {
        "name": "Brandishing Spear: Forming Shadow",
        "description": "While on the ground, use normal attack to launch 5 consecutive attacks. First Attack: Deal damage equal to 163% of ATK plus 1029 and knock the target back. Second Attack: Deal damage equal to 190% of ATK plus 1200 and knock the target back. Third Attack: Deal damage equal to 315% of ATK plus 1989 and knock the target back. Fourth Attack: Deal damage up to 315% of ATK plus 1989 and knock the target back. Fifth Attack: Deal damage equal to 344% of ATK plus 2173 and launch the target."
      },
      {
        "name": "Thrusting Spear: Blinking Shadow",
        "description": "While airborne, use normal attack to attack 5 times in a row in mid-air, consuming endurance. First Attack: Deal damage equal to 154% of ATK plus 973. Second Attack: Deal damage equal to 181% of ATK plus 1143. Third Attack: Deal damage equal to 299% of ATK plus 1888. Fourth Attack: Deal damage equal to 300% of ATK plus 1895. Fifth Attack: Deal damage equal to 326% of ATK plus 2059 and launch the target."
      },
      {
        "name": "Reverent Spear: Raging Wave",
        "description": "While using normal attack on the ground, tap and hold normal attack when using the first to fourth normal attacks to trigger Reverent Spear: Raging Wave. Continuously attack multiple times, dealing damage equal to 586% of ATK plus 3701 to nearby targets."
      },
      {
        "name": "Charging Spear: Assassinate",
        "description": "Tap and hold normal attack while airborne (tap when a target is available), or use normal attack while climbing, jumping backward, or using the Jetpack to trigger Charging Spear: Assassinate. Dive down from above, dealing damage equal to 293% of ATK plus 1851 to nearby targets upon reaching the ground."
      }
    ],
    "dodges": [
      {
        "name": "Extending Spear: Plunder",
        "description": "Use normal attack during the short perfect dodge window (use a directional button before dodging) to trigger Extending Spear: Plunder, dealing damage up to 246% of ATK plus 1554 to targets ahead."
      },
      {
        "name": "Leaping Slam",
        "description": "Use normal attack during the short period after dodging to trigger Leaping Slam, dealing damage up to 246% of ATK plus 1554 damage to targets ahead."
      }
      
    ],
    "skills": [
      {
        "name": "Cloud-Piercer",
        "description": "Throw the weapon toward the target and draw in nearby targets, dealing damage equal to 1604% of ATK plus 10131, then briefly immobilize nearby targets. Cooldown: 20 seconds. This is not affected by other cooldown clearing, resetting, or changing effects. After successfully using this skill, gain 10 stacks of Vengeance. Dealing damage to an enemy will consume 1 Vengeance stack. If the equipped weapon's type is physical or flame, deal additional damage of the weapon's type equal to 600% of ATK to nearby targets. This effect can trigger up to 1 time per second. Additionally, after successfully using this skill, generate an A.T. Field with durability equal to 50% of Max HP for 30 seconds. During this time, increase the Wanderer's physical damage by 18% and flame damage by 12%, and gain hyperbody. When the Wanderer receives damage, the A.T. Field will reduce damage based on its remaining durability percentage and deduct its durability based on the damage dealt (down to a minimum of 10% durability). While Fortitude Resonance is active, if the Wanderer receives damage while having Vengeance stacks, consume 1 Vengeance stack and block damage equal to 8% of Max HP. This effect can trigger up to 1 time every 0.5 seconds."
      }
    ],
    "discharges": [
      {
        "name": "Weapons Lift-Off",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer and pilot EVA-02 to execute a flying kick, dealing damage equal to 1755% of ATK plus 11084 to nearby targets. During this period, gain damage immunity for 1.5 seconds (unavailable in Apex League)."
      }
    ],
    "recommended_pairing": [
      {
        "title": "Anka",
        "src": "/src/assets/images/anka.jpg",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/zekedual.jpg"
      },
      {
        "title": "Nora",
        "src": "/src/assets/images/nora.png",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/alteredelement.jpg"
      }
      
    ],
    "recommended_matrice": [
      {
        "title": "Asuka",
        "src": "/matrices/asuka_matrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Haboela",
        "src": "/matrices/habramatrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Scylla",
        "src": "/public/matrices/scyllamatrice.jpg",
        "quantity": "X4"
      }

    ]
  },
  {
    "id": 44,
    "src": "/background/rei_background.png",
    "alt": "Imagen 44",
    "title": "Ayanami Rei",
    "weapon": "Ayanami Rei",
    "weapon_effects": "When the weapon is fully charged, the next attack applies Force Impact on the enemy for 45 seconds, increasing their frost and volt damage taken by 10% (and an additional 15% in team play). Force Impact replaces the target's grievous status, and targets with Force Impact cannot become grievous. Frost attacks will freeze targets with Force Impact for 2 seconds, and volt attacks will remove the buffs on targets with Force Impact. This effect can only trigger 1 time every 15 seconds on the same target.",
    "element_resonance": "Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set effect works in the off-hand slot. Cannot stack with other Volt Resonance or Volt Reaction effects, with Volt Resonance taking precedence.",
    "secondary_elemental_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot. Cannot stack with other Frost Resonance or Frost Reaction effects, with Frost Resonance taking precedence.",
    "weapon_passive": "After using Mecha Strike, deal damage equal to 109.4% of volt ATK plus 15.6% of Max HP plus 56.3% of the sum of all the Wanderer's resistance types plus 210.9% of crit to targets hit every second for 30 seconds. Multiple Detachment damage will not stack and Flash damage counts as skill damage. If any 1 physical or flame weapon is equipped, Flash damage is increased to 1.3 times. In addition, Flash damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "aditional_effect": "When using any weapon to deal damage, fire 1 Homing Arrow toward the targets, dealing damage equal to 120% of ATK to the first target hit. At the same time, receive 4 special energy. The Homing Arrow will remain on the target and apply Overload for 30 seconds. When the number of Homing Arrows on a target reaches 3, the arrows will detonate, dealing damage equal to 360% of ATK to nearby targets. Homing Arrow can trigger up to 1 time every 0.5 seconds",
    "advancements": {
      "1★": "1★ When Salvation is in the off-hand slot, increase Homing Arrow's detonation damage by 100%.",
      "3★": "3★ Increase the volt damage dealt to targets with Homing Arrow: Overloaded by 10% and frost damage by 10%. This effect works in the off-hand slot.",
      "5★": "5★ After using Mecha Strike, gain an additional 25 special energy.",
      "6★": "6★ After entering Energy Consumption, increase the Wanderer's volt damage by 16% and frost damage by 10% for 20 seconds."
    },
    "matrice_src": "/matrices/rei_matrice.jpg",
    "matrice_2p": "Increases physical attack and flame attack by 20%/25%/30%/35%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 physical weapon, all elemental damage is increased by 28%/32%/36%/42%. When equipped with Equilibrium, all elemental damage is additionally increased by 21%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "14.00",
    "awaken": "Increase final damage by 18%. When Attack Resonance is activated, increase volt damage by 8%. When any Resonance type other than Attack Resonance is activated, increase Charged Shots' block effect to 12% of the Wanderer's Max HP, and increase Rapid Bow's and Aerial Assault's slowing magnetic field duration to 4 seconds.",
    "release_date": "DECEMBER 19, 2023",
    "src_video": "https://www.youtube.com/embed/I4NQ8w6y_XQ?si=G-PZ6X7D8sp11ddf",
    "attacks": [
      {
        "name": "Rapid Bow",
        "description": "While on the ground, use normal attack to launch 6 consecutive attacks. First Attack: Deal damage equal to 85% of ATK plus 537 and knock the target back a short distance. Second Attack: Deal damage equal to 117% of ATK plus 739 and knock the target back a short distance. Third Attack: Deal damage equal to 139% of ATK plus 878 and knock the target back a short distance. Fourth Attack: Deal damage up to 128% of ATK plus 808 and knock the target back a short distance. After the fifth attack, when a flashing light appears, tap to trigger the sixth attack. Sixth Attack: Fire a powerful energy arrow and release Homing Arrows that deal damage equal to 311% of ATK plus 1964 to targets and apply a slowing magnetic field at the location of the first target hit for 3 seconds. Enemies within the area have their movement and attack speed reduced by 35%."
      },
      {
        "name": "Aerial Assault",
        "description": "While airborne, use normal attack to launch 6 consecutive attacks in mid-air, consuming endurance. First Attack: Deal damage equal to 85% of ATK plus 537. Second Attack: Deal damage equal to 117% of ATK plus 739. Third Attack: Deal damage equal to 139% of ATK plus 878. Fourth Attack: Deal damage up to 128% of ATK plus 808. Fifth Attack: Deal damage equal to 267% of ATK plus 1686. After the fifth attack, when a flashing light appears, tap to trigger the sixth attack. Sixth Attack: Fire a powerful energy arrow and release 5 Homing Arrows that deal damage equal to 311% of ATK plus 1964 to targets and apply a slowing magnetic field at the location of the first target hit. Enemies within the area have their movement and attack speed reduced by 40% for 3 seconds."
      },
      {
        "name": "Backjump Arrow",
        "description": "When using normal attack on the ground or in mid-air, while using the first to fifth normal attacks, tap and hold normal attack to trigger Backjump Arrow. Fire a shot ahead while jumping backward, dealing damage equal to 272% of ATK plus 1718 to the target hit. If special energy is greater than 70 at that time, trigger Energy Consumption: Increase volt ATK by 15% and frost ATK by 5%. While Salvation is in the main slot, consume 5 special energy every 0.5 seconds. Increase Salvation's damage dealt by 30%. Continuously tap or tap and hold normal attack to trigger Dodging Rapidfire. While Salvation is in the off-hand slot, consume 3.3 special energy every 0.5 seconds. Increase Homing Arrow's damage by 50% and increase its detonation radius. The maximum amount of special energy is 100. When this amount is reached, switching Salvation from the main slot to the off-hand slot will immediately cause the Wanderer to enter Energy Consumption."
      },
      {
        "name": "Dodging Rapidfire",
        "description": "While in Energy Consumption, use normal attack to attack 3 times in a row. First Attack: Deal damage equal to 920% of ATK plus 5811. Second Attack: Deal damage equal to 880% of ATK plus 5558. Third Attack: Deal damage equal to 1200% of ATK plus 7579."
      },
      {
        "name": "Precision Shot",
        "description": "Tap and hold normal attack to charge an attack. Deal damage equal to 32% of ATK plus 202. For every 0.1 seconds spent charging, the damage increases by 100%, reaching maximum damage after 2.3 seconds of charging.",
        "use": "Hold Attack"
      }
    ],
    "dodges": [
      {
        "name": "Triple Shot",
        "description": "Use normal attack during the short period after dodging to trigger Triple Shot, dealing damage equal to 36% of ATK plus 227 to the first target hit."
      },
      {
        "name": "Charged Shots",
        "description": "After dodging, tap normal attack at the appropriate time to trigger Charged Shots, firing out powerful energy arrows that deal damage equal to 129% of ATK plus 815 to targets. At the same time, fire Homing Arrows. The Wanderer receives 1 Blocking Barrier for 15 seconds, which blocks damage that does not exceed 10% of the Wanderer's Max HP. The Wanderer can only have up to 3 Blocking Barriers simultaneously."
      }
      
    ],
    "skills": [
      {
        "name": "Mecha Strike",
        "description": "Summon a mecha to pummel enemies, dealing damage equal to 1008% of ATK plus 6366 to nearby targets. During this time, the Wanderer gains hyperbody and receives 35 special energy. Cooldown: 20 seconds. This is not affected by other cooldown clearing, resetting, or changing effects."
      }
    ],
    "discharges": [
      {
        "name": "Defense Field",
        "description": "When weapon charge is full or Phantasia is triggered, upon switching to this weapon, remove all debuffs from the Wanderer. Summon a mecha and use its shield to smash the ground, with the resulting shockwave dealing damage equal to 1337% of ATK plus 8444 to nearby targets. Also, gain 30 special energy. During this period, gain damage immunity for 1.5 seconds (unavailable in Apex League)."
      }
    ],
    "recommended_pairing": [
      {
        "title": "Mimi",
        "src": "/src/assets/images/mimi1.jpg",
        "miniImage1": "/src/assets/mini-images/tank.jpg",
        "miniImage2": "/src/assets/mini-images/voltelement.jpg"
      },
      {
        "title": "Nora",
        "src": "/src/assets/images/nora.png",
        "miniImage1": "/src/assets/mini-images/dps.jpg",
        "miniImage2": "/src/assets/mini-images/alteredelement.jpg"
      }
      
    ],
    "recommended_matrice": [
      {
        "title": "Ayanami Rei",
        "src": "/matrices/rei_matrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Haboela",
        "src": "/matrices/habramatrice.jpg",
        "quantity": "X4"
      },
      {
        "title": "Scylla",
        "src": "/public/matrices/scyllamatrice.jpg",
        "quantity": "X4"
      }

    ]
  }
  
]