[{
    "id": 1,
    "src": "/background/yanmiaobackground.jpg",
    "alt": "Imagen 1",
    "title": "Yan Miao",
    "weapon": "Yan Miao",
    "weapon_effects": "When the weapon is fully charged, the next attack will apply an armor melt effect to enemies for 45 seconds, increasing the physical and flame damage they take by 10%, and in team play this value is additionally increased by 15% [armor melt replaces the grievous effect on the target and does not allow grievous to get applied again for the duration of armor melt). Every 15 seconds, a target affected by armor melt will be stunned for 2 seconds when taking physical damage and slowed by 50% for 5 seconds when taking flame damage.",
    "element_resonance": "Increase Physical ATK by 15% and Physical Resistance by 25%. Activate by equipping 2 or more Physical weapons. This set effect works in the off-hand slot. Cannot stack with other Physical Resonance effects, with Physical Resonance taking precedence.",
    "weapon_passive": "When landing any hit with Equilibrium, it deals damage to nearby targets equal to 2,250% of physical ATK plus 38% of the Wanderer's Max HP plus 1.350% of the sum of all the Wanderer's resistance types plus 4,500% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Flying Blade damage is counted as normal attack damage. If there is 1 frost/volt weapon of any kind equipped, Flying Blade damage is multiplied by 2.5 times. In addition, Flying Blade damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "1★ The number of Flaming Daggers received from Empyrean Rotation is increased to 4, and the maximum Frequency of Flaming Dagger use is reduced to once every 1.8 seconds.",
        "3★": "3★ Wanderer ignores 30% of the target's physical and flame resistances [the total value of ignoring resistance to a particular element cannot exceed 50%).",
        "5★": "5★ When Flaming Dagger is triggered, wanderer gains a shield equal to 30% of Max HP for 20 seconds. The shields gained cannot exceed 30% of Max HP [shields that exceed this value will be converted into healing at the rate of 50% of the shield].",
        "6★": "6★ Flaming Daggers damage is increased to 8,800% and the Final damage buff after a Flaming Dagger is triggered is further increased by 16%."
    },
    "matrice_src": "/matrices/yanmiaomatrice.jpg" ,
    "matrice_2p": "Increases physical attack and flame attack by 20%/25%/30%/35%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 physical weapon, all elemental damage is increased by 28%/32%/36%/42%. When equipped with Equilibrium, all elemental damage is additionally increased by 21%. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "16.00",
    "charge": "12.00"
},
{
    "id": 2,
    "src": "/background/nanyinbackground.jpg",
    "alt": "Imagen 2",
    "title": "Nan Yin",
    "weapon": "Nan Yin",
    "weapon_effects": "Influence: after switching the weapon to Black Bamboo, Black Bamboo's damage element type will be changed to the element type of the previous active weapon.Temporary Dwelling: any unlocked wanderer's weapon can be enhanced with Darkness in the settings of a specific weapon.Darkness-enhanced weapons deals 4% more damage.When not spreading to other weapons, Darkness resides in Black Bamboo, increasing all wanderer's damage dealt by 9% when Black Bamboo is the current active weapon.",
    "element_resonance": "Last Knock: Increase ATK by 30%. Activate by equipping 3 altered weapons. This set effect works in the off-hand slot.",
    "weapon_passive": "When landing any hit with Equilibrium, it deals damage to nearby targets equal to 2,250% of physical ATK plus 38% of the Wanderer's Max HP plus 1.350% of the sum of all the Wanderer's resistance types plus 4,500% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Flying Blade damage is counted as normal attack damage. If there is 1 frost/volt weapon of any kind equipped, Flying Blade damage is multiplied by 2.5 times. In addition, Flying Blade damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "1★ Darkness damage buff is further increased by 1% for every 1 advancement level of Darkness-enhanced weapon. Hyperspace damage's base multiplier is increased to 0.06% of total wanderer damage in Hyperspace (not including Shadow damage) plus 4,000% of ATK.",
        
        "3★": "3★ Shadow inherits an additional 50% of the wanderer's ATK. If the wanderer is not in Trance state, when the wanderer takes lethal damage, the Shadow disappears and the wanderer becomes invulnerable for a short period of time. This effect triggers once every 60 seconds, with other similar effects triggering first and works in the off-hand slot.",
       
        "5★": "5★ In Hyperspace, you ignore 20% of target's elemental resistance. The limit of created Abyss Flows is increased to 3",
        "6★": "6★ Hyperspace damage's base multiplier is increased to 0.12% of total wanderer damage in Hyperspace [not including Shadow damage] plus 4,000% of ATK."
    },
    "matrice_src": "/matrices/nanyinmatrice.jpg",
    "matrice_2p": "Increases all attack types by 20%/24%/28%/32%. Shadow inherits an additional 30% of the wanderer's ATK. The first time you deal damage in combat, 1,000 weapon charge is granted. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "After equipping Purple Bamboo, increase crit damage by 22% and final damage by 28%/32%/36%/42%. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "12.00"
},
{
    "id": 3,
    "src": "/background/linghanbackground.jpg",
    "alt": "Imagen 3",
    "title": "Ling Han",
    "weapon": "Alabaster Tiger",
    "weapon_effects": "Extreme Cold: Unload: After using Sword Art: Shadowy Ice, every second, deal damage equal to 70% of frost ATK plus 10% of the Wanderer's Max HP plus 36% of the sum of all the Wanderer's resistance types plus 135% of crit for 30 seconds. Multiple Unload damage will not stack and Extreme Cold damage will be counted as skill damage. If there is 1 volt/flame/physical weapon of any kind equipped, Extreme Cold damage is multiplied by 1.3 times. In addition, Extreme Cold damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "element_resonance": "Frost Resonance: Increase Frost ATK by 15% and Frost Resistance by 25%. Activate by equipping 2 or more Frost weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "When landing any hit with Equilibrium, it deals damage to nearby targets equal to 2,250% of physical ATK plus 38% of the Wanderer's Max HP plus 1.350% of the sum of all the Wanderer's resistance types plus 4,500% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Flying Blade damage is counted as normal attack damage. If there is 1 frost/volt weapon of any kind equipped, Flying Blade damage is multiplied by 2.5 times. In addition, Flying Blade damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "1★ After launching Frost Blades, the Wanderer's frost ATK is increased by 10% and nearby targets will be dealt damage equal to 80% of ATK every second for 30 seconds.",
        "3★": "3★ The Wanderer can produce up to 4 Frost Blades and Temperature Reduction's damage's base multiplier is increased to 360%. If the target is the only one affected by Temperature Reduction within 6 seconds, additionally apply Vein Seal to the target, reducing their speed by 30% (unavailable in Apex League and against bosses). If the target receives Frost Blade damage again during Vein Seal's duration, trigger Icy Burst, dealing skill damage equal to 1,700% of ATK plus 2% of the target's HP lost at that point (Icy Burst damage will be no lower than 2,000% of the Wanderer's frost ATK and no higher than 2,200% of the Wanderer's frost ATK). Then, remove the Vein Seal and Temperature Reduction effects on the target.",
        "5★": "5★ The damage dealt by Crystalline Crack and Cold Air is additionally increased by 50%. Light Steps' use attempts is increased to 10 and recovery rate is increased to 1 attempt every 3 seconds.",
        "6★": "6★ The Temperature Reduction effect inflicted after firing Frost Blades is now applied to an area and also deals additional damage equal to 990% of ATK to nearby targets."
    },
    "matrice_src": "/matrices/linghanmatrice.jpg",
    "matrice_2p": "After using any flame weapon skill or discharge skill, increase all ATK by 18%/22%/26%/30% for 30 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect",
    "matrice_4p": "When equipped with at least 1 flame weapon, increase all elemental damage by 28%/32%/36%/40%. When generating a Colorful Illusion, increase final damage by an additional 20% for 25 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "16.00",
    "charge": "8.00"
},
{
    "id": 4,
    "src": "/background/feisebackground.jpg",
    "alt": "Imagen 4",
    "title": "Feise",
    "weapon": "Endless Bloom",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. Effect does not stack with Flame Resonance.",
    "weapon_passive": "When Endless Bloom is equipped, upon landing a hit with any weapon's discharge skill, deal initial damage equal to 37.5% of flame ATK plus 0.5% of the Wanderer's Max HP plus 18.75% of the sum of all the Wanderer's resistance types plus 68.75% of crit to nearby targets. While in combat, after every 0.5 seconds, the next Swift Cut damage will be increased by an additional 1 time, up to a maximum of 30 times. When multiple Swift Cut damages exist, the highest initial value is used for calculation. FieryExplosion: Swift Cut damage is counted as discharge skill damage. If there is 1 frost/volt/ physical weapon of any kind equipped, Fiery Explosion damage is increased to 1.3 times. In addition, Fiery Explosion damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "1★ Blazing Heart's damage's base multiplier is increased to 60% of ATK. While in the combat state, if the Wanderer inflicts multiple burn effects, Blazing Heart's damage's base multiplier is additionally increased to that of the highest multiplier effect.",
        "3★": "3★ The maximum number of Feist's Phantasia is increased to 2. After Whirling lands a hit, additionally create 1 FeiSe's Phantasia.",
        "5★": "5★ For every 1 FeiSe's Phantasia or Lotus Petal in the Mirage, Blazing Heart's damage is additionally increased by 12%. Lotus Asparagus endurance consumption is reduced by 75%.",
        "6★": "6★ Soulwear damage's base multiplier is increased to 270% of ATK, shatter is doubled, and after landing a hit, there is a 15% chance to inflict a 65% delay for 2 seconds (ineffective against bosses in team play and unavailable in Apex League)."
    },
    "matrice_src": "/matrices/feisematrice.jpg",
    "matrice_2p": "After using any flame weapon skill or discharge, increase all attack by 14%/16%/18%/20% for 30 seconds. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 flame weapon, increase all elemental damage by 14%/17%/20%/23%. After creating FeiSe's Phantasia, increase Final damage by 9% for 25 seconds. This set effect works in the off-hand slot. Only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "12.00"
},
{
    "id": 5,
    "src": "/background/mimibackground.jpg",
    "alt": "Imagen 5",
    "title": "Mimi",
    "weapon": "Meng Zhang",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase Volt ATK by 15% and Volt Resistance by 25%. Activate by equipping 2 or more Volt weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "When landing any hit with Azure Dragon, it deals damage to nearby targets equal to 131.3% of volt ATK plus 1.9% of the Wanderer's Max HP plus 68.8% of the sum of all the Wanderer's resistance types plus 250% of crit. This effect can be triggered up to 1 time every 1.5 seconds. The Thunder boom damage is counted as normal attack damage. If there is 1 flame/frost/physical weapon of any kind equipped, Thunder boom damage is multiplied by 1.3 times. Additionally, Thunder boom damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "1★ Each time after Thunder Burst charges, 2 Azuras will appear. Each Azura will restore 20% Max HP to other summons. Increase Thunder Burst's charged attack and shockwave damage by 30%. After using Azure Moon, immediately gain 3 stacks of Qinglong's Might. Using other volt weapons' skills will grant 1 stack of Qinglong's Might instead.",
        "3★": "3★ When Azure Dragon is equipped, reduce all volt weapon base skill cooldowns by 20%. This is not affected by other cooldown clearing, resetting, or changing effects. Additionally, increase the Wanderer's volt damage by 15%. This effect works in the off-hand slot.",
        "5★": "5★ When the Wanderer receives lethal damage, prevent lethal damage 1 time and gain damage immunity for a short duration. This effect can only trigger 1 time every 60 seconds and works in the off-hand slot. After activating Fortitude Resonance: Using Soaring Dragon draws in nearby targets, ignoring hyperbody (ineffective against bosses). In team play, Thunder Burst will produce 1 volt timestamp every 6 seconds while charging, which will link up in the order they are produced to form a power grid. The power grid can block enemies' movements and their projectile damage. Each volt timestamp lasts for up to 20 seconds.",
        "6★": "6★ After using Azure Moon, increase the Wanderer's volt damage by 10% and final damage by 10% for 30 seconds."
    },
    "matrice_src": "/matrices/mimimatrice.jpg",
    "matrice_2p": "Increase final damage by 7%/8%/9%/10%. After Azura's shockwave lands a hit, increase skill damage by 15% for 30 seconds. This set effect works in the off- hand slot, and only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 volt weapon, increase all elemental damage by 14%/17%/20%/23%. After using Azure Moon / Soaring Dragon, increase crit damage by 6% for 30 seconds. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "15.00"
},
{
    "id": 6,
    "src": "/background/zekebackground.jpg",
    "alt": "Imagen 6",
    "title": "Zeke",
    "weapon": "Onyx Tortoise",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage. Onyx Tortoise is a physical weapon and will always deal physical damage, but it can also take the place of a flame weapon to activate Flame Resonance.",
    "element_resonance": "Increase Physical ATK by 15% and Physical Resistance by 25%. Activate by equipping 2 or more Physical weapons. This set effect works in the off-hand slot. Cannot stack with other Physical Resonance effects, with Physical Resonance taking precedence. Increase Flame ATK by 15% and Physical Resistance by 25%. Activate by equipping 2 or more Flame weapons. This set effect works in the off-hand slot. Cannot stack with other Flame Resonance effects, with Flame Resonance taking precedence.",
    "weapon_passive": "After using Absolute Ravine, every second, deal damage equal to 70% of physical ATK plus 1% of the Wanderer's Max HP plus 36% of the sum of all the Wanderer's resistance types plus 135% of crit for 30 seconds to targets hit. Multiple Detachment damage will not stack and shield break damage will be counted as skill damage. If there is 1 volt/flame/frost weapon equipped, shield break damage is multiplied by 1.3. In addition, shield break damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "1★ Every time grievous is applied, deal devouring damage equal to 50% of ATK to the target. This effect can only be triggered 1 time every 0.5 seconds. Every time the weapon's ignite trait is applied to a non-grievous target, the target becomes grievous for 7 seconds.",
        "3★": "3★ After triggering Mighty Wind, turn targets hit into members of the Serpent Chain.",
        "5★": "5★ After using Absolute Ravine, reduce the Wanderer's damage taken by 10% (20% in solo play) for 30 seconds.",
        "6★": "6★ When there is 1 Serpent Chain member, increase conduction damage's conduction rate by 50%."
    },
    "matrice_src": "/matrices/zekematrice.jpg",
    "matrice_2p": "Increase Serpent Chain member limit to 5. When at least 1 physical or flame weapon is equipped, increase physical ATK and flame ATK by 14%/16%/18%/20%. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "matrice_4p": "After applying the snake bite effect, increase physical ATK and flame ATK by 9% for 30 seconds. While in the combat state, increase final damage by 14%/17%/20%/23%. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "12.00"
},
{
    "id": 7,
    "src": "/background/yulanbackground.jpg",
    "alt": "Imagen 7",
    "title": "Yulan",
    "weapon": "Unity",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "When Unity is equipped, upon landing a hit with any weapon's discharge skill, deal initial damage to nearby targets equal to 30% of frost ATK plus 0.4% of the Wanderer's Max HP plus 15% of the sum of all the Wanderer's resistance types plus 55% of crit. While in combat state, after every 0.5 seconds, the next Swift Cut damage will be increased by an additional 1 time, up to a maximum of 30 times. When multiple Swift Cut damages exist, the highest initial value is used for calculation. Swift Cut damage is counted as discharge skill damage. If there is 1 volt/ physical/flame weapon of any kind equipped, Icecrush damage is increased 1.3 times. In addition, Icecrush damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "1★ While in the Martial Artist form, after consuming 3 or more Internal Strength, Unity restores 1 Internal Strength. Subsequently, the Wanderer's final damage is increased by 5%, and Unity's dodge attack/normal attack damage is increased by 50% for 30 seconds. While in the Sweeping Force form, after consuming 3 or more Fighting Spirit, Unity restores 1 Fighting Spirit. Subsequently, the Wanderer's final damage is increased by 5% for 15 seconds.",
        "3★": "3★ In the Martial Artist form, if Internal Strength is not obtained within 5 seconds, the next acquisition of Internal Strength will grant 2 counts. In any form, when Unity consumes 3 or more Internal Strength or Fighting Spirit, restore 10% of the Wanderer's Max HP. In solo play, the HP recovery is increased to 20%. This effect can only trigger 1 time every 8 seconds in Sweeping Force form. In Martial Artist form, there are no limitations.",
        "5★": "5★ After Unity consumes Internal Strength or Fighting Spirit, when receiving lethal damage, prevent lethal damage 1 time and recover 20% of the Wanderer's Max HP (Unavailable in Apex League). In solo play, the HP recovery is increased to 40%. Both effects can only trigger 1 time every 60 seconds.",
        "6★": "6★ While in the Martial Artist form, Unity's dodge attack/normal attack damage is further increased by 70%. After consuming Internal Strength, the Wanderer's final damage is increased by 10% for 30 seconds. While in the Sweeping Force form, after Unity consumes Fighting Spirit, the Wanderer's final damage is increased by 15% for 30 seconds."
    },
    "matrice_src": "/matrices/yulanmatrice.jpg",
    "matrice_2p": "When equipped with at least 1 frost weapon, while in the combat state, deal damage equal to 85% of ATK to nearby targets every second. After using any frost weapon skill or discharge skill, increase final damage by 7%/8%/9%/10% for 30 seconds. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "matrice_4p": "After Unity consumes Internal Strength or Fighting Spirit, increase final damage by 6% for 15 seconds. After dealing frost damage, increase all elemental damage by 12%/15%/19%/23% for 30 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "13.00",
    "charge": "11.00"
},
{
    "id": 8,
    "src": "/background/lihuobackground.jpg",
    "alt": "Imagen 8",
    "title": "Lihuo",
    "weapon": "Pine Comet",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. Effect does not stack with Flame Resonance.",
    "weapon_passive": "When landing any hit with Pine Comet, it deals damage to nearby targets equal to 105% of flame ATK plus 1.5% of the Wanderer's Max HP plus 55% of the sum of all the Wanderer's resistance types plus 200% of crit. This effect can be triggered once every 1.5 seconds. The Fiery Explosion damage is counted as normal attack damage. If there is 1 volt/frost/physical weapon of any kind equipped, Fiery Explosion damage is multiplied by 1.3 times. In addition, Fiery Explosion damage is not affected by any damage boost effects except from titan equipment's rare stats, and won't trigger additional attack effects.",
    "advancements": {
        "1★": "1★ When a sparrowfeather hits a target, a diffusion effect is created, dealing damage equal to 85% of ATK on the initial target, and spreads the Ignited Sparrow effect to nearby targets while refreshing the duration of Ignited Sparrow. Cooldown: 5 seconds.",
        "3★": "3★ When your HP is under 50%, consume 1 sparrowfeather every 0.5 seconds and recover 2% of max HP until max HP is reached or all sparrowfeathers are used. While not in a team, increase this effect to 4%. This effect also works in the off-hand slot.",
        "5★": "5★ When you receive fatal damage, negate fatal damage once and gain immunity for a short period of time, and immediately get 60 sparrowfeathers and 1000 weapon charge. This effect can be triggered once every 60 seconds, and also works in the background.",
        "6★": "6★ When you are in the ultimate state, increase flame damage by an additional 20%"
    },
    "matrice_src": "/matrices/lihuomatrice.jpg",
    "matrice_2p": "Increase final damage by 9%/10%/11%/12%. The number of Sparrow Feathers obtained from dodging after using Pine Comet increases to 20. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "matrice_4p": "When equipped with at least 1 flame weapon, increase all elemental damage by 11%/14%/17%/20%. After using In All Directions, increase all elemental damage boost by an additional 7% and gradually reduce to 4% over 25 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "15.00"
},
{
    "id": 9,
    "src": "/background/rubiliabackground.jpg",
    "alt": "Imagen 9",
    "title": "Rubilia",
    "weapon": "Lost Ark",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase Volt ATK by 15% and Volt Resistance by 25%. Activate by equipping 2 or more Volt weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ After triggering Feedback, every Crystamax thorn will deal damage to nearby targets equal to 66.7% of ATK every 2 seconds, lasting 30 seconds.",
        "3★": "3★ Using any weapon skill or the discharge skill of any other weapon will generate 1 Crystamax thorn.",
        "5★": "5★ ncreases Feedback's Max HP recovery of Crystamax thorns by 50%.",
        "6★": "6★ After successfully using Harrah's Embrace, increase volt damage by an additional 12% for 30 seconds."
    },
    "matrice_src": "/matrices/rubiliamatrice.jpg",
    "matrice_2p": "Increase volt ATK by 14.5%/16.5%/18.5%/20.5%. This set effect works in the off-hand slot, and only the set with the highest star rating will take effect.",
    "matrice_4p": "Increase Crystamax thorn limit to 6. Increase all elemental damage by 13%/16%/19%/22% when a volt weapon lands an attack, lasting for 30 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "10.00",
    "charge": "12.00"
},
{
    "id": 10,
    "src": "/background/gnonobackground.jpg",
    "alt": "Imagen 10",
    "title": "Gnonno",
    "weapon": "Mini Hurricane",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with other Physical Resonance or Physical Reaction effects, with Physical Resonance taking precedence.",
    "weapon_passive": "Increase final damage by 12%. Activate by equipping 2 weapons of the same element, not including physical. This set effect works in the off-hand slot.",
    "advancements": {
        "1★": "1★ Increase the shatter of Frantic Digging, Boiling Octopus Balls, and Go on, Pip! by 80%. Gain a 50% increase to Shield when these skills are used when the Wanderer's Shield is below 50%. Lasts 8 seconds. This effect can only be triggered 1 time every 5 seconds (unavailable in Apex League).",
        "3★": "3★ Pip Octowhip limit is increased to 45. Increase physical damage by 12% for 30 seconds after using Pip Ultimate.",
        "5★": "5★ Detonating Treasure Tracers refreshes the grievous status of targets. Increase physical damage by 10% when damage is dealt to targets with less than 80% HP. This set effect works in the off-hand slot.",
        "6★": "6★ Increase damage dealt by detonating Treasure Tracers by 90% of ATK."
    },
    "matrice_src": "/matrices/gnonomatrice.jpg",
    "matrice_2p": "Increase all elemental damage by 8%/9%/10%/11% when at least 1 physical weapon is equipped. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "matrice_4p": "After using any physical weapon skill or discharge skill, increase all elemental damage by 13%/16%/19%/22% for 25 seconds. Endurance consumed when using Mini Hurricane is reduced by 40%. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "14.00"
},
{
    "id": 11,
    "src": "/background/fionabackground.jpg",
    "alt": "Imagen 11",
    "title": "Fiona",
    "weapon": "Moonstar Bracelet",
    "weapon_effects": "When the weapon is fully charged, the next attack will mark the target, causing an explosion after 5 seconds. Additionally inflict 25% of all damage received by the target while the mark exists, up to a total of 560.00% of your ATK. Only 1 mark can be added on a target at a time.",
    "element_resonance": "Increase ATK by 20% and altered resistance by 30%. Activate by equipping 2 or more altered weapons. This set effect works in the off-hand slot. Cannot stack with other Altered Resonance or Altered Reaction effects, with Altered Resonance taking precedence.",
    "weapon_passive": "Increase final damage by 12%. Activate by equipping 2 weapons of the same element, not including physical. This set effect works in the off-hand slot.",
    "advancements": {
        "1★": "1★ Using any weapon or discharge skill grants 1 elemental crystal, up to 5 crystals. Elemental crystals are lost at a rate of 1 crystal every 6 seconds. Elemental crystals provide a final damage boost equal to 4% of [(crystal count plus 1)/2] and an increased healing effect equal to 6% of [(crystal count plus 1)/2].",
        "3★": "3★ While Benediction Resonance is not active, when the target's HP is below (crystal count plus 2)%, using Moonstar Bracelet can instantly execute the target (doesn't work against Wanderers). While Benediction Resonance is active, when the target's HP is below (crystal count times 2 plus 2)%, using Moonstar Bracelet can instantly execute the target (doesn't work against Wanderers)",
        "5★": "5★ Obtain 1 elemental crystal every time Scatter Technique is used. Elemental crystals are lost at a rate of 1 crystal every 20 seconds. When receiving fatal damage, consume 3 elemental crystals to prevent death 1 time and gain damage immunity for a short time. Can be activated 1 time every 25 seconds.",
        "6★": "6★ Increase final damage by 7% of [(crystal count plus 3)/2]."
    },
    "matrice_src": "/matrices/fionamatrice.jpg",
    "matrice_2p": "After dealing damage, increase ATK by 16%/18%/20%/22% for 30 seconds. This effect does not stack. Only the effect with the highest star rating is applied when obtained repeatedly.",
    "matrice_4p": "While Benediction Resonance is not active, after using Scatter Technique, increase final damage by 17%/19%/21%/23% for 20 seconds. While Benediction Resonance is active, after using Scatter Technique, increase final damage for self and teammates by 8.5%/9.5%/10.5%/11.5% for 20 seconds. Final damage is additionally increased based on attack by (Base ATK/10000)%, up to 5%. This matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "11.50",
    "charge": "11.50"
},
{
    "id": 12,
    "src": "/background/icarusbackground.jpg",
    "alt": "Imagen 12",
    "title": "Icarus",
    "weapon": "Precious One",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "Increase final damage by 1.5% for every 1 type of weapon element equipped. This set effect also works with the weapons in the off-hand slot.",
    "advancements": {
        "1★": "1★ When any weapon skill is used, Speedy Yo-yo can trigger harmony, dealing damage to nearby targets equal to 25% of the Wanderer's lost HP. The damage dealt shall be no less than 120% of the Wanderer's Max ATK, and no more than 800% of the Wanderer's Max ATK. The type of elemental damage dealt will be that of the current weapon. When any weapon discharge is used, Speedy Yo-yo can trigger tuning, dealing damage to nearby targets equal to 4% of the Wanderer's Max HP. The damage dealt shall be no more than 400% of the Wanderer's Max ATK. The type of elemental damage dealt will be that of the current weapon.",
        "3★": "3★ When using Desolate Day, Speedy Yo-yo can trigger 9 seconds of swiftness: Speedy Yo-yo's speed is increased by 80%, damage is increased by 160%, and damage caused by passing through the target is converted to small-area damage.",
        "5★": "5★ Increase damage of Speedy Yo-yo and Return to Loneliness by 50%.",
        "6★": "6★ Increase final damage by 6% while Speedy Yo-yo is active."
    },
    "matrice_src": "/matrices/icarusmatrice.jpg",
    "matrice_2p": "Equipping Precious One, 2 or more weapons of different elements, or 2 or more types of weapons increases all elemental damage by 8%/9%/10%/11%. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "matrice_4p": "When dealing frost damage, increase all elemental damage by 13%/16%/19%/22% for 25 seconds. This set effect works in the off-hand slot, only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "9.50",
    "charge": "8.00"
},
{
    "id": 13,
    "src": "",
    "alt": "",
    "title": "Haboela",
    "weapon": "",
    "weapon_effects": "",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
        "1★": "",
        "3★": "",
        "5★": "",
        "6★": ""
    },
    "matrice_src": "/matrices/habramatrice.jpg",
    "matrice_2p": "Equipping this matrix on the current weapon increases final damage by 8.5%/10.5%/12.5%/14.5%.",
    "matrice_4p": "Increase final damage by 9%/11%/13%/15%. The effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "",
    "charge": ""
},
{
    "id": 14,
    "src": "",
    "alt": "",
    "title": "Scylla",
    "weapon": "",
    "weapon_effects": "",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
        "1★": "",
        "3★": "",
        "5★": "",
        "6★": ""
    },
    "matrice_src": "/matrices/scyllamatrice.jpg",
    "matrice_2p": "Equipping this matrix on the current weapon increases crit damage by 13%/16%/19%/23% and shatter by 13%/16%/19%/23%.",
    "matrice_4p": "Equipping 2 or more elemental weapons or multiple class weapons increases all elemental damage by 9.5%/11.5%/13.5%/15.5%. The effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "",
    "charge": ""
},
{
    "id": 15,
    "src": "/background/lanbackground.jpg",
    "alt": "Imagen 15",
    "title": "Lan",
    "weapon": "Lingguang",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. Flame Resonance and Flame Reaction does not stack; Flame Resonance takes priority.",
    "weapon_passive": "",

    "advancements": {
        "1★": "1★ Vermilion Strength: When equipping Vermilion Bird, the ammo costs of other weapons are multiplied by Polyfeather Parasol, and their damage, charge, and shatter effects are also multiplied by Polyfeather Parasol. Glowing Fire: When burn tally is triggered or when taking damage from Fiery Crash, 30% of the damage is transferred to the 3 units near the target (including the target itself) with the highest HP percentage.",
        "3★": "3★ When using any discharge attack or shatter, all the active parasols trigger a Fiery Crash, dealing 30% of their usual damage 1 time. Reduce the ATK of enemies near the parasols by 15%. When in combat, spawn 3 parasols near the target immediately after dealing damage for the first time.",
        "5★": "5★ Fiery Crash and the transferred damage ignore 60% of the target's flame resistance. Flame damage dealt by Corrosion is increased by 10%.",
        "6★": "6★ Increase the damage dealt by Dancing Flames and Soaring Strike by 50%. The multiplier for spinning parasols, Phoenix Sweep, and Fiery Crash is now Polyfeather Parasol plus 2."
    },
    "matrice_src": "/matrices/lanmatrice.jpg",
    "matrice_2p": "When equipped with at least 1 flame weapon, increase flame ATK by 6%/7%/8%/9% and flame damage by 3.2%/3.8%/4.4%/5%. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "matrice_4p": "Gain different effects based on the number of different elemental weapons equipped: Increase flame/frost/physical/volt damage by 4%/5%/6%/7% for every flame/frost/physical/volt weapon equipped. Increase final damage by 5%/6%/7%/8% for every altered weapon equipped. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "14.00",
    "charge": "12.00"
},
{
    "id": 16,
    "src": "/background/fenrirbackground.jpg",
    "alt": "Imagen 16",
    "title": "Fenrir",
    "weapon": "Gleipnir",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type. [ELEMENTAL BALANCING] Increase all ATK by 15%. Activate by equipping 3 weapons with different elements. This effect also works with weapons in the off-hand slot.",
    "weapon_passive": "",

    "advancements": {
        "1★": "1★ When Su-Paw-Star summons a consciousness and is on cooldown, gain the Aural Fever skill. Rush to the target and attack multiple times, dealing damage up to 720% of ATK. Each hit landed slows the enemy for a brief period and restores HP equal to 100% of ATK. The last hit places 2 musical notes on the target. Aural Fever cooldown: 15 seconds. When 3 or more notes are detonated and the cooldown of Aural Fever is greater than 5 seconds, clear the cooldown of Aural Fever. This effect can only trigger 1 time every 15 seconds.",
        "3★": "3★ While Songworld is active: For every 45% of max HP lost or when using the skill Aural Fever, trigger a Songworld Quake which deals damage equal to 650% of ATK to targets in the Songworld. For every 99% of max HP lost, gain 1 escape death (block a lethal effect and become immune to damage for a short time) for 45 seconds, stacking up to 1 time.",
        "5★": "5★ Increase the damage multiplier of musical notes' detonation to 40%, and the DoT caused by intoxication to 1.5% of max HP every second. While Songworld is active, Songworld Quake is triggered automatically if it doesn't trigger for 12 seconds while in combat.",
        "6★": "6★ Increase crit rate by 18% while wielding Gleipnir. The crit rate increase lasts another 5 seconds after switching to other weapons."
    },
    "matrice_src": "/matrices/fenrirmatrice.jpg",
    "matrice_2p": "Increase crit damage by 14%/15%/16%/18%. This effect does not stack. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "matrice_4p": "When dealing volt damage, increase final damage by 2.8% for 10 seconds, stacking up to 5/6/7/8 times. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "13.50",
    "charge": "10.50"
},
{
    "id": 17,
    "src": "/background/umibackground.jpg",
    "alt": "Imagen 17",
    "title": "Umi",
    "weapon": "Mobius",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ When switching to Mobius, immediately gain 30 warmup points. Cooldown: 17 seconds. Upon entering Magic Trick, deal area damage equal to 840% of ATK to nearby targets and reduce their physical resistance by 10% for 20 seconds.",
        "3★": "3★ When ending Magic Trick early, deal wide-area damage over 13 seconds. The current cooldown of Mobius' skill is reduced, and physical damage is increased by 25% for a period of time (this effect does not apply to Mobius). If Magic Trick has more than 13 seconds remaining, gain an additional 200 weapon charge. The more time remaining when Magic Trick ends, the higher the area damage, the greater the skill cooldown reduction, and the longer the physical damage boost lasts. The area damage dealt is capped at 200% of ATK (the maximum damage is dealt when the remaining time is more than 13 seconds). The maximum cooldown reduction is 13 seconds, and the physical damage boost can last up to 20 seconds.",
        "5★": "5★ Gain the Psychic Puppet effect upon entering Magic Trick, increasing Mobius's physical damage boost to 15%. During Magic Trick, recover 2% of Max HP and 10 weapon charge every second.",
        "6★": "6★ During Magic Trick, Mobius has an additional whip that is automatically swung whenever Mobius uses normal attacks or dodge attacks, dealing damage equal to 100% of Mobius's ATK (this damage is not counted as dealing normal attacks)."
    },
    "matrice_src": "/matrices/umimatrice.jpg",
    "matrice_2p": "When dealing physical damage, increase final damage by 4%/5%/6%/7% and physical damage by an additional 2%/2.5%/3%/3.5% for 3 seconds. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "matrice_4p": "When equipping 2 or more physical weapons, increase final damage by 15%/17%/19%/21%. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "9.00"
},
{
    "id": 18,
    "src": "/background/alyssbackground.jpg",
    "alt": "Imagen 18",
    "title": "Alyss",
    "weapon": "Unyielding Wing",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Receive Alyss's support when using any frost weapon skill in the Chilling Field, summoning Alyss to cast a discharge skill on the field, which is the equivalent of Wanderer casting a discharge skill. The skill that triggers the discharge skill will then be used again afterward. Alyss's supporting discharge skill damage is equal to 70% of her skill's original damage.",
        "3★": "3★ Receive Alyss's Support every time Starry Night is triggered and increase Starry Night and Hoarfrost Damage by 10% for 12 seconds. Stack up to 3 times.",
        "5★": "5★ Increase the damage of Unyielding Wing's normal attack and Spatial Slice by 35%. The Wanderer receives Alyss's Protection upon taking fatal damage, protecting the Wanderer from death 1 time and making the Wanderer immune to damage for a short time. Cooldown: 60 seconds.",
        "6★": "6★ Increase frost damage by 12% when Alyss's Support reaches 3 stacks."
    },
    "matrice_src": "/matrices/alyssmatrice.jpg",
    "matrice_2p": "Increase final damage by 4.5%/5.5%/6.5%/7.5% every time you switch to this weapon. Increase frost damage by an additional 3% for 18 seconds if it's a frost weapon. Only the set with the highest star rating will take effect.",
    "matrice_4p": "Increase final damage by 6%/7.5%/9%/10.5% for 18 seconds every time you use Unyielding Wing's discharge skill, stacking up to 2 times. Remove 1 stack when the duration ends. This set effect works in the off-hand slot and the same Matrix's effect cannot be stacked repeatedly. Latent State's endurance consumption is reduced by 50%.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "8.00",
    "charge": "12.00"
},
{
    "id": 19,
    "src": "/background/anabellabackground.jpg",
    "alt": "Imagen 19",
    "title": "Anabella",
    "weapon": "Clover Cross",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Hitting a target 2 times with Cross Snipe creates an Optical Space for 12 seconds at the target location. After an enemy in the Optical Space triggers burn tally, burn tally will be triggered an additional 2 times. When an enemy leaves the Optical Space, their speed is reduced by 80% for 2.5 seconds. Cooldown: 12 seconds. Targets of Cross Snipe will be terrified (speed is slowed by 80%) for 1.5 seconds. Cooldown: 4 seconds.",
        "3★": "3★ After Cross Snipe lands a critical hit, recover HP equal to 50% of the damage deal (not exceeding 15% of own Max HP and not including damage from Gas Explosion), and 50 weapon charge. Each stack of Tranquil Heart increases final crit rate to 6%, up to 18%, and converts up to 9% of crit damage.",
        "5★": "5★ Ruthless Bomb Enhancement: While in the Burn Enhancement state, burn damage dealt to targets is increased to 30%. Deceitful Bomb Enhancement: Gas explosion damage ignores 30% of the target's flame resistance.",
        "6★": "6★ Increase damage dealt by Cross Snipe by an additional 12%."
    },
    "matrice_src": "/matrices/anabellamatrice.jpg",
    "matrice_2p": "After hitting a target with a flame weapon, increase final damage by 3%/3.4%/3.8%/4.2% and final crit rate by 2%/2%/2.4%/2.4% for 25 seconds, stacking up to 2 times. Only the effect with the highest star rating is applied when obtained repeatedly.",
    "matrice_4p": "When equipping 2 or more flame weapons, gain Flowing Fire, which increases final damage by 7%/8%/9%/10%, and increases crit damage by an additional 12%/14%/16%/18% for 25 seconds after landing a critical hit. For every 3 charged attacks that hit the target, restore 1 dodge attempt. Cooldown: 2 seconds. Only the effect with the highest star rating is applied when obtained repeatedly.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "9.00"
},
{
    "id": 20,
    "src": "/background/tianlangbackground.jpg",
    "alt": "Imagen 20",
    "title": "Tian Lang",
    "weapon": "Thunderbreaker",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set effect also works with weapons in the off-hand slot. Effect does not stack with Volt Resonance.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Gain 1 stack of Superconductor per charge: Increase Max HP by 7.5% but increase damage received by 2% (except when the current HP is lower than 50 times volt ATK and no HP Shield is equipped), stacking up to 8 times. Lose 1 stack if no Superconductor gets refreshed within 6 seconds.",
        "3★": "3★ Release any volt weapon skill or discharge skill to get 2 charges. Gain hyperbody at 8 Superconductor stacks.",
        "5★": "5★ Each Superconductor stack increases final damage by 1%.",
        "6★": "6★ Boost Dubhe's Volt Sense: For every 1 other volt weapon sensed, gain 10% damage boost for 25 seconds."
    },
    "matrice_src": "/matrices/tianlangmatrice.jpg",
    "matrice_2p": "Every time volt damage is dealt, there is a 40% chance of triggering chain lightning, dealing damage equal to 50%/65%/90%/120% of volt ATK to up to 7 targets. Cooldown: 2 seconds. Every time chain lightning is triggered, increase volt damage by 6% for 6 seconds (chain lightning will not trigger attack effects). This effect cannot be stacked. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "matrice_4p": "Every time a volt weapon's skill or discharge skill is used, increase volt damage by 12%/14%/16%/18% for 15 seconds. This effect cannot be stacked. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "8.00"
},
{
    "id": 21,
    "src": "/background/lyrabackground.jpg",
    "alt": "Imagen 21",
    "title": "Lyra",
    "weapon": "Vesper",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "Increase the entire team's physical ATK by 5% when Benediction Resonance is active.",
    "advancements": {
        "1★": "1★ When releasing any weapon skill or discharge, if your Guards are at the maximum, the Guard duration will be refreshed, dealing physical damage equal to 30% of physical ATK × number of Guards to the enemy. Up to 8 Guards when under the effect of Benediction, and up to 6 without it.",
        "3★": "3★ Increases all damage dealt by Guards by 20%, and increase the guarded target's final damage by 15% for 10 seconds when releasing any weapon skill or discharge under the effect of Benediction Resonance.",
        "5★": "5★ Forgiveness Guard: After releasing Resonance 5 times, receive 1 chance to negate fatal damage for the wielder and the guarded target. After a temmate negates fatal damage, they will consume Forgiveness Guard and recover 5% of Max HP. Unavailable in Apex League. Enlightenment Guard: After releasing Resonance 5 times and when having Enlightenment Guard, the wielder receives 2 chances to negate fatal damage. Stack up to 5 times. After the wielder negates fatal damage, they will consume 1 stack of Enlightenment Guard and recover 5% of Max HP. Unavailable in Apex League.",
        "6★": "6★ When unleashing any weapon skill or discharge, the increase of final damage and healing depends on the number of Guards. Each Guard increases final damage and healing by 1.6%, up to 8% for 25 seconds."
    },
    "matrice_src": "/matrices/lyramatrice.jpg",
    "matrice_2p": "Use this weapon to increase all attack types by 13%/17%/21%/25%. The lower the HP, the higher the healing received, which can be increased up to 100%.",
    "matrice_4p": "When dealing physical damage, increase physical damage by 2.7% with a cooldown of 0.1 seconds. Stack up to 5 times. Upon reaching the maximum stacks, increase physical damage by an additional 3.5%/7%/10.5%/14% for 5 seconds. Only the highest star rating's effect is applied when obtained repeatedly. Obtain 1 block for each dodge, blocking damage up to 60% of current HP, but not less than 20% of Max HP. Stack up to 3 blocks for 10 seconds.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "10.00"
},
{
    "id": 22,
    "src": "/background/linbackground.jpg",
    "alt": "Imagen 22",
    "title": "Lin",
    "weapon": "Shadoweave",
    "weapon_effects": "When the weapon is fully charged, the next attack will mark the target, causing an explosion after 5 seconds. Additionally inflict 25% of all damage received by the target while the mark exists, up to a total of 560.00% of your ATK. Only 1 mark can be added on a target at a time.",
    "element_resonance": "When pairing Shadoweave with other weapons, the Weapons Master effect can be created. Epiphyllum will appear around the target randomly and explode within 1-3 seconds, dealing 25% area damage.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Normal attacks now deal area damage upon hit. When there is another epiphyllum within the epiphyllum explosion area, increase the damage of each of the subsequent epiphyllum explosions by 10%, up to a maximum of 50%. The epiphyllum generation interval from Moonlight Realm is now reduced to 0.5 seconds.",
        "3★": "3★ The epiphyllum generation interval from Moonlight Realm is now reduced to 0.3 seconds. Epiphyllums will attach to the enemy. The duration of Moonlight Realm is now increased to 20 seconds.",
        "5★": "5★ While under the effect of Moonlight Realm, gain 30 weapon charge every second and increase the damage of discharge skills by 15%.",
        "6★": "6★ Moonlight Realm can be activated up to 2 times. Gain 1 charge from skill cooldown. Gain 1 charge from using discharge skills 3 times (effective in the background). The ATK bonus while inside Moonlight Realm is increased to 23%."
    },
    "matrice_src": "/matrices/linmatrice.jpg",
    "matrice_2p": "Increase ATK by 2.1%/2.6%/3.1%/3.6% on hit for 18 seconds, stacking up to 5 times. Only the effect of the highest level is applied when obtained repeatedly.",
    "matrice_4p": "Every 5m traveled within Moonlight Realm grants 1 stack of Moonlight, increasing final damage by 4%/4.9%/5.8%/6.7% for 15 seconds, stacking up to 3 times. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "11.50",
    "charge": "11.50"
},
{
    "id": 23,
    "src": "/background/sakifuwabackground.jpg",
    "alt": "Imagen 23",
    "title": "Saki Fuwa",
    "weapon": "Heartstream",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ When Frost Resonance is activated, all weapon skill cooldowns are cleared every 5 times weapon skills are used, and the damage of Flow and Counterattack is doubled for the next 25 seconds.",
        "3★": "3★ Excited Flow: Increase the damage of Sword Shadow: Surge to 350% of Frost ATK. Silent Flow: The cooldown of Sword Shadow: Surge becomes 5 seconds.",
        "5★": "5★ Freeze time and trigger Phantasia upon Surge hitting the target. Share cooldown with the Phantasia triggered by dodging.",
        "6★": "6★ Upon hitting a target with Surge, increase frost damage by 11% for 15 seconds. Upon triggering block with Sword Shadow, reduce the frost damage dealt by enemy targets by 25% for 12 seconds."
    },
    "matrice_src": "/matrices/sakifuwamatrice.jpg",
    "matrice_2p": "When Frost Resonance gets triggered: Every 3 seconds, deal frost damage equal to 65%/80%/95%/110% of frost ATK to enemies within a 10-meter radius and apply the Icefrost effect: Inflict 5% slow effect that lasts for 3.5 seconds, freeze targets for 3 seconds at 3 stacks (does not apply to bosses), and increase frost damage taken by the target by 5% for 18 seconds. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "matrice_4p": "Attack the target 10 times to inflict a 12-second Flashfreeze mark. Flashfreeze: Increase frost damage dealt to the marked target by 11%/13%/15%/17%. This Matrix's effect is also active in the off-hand slot, but only the set with the highest star rating will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "13.90",
    "charge": "8.00"
},
{
    "id": 24,
    "src": "/background/rubybackground.jpg",
    "alt": "Imagen 24",
    "title": "Ruby",
    "weapon": "Spark",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Emblazen boosts the damage of Spark Attack to 80%. Skill cooldown drops to 24 seconds.",
        "3★": "3★ Emblazen increases flame boost by 8% and the burn multiplier to 75%",
        "5★": "5★ Restore an additional 75 points of weapon charge each time Spark Attack hits an enemy. Cooldown: 0.9 seconds. Shatter increases by 25% when Ultimate Heat is active.",
        "6★": "6★ Emblazen boosts the damage of Spark Attack to 160% and double Heat acquisition efficiency. Skill cooldown drops to 16 seconds."
    },
    "matrice_src": "/matrices/rubymatrice.jpg",
    "matrice_2p": "Increases flame ATK after casting weapon skill by 8%/10%/12%/15% for 25 seconds. If multiple star rating effects are triggered, the one triggered last prevails. This effect does not stack.",
    "matrice_4p": "Grant Mastery after casting weapon skill for 15 seconds, with a cooldown of 15 seconds (Mastery shares cooldowns across levels). Mastery is not stackable. Increases flame damage by 2%/2.5%/3%/3.5% every time the target is hit with a normal attack until the end of Mastery. Stacks up to 6 times, adding a maximum of 1 stack every 0.2 seconds. At 6 stacks, grants a shield that can block damage 1 time.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "11.50",
    "charge": "8.00"
},
{
    "id": 25,
    "src": "/background/friggbackground.jpg",
    "alt": "Imagen 25",
    "title": "Frigg",
    "weapon": "Balmung",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set's effect also works with weapons in the off-hand slot. This effect does not stack.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Gain 1 frostiness point every time you deal 550% x Frost ATK of damage in the Frost Domain. Up to 10 points can be accumulated.When Frost Domain ends, frostiness points x Frost ATK x 95% of blast damage will be dealt to all enemies in the Frost Domain. After leaving the Frost Domain lose 1 frostiness point every 3 seconds.",
        "3★": "3★ The maximum frostiness is increased to 15 points. Unleashing discharge skills with frost weapons in the Frost Domain will deal 25% x Frost ATK of damage to all targets in the Frost Domain (Gain +5 frostiness points).",
        "5★": "5★ Shattering shields using frost weapons in the Frost Domain will freeze the target for 2 seconds and cause frostiness points x Frost ATK x 35% of additional damage (if the target cannot be frozen, double the additional damage dealt).",
        "6★": "6★ When frostiness reaches 15 points and you are in the Frost Domain, you will get an additional Domain of Frost II that increases Frost ATK by 25% when frost weapons are used."
    },
    "matrice_src": "/matrices/friggmatrice.jpg",
    "matrice_2p": "Increase frost ATK by 8%/10%/12%/15% for 10 seconds when switching between frost weapons. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "matrice_4p": "When unleashing a frost domain with the weapon Balmung, enemies within the frost domain receive frost damage equal to 55%/65%/75%/85% of frost ATK every second.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "8.00",
    "charge": "8.00"
},
{
    "id": 26,
    "src": "/background/nemesisbackground.jpg",
    "alt": "Imagen 26",
    "title": "Nemesis",
    "weapon": "Venus",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set's effects do not work with others.",
    "weapon_passive": "Increase the entire team's volt ATK by 5% when Benediction Resonance is active.",
    "advancements": {
        "1★": "1★ After using Pulse Lock or Particle Beam Burst, creates 1 Electrode that immediately grants the user 5 stacks of healing chain enhance. In addition, unleash a healing chain that heals nearby allies by 135% of the Wanderer's ATK.",
        "3★": "3★ Every 6 seconds, the Electrode will unleash Ring Lightning, which deals damage equal to a maximum of 205% of ATK in a target area.",
        "5★": "5★ After using Pulse Lock, increase the Wanderer's ATK by (5 + (Number of Electrodes x 5)) % for 25 seconds.",
        "6★": "6★ Up to 2 Electrodes can be active at the same time. Summoning more Electrodes will replace the ones furthest from the user."
    },
    "matrice_src": "/matrices/nemesismatrice.jpg",
    "matrice_2p": "When a target is being healed, their volt ATK is increased by 8%/10%/12%/15% for 20 seconds. The effect does not stack, and only the highest level's effect is applied when obtained repeatedly.",
    "matrice_4p": "When healing yourself or your Electrode, the healed target gains a charge of Lightning. The next attack within 30 seconds will cast lightning upon the target, dealing volt damage equal to 240%/300%/360%/420% of volt ATK, and damage caused by electrodes is reduced by 50%. Cannot be triggered more than once in 10 seconds. Lightning charges do not stack. Only the highest level's effect is applied when obtained repeatedly.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "6.00",
    "charge": "8.00"
},
{
    "id": 27,
    "src": "/background/marcbackground.jpg",
    "alt": "Imagen 27",
    "title": "Marc",
    "weapon": "Dawn",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "[GROUP PLAY] When using Re-entry, Form Switch, or Full Shot, take 40% damage for your lowest HP ally and recover 10% of it back after 10 seconds. Only activates while using Fortitude Resonance and the effect cannot be removed early or reactivated until it ends. [SOLO PLAY] Mecha Form gains 50% physical damage reduction. Mecha basic attack/Double Smash/Impact Slash will give 1 point of Mecha Energy. At 20 points, convert 20% of your current HP into a [Omni Shield] with 1.5x your max HP (cannot exceed 1.5x max HP and healing is reduced by 50% while active). The shield lasts for 15 seconds and cannot be gained if you are below 10% HP. After the duration, 66.7% of the remaining shield value is converted to HP, and hitting a weak target nets 2 points of energy. When triggering the effect, convert active HP shields into [Omni Shield]. Other HP shields cannot be obtained while active.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Activating Re-entry, Form Switch, or Full Shot will instantly grant [Omni Shield].",
        "3★": "3★ When [Omni Shield] breaks or refreshes, increase final damage by 35% for 20 seconds, does not stack.",
        "5★": "5★ When [Omni Shield] breaks or refreshes, inflict 160% of ATK + 5% of lost HP to nearby targets and gains 50 weapon charge points on hit.",
        "6★": "6★ While [Omni Shield] is active, Physical Resistance is doubled and provides Dominance effect. [Omni Shield] can be obtained when another Weapon Skill or Discharge Skill hits the target while the shield is active."
    },
    "matrice_src": "/matrices/marcmatrice.jpg",
    "matrice_2p": "Attacking an enemy adds a life shield to all teammates for 15% of your current HP, lasting 15 seconds and resetting after leaving combat for 10 seconds. This shield combines with other shields. When the shield is activated, damage received is reduced by 11%/13%/15%/17% for 15 seconds (not stackable). This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "matrice_4p": "When life shields are obtained from any source, increase your ATK by 6%/7.5%/9%/11.5% and teammates' ATK by 3%/3.5%/4.5%/5.75% for 15 seconds, up to 3 stacks. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "9.00",
    "charge": "12.00"
},
{
    "id": 28,
    "src": "/background/bayuekibackground.jpg",
    "alt": "Imagen 28",
    "title": "Bayuekui",
    "weapon": "Alaya",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "When entering combat, trigger War Intent, increasing your final damage by 15% but accelerating your cellular aging (lose 1% of your current HP every 5 seconds). The effect disappears when leaving battle or switching weapons. If your HP drops below 50%, cellular aging stops but the damage boost from War Intent remains (switching weapons causes the effect to disappear).",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Dodge attacks gain an additional hit dealing 80% of ATK + 2.5% of HP lost. The Weapon Skill explodes for an additional 160% of ATK + 5% of HP lost. The Discharge Skill deals an additional 160% of ATK + 5% of lost HP (does not apply to the DoT).",
        "3★": "3★ Increase shatter by 15%. Breaking a shield releases an instant burst of damage at the target's location, dealing 680% of ATK to targets within range, or 1500% of ATK if there is only one target within range.",
        "5★": "5★ When attacked, automatically trigger a 1 second block (immediately negates crowd control), blocking one hit up to 20% of your max HP. Performing a basic attack during the block period will initiate a counter attack, dealing 240% of ATK and launching the target airborne, cooldown 18 seconds.",
        "6★": "6★ While inside the area of the Discharge Skill or Phantasia, trigger War Intent for 7 seconds, increasing your final damage by 40% and halting cellular aging (switching weapons causes the effect to disappear)."
    },
    "matrice_src": "/matrices/bayuekimatrice.jpg",
    "matrice_2p": "If you have 200~999 charge when switching to this weapon, use 200 charge to gain a 15%/18%/21%/25% attack boost for 15 seconds, cooldown 5 seconds, does not stack.",
    "matrice_4p": "When you delay using a discharge skill, the next discharge skill will deal AoE damage to enemies within 5m. The AoE will increase by 106%/122%/140%/160% every 0.6 seconds, up to 530%/610%/700%/800%. The discharge will also increase Shatter by 7%/14%/21%/28% for 4 seconds. This effect works in the background, and if multiple sets are used, the highest star set will take effect.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "8.00"
},
{
    "id": 29,
    "src": "/background/cobaltbbackground.jpg",
    "alt": "Imagen 29",
    "title": "Cobalt B",
    "weapon": "Flaming Revolver",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 15% and flame resistance by 25%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. This effect does not stack repeatedly.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Each round of Barrage deals additional damage equal to 2% of the target's current HP (cannot exceed 180% of ATK).",
        "3★": "3★ Heavy Bombardment branch skill and Close Quarters dodge attack inflict Ion Scorch on targets that are already burned, dealing flame damage equal to 40% of ATK every second for 10 seconds.",
        "5★": "5★ The damage from Ion Scorch increases to 60% of ATK. Successful attacks with any weapon's dodge skill will refresh the duration of Ion Scorch.",
        "6★": "6★ Barrage inflicts burn for 15 seconds. Successful attacks with any weapon's dodge skills reduce cooldown of Barrage by 4 seconds. This effect has a 1.5-second cooldown."
    },
    "matrice_src": "/matrices/cobaltbmatrice.jpg",
    "matrice_2p": "Increase damage against debuffed targets by 14%/16%/18%/20%.",
    "matrice_4p": "Restore 1 dodge attempt every 3 dodges. Dodge skills inflict burn upon hit, dealing damage equal to 24%/30%/36%/42% of ATK every 0.5 seconds for 4 seconds.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "10.00"
},
{
    "id": 30,
    "src": "/background/claudiabackground.jpg",
    "alt": "Imagen 29",
    "title": "Claudia",
    "weapon": "Guren Blade",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "Increase physical ATK by 15% and physical resistance by 25%. Activate by equipping 2 or more physical-damage weapons. This set also works with weapons in the off-hand slot. This effect does not stack repeatedly.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ After hitting a target with a skill or discharge skill, grant 1 stack of the following buff: Increase damage dealt by 8% for 25 seconds, stacking up to 3 times for a maximum of 1 stack per skill use.",
        "3★": "3★ When hitting a target with a skill or discharge skill, apply 1 stack of War Wounds to the target: Increase incoming physical damage and shatter from physical weapons by 10% for 15 seconds. Stack up to 1 time.",
        "5★": "5★ Hitting targets with skills or discharge skills grants Skill Damage Boost, which increases all weapon skill damage by 20% for 25 seconds. This effect cannot be stacked.",
        "6★": "6★ Skills hitting the same target no longer have reduced damage. After using Guren Blade's skills or discharge skill, all targets with War Wounds within 8 meters gain another 1 stack of War Wounds."
    },
    "matrice_src": "/matrices/claudiamatrice.jpg",
    "matrice_2p": "Increase damage against debuffed targets by 14%/16%/18%/20%.",
    "matrice_4p": "Restore 1 dodge attempt every 3 dodges. Dodge skills inflict burn upon hit, dealing damage equal to 24%/30%/36%/42% of ATK every 0.5 seconds for 4 seconds.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "7.50",
    "charge": "12.00"
},
{
    "id": 31,
    "src": "/background/zerobackground.jpg",
    "alt": "Imagen 31",
    "title": "Zero",
    "weapon": "Negating Cube",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "Increase flame ATK by 20% and flame resistance by 40%. Activate by equipping 2 or more flame weapons. This set effect also works with weapons in the off-hand slot. Cannot stack with other Flame Resonance or Flame Reaction effects, with Flame Resonance taking precedence.",
    "weapon_passive": "Increase the entire team's flame ATK by 5% when Benediction Resonance is activated.",
    "advancements": {
        "1★": "1★ Deal damage and produce a healing orb, which lasts for 20 seconds and restore HP of any teammate who picks it up equal to 60% of ATK. 2-second cooldown.",
        "3★": "3★ Reduce skill cooldown from 60 seconds to 30 seconds. Restore HP equal to 30% of ATK every second while the shield is active.",
        "5★": "5★ Damaging a target also produces a damage orb, which lasts for 20 seconds and increases all damage and healing of any teammate who picks it up by 2% for 30 seconds. Stack up to 10 times. Skill cooldown is 2.5 seconds.",
        "6★": "6★ Using a Skill grants allies healing orbs and damage orbs equal to the number of Omnium Cubes."
    },
    "matrice_src": "/matrices/zeromatrice.jpg",
    "matrice_2p": "Upon using a discharge skill to switch to the current weapon, gain a shield equal to 150%/200%/250%/300% of ATK for 6 seconds.",
    "matrice_4p": "While the shield is active, you and your teammates deal 16%/20%/24%/28% more damage.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "5.00",
    "charge": "13.00"
},
{
    "id": 32,
    "src": "/background/tsubasabackground.jpg",
    "alt": "Imagen 32",
    "title": "Tsubasa",
    "weapon": "Icewind Arrow",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Deal damage and produce a healing orb, which lasts for 20 seconds and restore HP of any teammate who picks it up equal to 60% of ATK. 2-second cooldown.",
        "3★": "3★ Reduce skill cooldown from 60 seconds to 30 seconds. Restore HP equal to 30% of ATK every second while the shield is active.",
        "5★": "5★ Damaging a target also produces a damage orb, which lasts for 20 seconds and increases all damage and healing of any teammate who picks it up by 2% for 30 seconds. Stack up to 10 times. Skill cooldown is 2.5 seconds.",
        "6★": "6★ Using a Skill grants allies healing orbs and damage orbs equal to the number of Omnium Cubes."
    },
    "matrice_src": "/matrices/tsubasamatrice.jpg",
    "matrice_2p": "Increase damage dealt by 14%/16%/18%/20% when there are no enemies within 4 meters.",
    "matrice_4p": "Upon a headshot or using Icewind Arrow: Piercing Shot, increase ATK by 15%/18%/21%/25% for 8 seconds.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "4.00",
    "charge": "11.50"
},
{
    "id": 33,
    "src": "/background/shirobackground.jpg",
    "alt": "Imagen 33",
    "title": "Shiro",
    "weapon": "Chakram of the Seas",
    "weapon_effects": "Fully charged weapons will inflict damage equal to 137.00% of ATK with the next attack, and make the target grievous for 7 seconds, taking 20% extra damage.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Increase damage dealt to and all elemental shattering effects on targets within Full Bloom's range by 30%.",
        "3★": "3★ Increase shatter by 15% and reset all weapon skill cooldowns upon shattering the target's shield. Can only be triggered once every 30 seconds.",
        "5★": "5★ Attacking a grievous target extends the duration of grievous by an additional 7 seconds (only take effect once for the same effect).",
        "6★": "6★ After using Full Bloom, grant a 100% crit chance for the next 8 seconds"
    },
    "matrice_src": "/matrices/shiromatrice.jpg",
    "matrice_2p": "Increase both damage and shatter to targets with more than 50% HP by 15%/19%/22.5%/26%.",
    "matrice_4p": "Upon entering battle, gain a 20%/25%/30%/35% damage boost for 35 seconds. Reset 5 seconds after exiting battle.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "10.00",
    "charge": "6.00"
},
{
    "id": 34,
    "src": "/background/samirbackground.jpg",
    "alt": "Imagen 34",
    "title": "Samir",
    "weapon": "Dual EM Stars",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Trigger an electrical explosion on the target after landing a critical hit, dealing additional damage equal to 30% of ATK to the target and nearby enemies. Cooldown: 0.2 seconds.",
        "3★": "3★ Increase crit rate to electrified targets by 40%. Electrical explosions extend the duration of electrified effects by 0.5 seconds, up to a maximum of 5 seconds.",
        "5★": "5★ Double the duration of Electro Field and pull targets into the center of the attack.",
        "6★": "6★ Triggering an electrical explosion reduces skill cooldowns by 1 second."
    },
    "matrice_src": "/matrices/samirmatrice.jpg",
    "matrice_2p": "Increase damage progressively by 1% upon hitting a target. Stack up to 10/13/16/20 times. Lasts 1.5 seconds.",
    "matrice_4p": "Increase Dual EM Stars' electrical explosion damage by 16%/22%/30%/40% of ATK.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "6.00",
    "charge": "10.70"
},
{
    "id": 35,
    "src": "/background/merylbackground.jpg",
    "alt": "Imagen 35",
    "title": "Meryl",
    "weapon": "Rosy Edge",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Increase shatter by 15% and restore 10% of HP after shattering the target's shield.",
        "3★": "3★ Upon switching to the weapon, gain an Ice Shield equal to 10% of Max HP. Cooldown 20 seconds. The Ice Shield lasts up to 10 seconds.",
        "5★": "5★ Increase damage and shatter by 50% while the shield is active.",
        "6★": "6★ Upon switching to the weapon, gain an Ice Shield equal to 20% of Max HP and immmune to controls when shield is active. Cooldown: 20 seconds. The Ice Shield lasts up to 10 seconds."
    },
    "matrice_src": "/matrices/merylmatrice.jpg",
    "matrice_2p": "If HP is less than 30% after being attacked, gain a shield equal to 20%/26%/32%/40% of Max HP for 10 seconds. Cooldown: 90 seconds.",
    "matrice_4p": "Increase Whirlwind's damage by 36%/45%/54%/63% and restore HP equal to 30%/38%/44%/50% of the damage dealt while Whirlwind is active. The maximum HP restored every 0.5 seconds cannot exceed 60%/72%/81%/90% of ATK.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.00",
    "charge": "4.00"
},
{
    "id": 36,
    "src": "/background/kingbackground.jpg",
    "alt": "Imagen 36",
    "title": "King",
    "weapon": "Scythe of the Crow",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Increase shatter by 15%. After shattering the target's shield, deal burn damage equal to 120% of ATK to the target every second for 15 seconds.",
        "3★": "3★ Increase damage dealt by 10% for each enemy within 6 meters, up to a maximum of 30%.",
        "5★": "5★ Increase damage dealt against HP shields or shielded enemies by 100%.",
        "6★": "6★ Increase damage dealt by 10% for each enemy slain for 30 seconds. Stack up to 3 times."
    },
    "matrice_src": "/matrices/kingmatrice.jpg",
    "matrice_2p": "When a target is shattered, grant 8%/10%/12%/14% damage boost for 25 seconds. Only the highest level is applied when the effect is obtained repeatedly.",
    "matrice_4p": "When there are more than 2 enemies around, hits restore HP equal to 14%/18%/22%/26% of damage dealt upon attacking. The maximum HP restored every 0.5 seconds must not exceed 36%/42%/48%/54% of ATK.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "12.50",
    "charge": "5.00"
},
{
    "id": 37,
    "src": "/background/humabackground.jpg",
    "alt": "Imagen 37",
    "title": "Huma",
    "weapon": "Molten Shield V2",
    "weapon_effects": "Fully charged weapons will set the target on fire for 8 seconds with the next attack, causing ongoing damage of 58.00% of ATK every second. Ignited targets receive 50% efficacy from healing.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Gain a stack of Strong Shield upon casting Discharge: Seething Rage. Using a dodge skill or branch skill while in shield form grants a stack of Strong Shield, which grants 10% damage reduction for 15 seconds and stacks up to 3 times. Switching to axe form converts all Strong Shield stacks to Sharp Axe stacks, each of which increases damage dealt by 15% for 15 seconds. Switching to a different weapon cancels this effect.",
        "3★": "3★ While in shield form, branch/dodge attacks deal additional damage to targets equal to 4% of the user's current HP.",
        "5★": "5★ After switching to a shield axe, immediately grant 30% damage reduction that diminishes by 10% every 3 seconds, down to a minimum of 10%. Switching weapons cancels this effect. Cooldown: 30 seconds.",
        "6★": "6★ Enhance conversion skills. Shield Conversion Enhancement: Increase damage dealt by 60% and expand the radius of the flame zone by 30%. Axe Conversion Enhancement: Does not share cooldown with Shield Conversion. For the next 5 seconds after using this skill, turns all damage received into HP (up to a maximum of 15% of the user's Max HP)."
    },
    "matrice_src": "/matrices/humamatrice.jpg",
    "matrice_2p": "Hitting targets with dodge skills inflicts bleed, dealing damage equal to 15%/19%/22.5%/26% of ATK every second for 5 seconds.",
    "matrice_4p": "Reduce ATK of all targets within 8 meters that are taking damage over time by 10%/12%/13%/15%. Only the highest level's effect is applied when obtained repeatedly.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "10.00",
    "charge": "10.00"
},
{
    "id": 38,
    "src": "/background/crowbackground.jpg",
    "alt": "Imagen 38",
    "title": "Crow",
    "weapon": "Thunderblades",
    "weapon_effects": "When the weapon is fully charged, the next attack will paralyze targets for 1 second and electrify them for 6 seconds, negating all buffs and dealing damage equal to 144.00% of ATK. Targets can't receive any buffs for the next 6 seconds.",
    "element_resonance": "",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ Attacking targets from behind increases crit rate of all dual blades attacks by 40%. Backstabbing an electrified target increases crit rate by 100% and crit damage by 30%.",
        "3★": "3★ Increase damage by 30% to targets with less than 60% HP.",
        "5★": "5★ Triggering a Back Attack grants a 100% crit chance for the next 4 seconds and increases crit damage by 50%. Cooldown: 10 seconds.",
        "6★": "6★ After using a skill, increase volt damage dealt to the target by 20% for 20 seconds."
    },
    "matrice_src": "/matrices/crowmatrice.jpg",
    "matrice_2p": "Increase crit damage to targets with less than 60% HP by 24%/30%/36%/42%.",
    "matrice_4p": "Crits deal additional damage over time equal to 18%/22%/26%/30% of ATK every second for 5 seconds. Does not stack.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "6.00",
    "charge": "8.00"
},
{
    "id": 39,
    "src": "/background/cocoritterbackground.jpg",
    "alt": "Imagen 39",
    "title": "Cocoritter",
    "weapon": "Absolute Zero",
    "weapon_effects": "Fully charged weapons will freeze the target for 2 seconds and leave it frostbitten for 6 seconds. Breaking the ice shell causes additional damage equal to 151.00% of ATK. While frostbitten, the target's weapon charge rate is reduced by 50%.",
    "element_resonance": "Increase frost ATK by 15% and frost resistance by 25%. Activate by equipping 2 or more frost weapons. This set effect also works in the off-hand slot. Cannot stack with effects of the same type. Increase the entire team's frost ATK by 5% when Benediction resonance is active.",
    "weapon_passive": "",
    "advancements": {
        "1★": "1★ After dodging, summon a healing bee that follows the user and heals the ally with the lowest percentage of HP within 15 meters. Heal for 25% of ATK and restore 50 weapon charge points each time and last for 25 seconds. Cooldown: 25 seconds.",
        "3★": "3★ Use Sanctuary or discharge skills to remove debuffs from targets, can be used while being affected by control effects. Increase shatter and damage dealt for all teammates within range by 20%, and grant them immunity to control effects and shatter.",
        "5★": "5★ Increase healing effect by 15%, plus an additional 20% when healing targets with less than 60% HP.",
        "6★": "6★ Whenever a healing bee is summoned or disappears from battle, heal all allies for 100% of the user's ATK. All allies within 10 meters of the healing bee also gain 15% all damage and healing boost (cannot stack)."
    },
    "matrice_src": "/matrices/cocorittermatrice.jpg",
    "matrice_2p": "Increase healing capability and healing received by 10%/12%/14%/16%.",
    "matrice_4p": "When you or your teammates are healed, increase ATK by 12.5%/15%/17.5%/20% for 6 seconds. Only the highest level's effect is applied when obtained repeatedly.",
    "miniImage1": "src/assets/mini-images/dps.jpg",
    "miniImage2": "src/assets/mini-images/fireelement.jpg",
    "shatter": "4.00",
    "charge": "12.50"
}







]